cpu_types = {
  'V9fsStat': [ 0x90, {
    'size': [0x0, ['short']],
    'type': [0x2, ['short']],
    'dev': [0x4, ['int']],
    'qid': [0x8, ['V9fsQID']],
    'mode': [0x18, ['int']],
    'atime': [0x1c, ['int']],
    'mtime': [0x20, ['int']],
    'length': [0x28, ['long']],
    'name': [0x30, ['V9fsString']],
    'uid': [0x40, ['V9fsString']],
    'gid': [0x50, ['V9fsString']],
    'muid': [0x60, ['V9fsString']],
    'extension': [0x70, ['V9fsString']],
    'n_uid': [0x80, ['int']],
    'n_gid': [0x84, ['int']],
    'n_muid': [0x88, ['int']],
}],
  '__alloc_traits<std::allocator<llvm::Type*': [ 0x1, {
}],
  'PacketIdQueueEntry': [ 0x18, {
    'id': [0x0, ['unsigned long']],
    'next': [0x8, ['__unnamed_0x3a3a']],
}],
  '__unnamed_0xd4': [ 0x8, {
    '__val': [0x0, ['array', 2, ['int']]],
}],
  'mfi_ld_props': [ 0x20, {
    'ld': [0x0, ['mfi_ld_ref']],
    'name': [0x4, ['array', 16, ['char']]],
    'default_cache_policy': [0x14, ['unsigned char']],
    'access_policy': [0x15, ['unsigned char']],
    'disk_cache_policy': [0x16, ['unsigned char']],
    'current_cache_policy': [0x17, ['unsigned char']],
    'no_bgi': [0x18, ['unsigned char']],
    'reserved': [0x19, ['array', 7, ['unsigned char']]],
}],
  'NetEvent': [ 0x18, {
    'id': [0x0, ['unsigned char']],
    'flags': [0x4, ['unsigned int']],
    'data': [0x8, ['pointer', ['unsigned char']]],
    'size': [0x10, ['unsigned long']],
}],
  'audio_capture_ops': [ 0x18, {
    'notify': [0x0, ['pointer', ['void']]],
    'capture': [0x8, ['pointer', ['void']]],
    'destroy': [0x10, ['pointer', ['void']]],
}],
  'DataCache': [ 0x28, {
    'fd': [0x0, ['int']],
    'buf': [0x8, ['pointer', ['unsigned char']]],
    'buf_size': [0x10, ['unsigned long']],
    'data_size': [0x18, ['unsigned long']],
    'offset': [0x20, ['long']],
}],
  'netif_rx_back_ring': [ 0x18, {
    'rsp_prod_pvt': [0x0, ['unsigned int']],
    'req_cons': [0x4, ['unsigned int']],
    'nr_ents': [0x8, ['unsigned int']],
    'sring': [0x10, ['pointer', ['netif_rx_sring']]],
}],
  'xenfb_page': [ 0x828, {
    'in_cons': [0x0, ['unsigned int']],
    'in_prod': [0x4, ['unsigned int']],
    'out_cons': [0x8, ['unsigned int']],
    'out_prod': [0xc, ['unsigned int']],
    'width': [0x10, ['int']],
    'height': [0x14, ['int']],
    'line_length': [0x18, ['unsigned int']],
    'mem_length': [0x1c, ['unsigned int']],
    'depth': [0x20, ['unsigned char']],
    'pd': [0x28, ['array', 256, ['unsigned long']]],
}],
  'FWCfgState': [ 0x460, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'file_slots': [0x300, ['unsigned short']],
    'entries': [0x308, ['array', 2, ['pointer', ['FWCfgEntry']]]],
    'entry_order': [0x318, ['pointer', ['int']]],
    'files': [0x320, ['pointer', ['FWCfgFiles']]],
    'cur_entry': [0x328, ['unsigned short']],
    'cur_offset': [0x32c, ['unsigned int']],
    'machine_ready': [0x330, ['Notifier']],
    'fw_cfg_order_override': [0x348, ['int']],
    'dma_enabled': [0x34c, ['unsigned char']],
    'dma_addr': [0x350, ['unsigned long']],
    'dma_as': [0x358, ['pointer', ['AddressSpace']]],
    'dma_iomem': [0x360, ['MemoryRegion']],
}],
  'omap_gp_timer_s': [ 0x1c0, {
    'iomem': [0x0, ['MemoryRegion']],
    'irq': [0x100, ['pointer', ['IRQState']]],
    'wkup': [0x108, ['pointer', ['IRQState']]],
    'in': [0x110, ['pointer', ['IRQState']]],
    'out': [0x118, ['pointer', ['IRQState']]],
    'clk': [0x120, ['pointer', ['clk']]],
    'timer': [0x128, ['pointer', ['QEMUTimer']]],
    'match': [0x130, ['pointer', ['QEMUTimer']]],
    'ta': [0x138, ['pointer', ['omap_target_agent_s']]],
    'in_val': [0x140, ['int']],
    'out_val': [0x144, ['int']],
    'time': [0x148, ['long']],
    'rate': [0x150, ['long']],
    'ticks_per_sec': [0x158, ['long']],
    'config': [0x160, ['short']],
    'status': [0x164, ['int']],
    'it_ena': [0x168, ['int']],
    'wu_ena': [0x16c, ['int']],
    'enable': [0x170, ['int']],
    'inout': [0x174, ['int']],
    'capt2': [0x178, ['int']],
    'pt': [0x17c, ['int']],
    'trigger': [0x180, ['Enumeration', {'target': 'int', 'choices': {0: 'gpt_trigger_none', 1: 'gpt_trigger_overflow', 2: 'gpt_trigger_both'}}]],
    'capture': [0x184, ['Enumeration', {'target': 'int', 'choices': {0: 'gpt_capture_none', 1: 'gpt_capture_rising', 2: 'gpt_capture_falling', 3: 'gpt_capture_both'}}]],
    'scpwm': [0x188, ['int']],
    'ce': [0x18c, ['int']],
    'pre': [0x190, ['int']],
    'ptv': [0x194, ['int']],
    'ar': [0x198, ['int']],
    'st': [0x19c, ['int']],
    'posted': [0x1a0, ['int']],
    'val': [0x1a4, ['unsigned int']],
    'load_val': [0x1a8, ['unsigned int']],
    'capture_val': [0x1ac, ['array', 2, ['unsigned int']]],
    'match_val': [0x1b4, ['unsigned int']],
    'capt_num': [0x1b8, ['int']],
    'writeh': [0x1bc, ['unsigned short']],
    'readh': [0x1be, ['unsigned short']],
}],
  'A9GTimerState': [ 0x8f0, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'num_cpu': [0x400, ['unsigned int']],
    'timer': [0x408, ['pointer', ['QEMUTimer']]],
    'counter': [0x410, ['unsigned long']],
    'ref_counter': [0x418, ['unsigned long']],
    'cpu_ref_time': [0x420, ['unsigned long']],
    'control': [0x428, ['unsigned int']],
    'per_cpu': [0x430, ['array', 4, ['A9GTimerPerCPU']]],
}],
  'NamedGPIOList': [ 0x28, {
    'name': [0x0, ['pointer', ['char']]],
    'in': [0x8, ['pointer', ['pointer', ['IRQState']]]],
    'num_in': [0x10, ['int']],
    'num_out': [0x14, ['int']],
    'node': [0x18, ['__unnamed_0x118d']],
}],
  'PL050State': [ 0x430, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'dev': [0x400, ['pointer', ['void']]],
    'cr': [0x408, ['unsigned int']],
    'clk': [0x40c, ['unsigned int']],
    'last': [0x410, ['unsigned int']],
    'pending': [0x414, ['int']],
    'irq': [0x418, ['pointer', ['IRQState']]],
    'is_mouse': [0x420, ['unsigned char']],
}],
  '__unnamed_0x1191': [ 0x80, {
    'ss': [0x0, ['sockaddr_storage']],
    'sin6': [0x0, ['sockaddr_in6']],
    'sin': [0x0, ['sockaddr_in']],
}],
  'xencons_interface': [ 0xc10, {
    'in': [0x0, ['array', 1024, ['char']]],
    'out': [0x400, ['array', 2048, ['char']]],
    'in_cons': [0xc00, ['unsigned int']],
    'in_prod': [0xc04, ['unsigned int']],
    'out_cons': [0xc08, ['unsigned int']],
    'out_prod': [0xc0c, ['unsigned int']],
}],
  'EHCISysBusState': [ 0xb40, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'ehci': [0x300, ['EHCIState']],
}],
  'iterator<std::bidirectional_iterator_tag, llvm::Argument, long int, llvm::Argument*, llvm::Argument&': [ 0x1, {
}],
  'FdsetInfo': [ 0x10, {
    'fdset_id': [0x0, ['long']],
    'fds': [0x8, ['pointer', ['FdsetFdInfoList']]],
}],
  '__unnamed_0xf14': [ 0x10, {
    'sqh_first': [0x0, ['pointer', ['Coroutine']]],
    'sqh_last': [0x8, ['pointer', ['pointer', ['Coroutine']]]],
}],
  'VirtIODevice': [ 0xe8, {
    'parent_obj': [0x0, ['DeviceState']],
    'name': [0x70, ['pointer', ['char']]],
    'status': [0x78, ['unsigned char']],
    'isr': [0x79, ['unsigned char']],
    'queue_sel': [0x7a, ['unsigned short']],
    'guest_features': [0x80, ['unsigned long']],
    'host_features': [0x88, ['unsigned long']],
    'config_len': [0x90, ['unsigned long']],
    'config': [0x98, ['pointer', ['void']]],
    'config_vector': [0xa0, ['unsigned short']],
    'generation': [0xa4, ['unsigned int']],
    'nvectors': [0xa8, ['int']],
    'vq': [0xb0, ['pointer', ['VirtQueue']]],
    'device_id': [0xb8, ['unsigned short']],
    'vm_running': [0xba, ['unsigned char']],
    'broken': [0xbb, ['unsigned char']],
    'vmstate': [0xc0, ['pointer', ['vm_change_state_entry']]],
    'bus_name': [0xc8, ['pointer', ['char']]],
    'device_endian': [0xd0, ['unsigned char']],
    'use_guest_notifier_mask': [0xd1, ['unsigned char']],
    'dma_as': [0xd8, ['pointer', ['AddressSpace']]],
    'vector_queues': [0xe0, ['pointer', ['__unnamed_0x2836']]],
}],
  'DeviceListener': [ 0x20, {
    'realize': [0x0, ['pointer', ['void']]],
    'unrealize': [0x8, ['pointer', ['void']]],
    'link': [0x10, ['__unnamed_0x2bb6']],
}],
  '__unnamed_0x8c13': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['MonFdsetFd']]],
}],
  'VhostUserMemoryRegion': [ 0x20, {
    'guest_phys_addr': [0x0, ['unsigned long']],
    'memory_size': [0x8, ['unsigned long']],
    'userspace_addr': [0x10, ['unsigned long']],
    'mmap_offset': [0x18, ['unsigned long']],
}],
  'CryptoDevBackendClient': [ 0x30, {
    'model': [0x0, ['pointer', ['char']]],
    'name': [0x8, ['pointer', ['char']]],
    'info_str': [0x10, ['pointer', ['char']]],
    'queue_index': [0x18, ['unsigned int']],
    'next': [0x20, ['__unnamed_0x199e']],
}],
  'tpm_req_hdr': [ 0xa, {
    'tag': [0x0, ['unsigned short']],
    'len': [0x2, ['unsigned int']],
    'ordinal': [0x6, ['unsigned int']],
}],
  'SpiceChannelEventInfo': [ 0x140, {
    'connection_id': [0x0, ['int']],
    'type': [0x4, ['int']],
    'id': [0x8, ['int']],
    'flags': [0xc, ['int']],
    'laddr': [0x10, ['sockaddr']],
    'paddr': [0x20, ['sockaddr']],
    'llen': [0x30, ['unsigned int']],
    'plen': [0x34, ['unsigned int']],
    'laddr_ext': [0x38, ['sockaddr_storage']],
    'paddr_ext': [0xb8, ['sockaddr_storage']],
    'llen_ext': [0x138, ['unsigned int']],
    'plen_ext': [0x13c, ['unsigned int']],
}],
  'PCIEAERInject': [ 0x30, {
    'dev': [0x0, ['pointer', ['PCIDevice']]],
    'aer_cap': [0x8, ['pointer', ['unsigned char']]],
    'err': [0x10, ['pointer', ['PCIEAERErr']]],
    'devctl': [0x18, ['unsigned short']],
    'devsta': [0x1a, ['unsigned short']],
    'error_status': [0x1c, ['unsigned int']],
    'unsupported_request': [0x20, ['unsigned char']],
    'log_overflow': [0x21, ['unsigned char']],
    'msg': [0x24, ['PCIEAERMsg']],
}],
  'GPIOI2CState': [ 0x420, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'dummy_iomem': [0x300, ['MemoryRegion']],
    'bitbang': [0x400, ['pointer', ['bitbang_i2c_interface']]],
    'last_level': [0x408, ['int']],
    'out': [0x410, ['pointer', ['IRQState']]],
}],
  '__unnamed_0xa83': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['QemuOpt']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['QemuOpt']]]],
}],
  'elf64_hdr': [ 0x40, {
    'e_ident': [0x0, ['array', 16, ['unsigned char']]],
    'e_type': [0x10, ['unsigned short']],
    'e_machine': [0x12, ['unsigned short']],
    'e_version': [0x14, ['unsigned int']],
    'e_entry': [0x18, ['unsigned long']],
    'e_phoff': [0x20, ['unsigned long']],
    'e_shoff': [0x28, ['unsigned long']],
    'e_flags': [0x30, ['unsigned int']],
    'e_ehsize': [0x34, ['unsigned short']],
    'e_phentsize': [0x36, ['unsigned short']],
    'e_phnum': [0x38, ['unsigned short']],
    'e_shentsize': [0x3a, ['unsigned short']],
    'e_shnum': [0x3c, ['unsigned short']],
    'e_shstrndx': [0x3e, ['unsigned short']],
}],
  'ACPIOSTInfoList': [ 0x10, {
    'next': [0x0, ['pointer', ['ACPIOSTInfoList']]],
    'value': [0x8, ['pointer', ['ACPIOSTInfo']]],
}],
  'Netdev': [ 0x120, {
    'id': [0x0, ['pointer', ['char']]],
    'type': [0x8, ['Enumeration', {'target': 'int', 'choices': {0: 'NET_CLIENT_DRIVER_NONE', 1: 'NET_CLIENT_DRIVER_NIC', 2: 'NET_CLIENT_DRIVER_USER', 3: 'NET_CLIENT_DRIVER_TAP', 4: 'NET_CLIENT_DRIVER_L2TPV3', 5: 'NET_CLIENT_DRIVER_SOCKET', 6: 'NET_CLIENT_DRIVER_VDE', 7: 'NET_CLIENT_DRIVER_DUMP', 8: 'NET_CLIENT_DRIVER_BRIDGE', 9: 'NET_CLIENT_DRIVER_HUBPORT', 10: 'NET_CLIENT_DRIVER_NETMAP', 11: 'NET_CLIENT_DRIVER_VHOST_USER', 12: 'NET_CLIENT_DRIVER__MAX'}}]],
    'u': [0x10, ['__unnamed_0xb05e']],
}],
  'CpuInfoPPC': [ 0x8, {
    'nip': [0x0, ['long']],
}],
  '__unnamed_0x5aaa': [ 0x10, {
    'le_next': [0x0, ['pointer', ['MapClient']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['MapClient']]]],
}],
  'virtio_net_ctrl_hdr': [ 0x2, {
    'class': [0x0, ['unsigned char']],
    'cmd': [0x1, ['unsigned char']],
}],
  '__unnamed_0xb9a': [ 0x10, {
    'le_next': [0x0, ['pointer', ['BlockBackendPublic']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['BlockBackendPublic']]]],
}],
  '__unnamed_0x4c18': [ 0x18, {
    'opaque': [0x0, ['pointer', ['void']]],
    'txrx': [0x8, ['pointer', ['void']]],
    'chip': [0x10, ['pointer', ['uWireSlave']]],
}],
  'GICState': [ 0x3510, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'parent_irq': [0x300, ['array', 8, ['pointer', ['IRQState']]]],
    'parent_fiq': [0x340, ['array', 8, ['pointer', ['IRQState']]]],
    'parent_virq': [0x380, ['array', 8, ['pointer', ['IRQState']]]],
    'parent_vfiq': [0x3c0, ['array', 8, ['pointer', ['IRQState']]]],
    'ctlr': [0x400, ['unsigned int']],
    'cpu_ctlr': [0x404, ['array', 8, ['unsigned int']]],
    'irq_state': [0x424, ['array', 1020, ['gic_irq_state']]],
    'irq_target': [0x2008, ['array', 1020, ['unsigned char']]],
    'priority1': [0x2404, ['array', 8, ['array', 32, ['unsigned char']]]],
    'priority2': [0x2504, ['array', 988, ['unsigned char']]],
    'sgi_pending': [0x28e0, ['array', 8, ['array', 16, ['unsigned char']]]],
    'priority_mask': [0x2960, ['array', 8, ['unsigned short']]],
    'running_priority': [0x2970, ['array', 8, ['unsigned short']]],
    'current_pending': [0x2980, ['array', 8, ['unsigned short']]],
    'bpr': [0x2990, ['array', 8, ['unsigned char']]],
    'abpr': [0x2998, ['array', 8, ['unsigned char']]],
    'apr': [0x29a0, ['array', 8, ['array', 4, ['unsigned int']]]],
    'nsapr': [0x2a20, ['array', 8, ['array', 4, ['unsigned int']]]],
    'num_cpu': [0x2aa0, ['unsigned int']],
    'iomem': [0x2ab0, ['MemoryRegion']],
    'backref': [0x2bb0, ['array', 8, ['pointer', ['GICState']]]],
    'cpuiomem': [0x2bf0, ['array', 9, ['MemoryRegion']]],
    'num_irq': [0x34f0, ['unsigned int']],
    'revision': [0x34f4, ['unsigned int']],
    'security_extn': [0x34f8, ['unsigned char']],
    'irq_reset_nonsecure': [0x34f9, ['unsigned char']],
    'dev_fd': [0x34fc, ['int']],
    'migration_blocker': [0x3500, ['pointer', ['Error']]],
}],
  'TPMTISEmuState': [ 0x1160, {
    'bh': [0x0, ['pointer', ['QEMUBH']]],
    'offset': [0x8, ['unsigned int']],
    'buf': [0xc, ['array', 4096, ['unsigned char']]],
    'active_locty': [0x100c, ['unsigned char']],
    'aborting_locty': [0x100d, ['unsigned char']],
    'next_locty': [0x100e, ['unsigned char']],
    'loc': [0x1010, ['array', 5, ['TPMLocality']]],
    'irq': [0x1150, ['pointer', ['IRQState']]],
    'irq_num': [0x1158, ['unsigned int']],
}],
  'InputEventList': [ 0x10, {
    'next': [0x0, ['pointer', ['InputEventList']]],
    'value': [0x8, ['pointer', ['InputEvent']]],
}],
  '__unnamed_0x33a3': [ 0x10, {
    'le_next': [0x0, ['pointer', ['ReplicationState']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['ReplicationState']]]],
}],
  'png_row_info_struct': [ 0x18, {
    'width': [0x0, ['unsigned long']],
    'rowbytes': [0x8, ['unsigned long']],
    'color_type': [0x10, ['unsigned char']],
    'bit_depth': [0x11, ['unsigned char']],
    'channels': [0x12, ['unsigned char']],
    'pixel_depth': [0x13, ['unsigned char']],
}],
  'PL181State': [ 0x4c0, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'card': [0x400, ['pointer', ['SDState']]],
    'clock': [0x408, ['unsigned int']],
    'power': [0x40c, ['unsigned int']],
    'cmdarg': [0x410, ['unsigned int']],
    'cmd': [0x414, ['unsigned int']],
    'datatimer': [0x418, ['unsigned int']],
    'datalength': [0x41c, ['unsigned int']],
    'respcmd': [0x420, ['unsigned int']],
    'response': [0x424, ['array', 4, ['unsigned int']]],
    'datactrl': [0x434, ['unsigned int']],
    'datacnt': [0x438, ['unsigned int']],
    'status': [0x43c, ['unsigned int']],
    'mask': [0x440, ['array', 2, ['unsigned int']]],
    'fifo_pos': [0x448, ['int']],
    'fifo_len': [0x44c, ['int']],
    'linux_hack': [0x450, ['int']],
    'fifo': [0x454, ['array', 16, ['unsigned int']]],
    'irq': [0x498, ['array', 2, ['pointer', ['IRQState']]]],
    'cardstatus': [0x4a8, ['array', 2, ['pointer', ['IRQState']]]],
}],
  '__is_normal_iterator<llvm::Type* const*': [ 0x1, {
}],
  'HDAAudioState': [ 0x618, {
    'hda': [0x0, ['HDACodecDevice']],
    'name': [0x78, ['pointer', ['char']]],
    'card': [0x80, ['QEMUSoundCard']],
    'desc': [0x98, ['pointer', ['desc_codec']]],
    'st': [0xa0, ['array', 4, ['HDAAudioStream']]],
    'running_compat': [0x5e0, ['array', 16, ['unsigned char']]],
    'running_real': [0x5f0, ['array', 32, ['unsigned char']]],
    'debug': [0x610, ['unsigned int']],
    'mixer': [0x614, ['unsigned char']],
}],
  'PageDesc': [ 0x18, {
    'first_tb': [0x0, ['pointer', ['TranslationBlock']]],
    'code_write_count': [0x8, ['unsigned int']],
    'code_bitmap': [0x10, ['pointer', ['unsigned long']]],
}],
  'RwCo': [ 0x28, {
    'child': [0x0, ['pointer', ['BdrvChild']]],
    'offset': [0x8, ['long']],
    'qiov': [0x10, ['pointer', ['QEMUIOVector']]],
    'is_write': [0x18, ['unsigned char']],
    'ret': [0x1c, ['int']],
    'flags': [0x20, ['Enumeration', {'target': 'int', 'choices': {32: 'BDRV_REQ_WRITE_COMPRESSED', 1: 'BDRV_REQ_COPY_ON_READ', 2: 'BDRV_REQ_ZERO_WRITE', 4: 'BDRV_REQ_MAY_UNMAP', 8: 'BDRV_REQ_NO_SERIALISING', 16: 'BDRV_REQ_FUA', 63: 'BDRV_REQ_MASK'}}]],
}],
  '__unnamed_0xb1a3': [ 0x38, {
    'qcow': [0x0, ['QCryptoBlockInfoQCow']],
    'luks': [0x0, ['QCryptoBlockInfoLUKS']],
}],
  '__unnamed_0x2407': [ 0x60, {
    'idlemode': [0x0, ['int']],
    'control': [0x4, ['unsigned int']],
    'enable': [0x8, ['int']],
    'pixels': [0xc, ['int']],
    'busy': [0x10, ['int']],
    'skiplines': [0x14, ['int']],
    'rxbuf': [0x18, ['unsigned short']],
    'config': [0x1c, ['array', 2, ['unsigned int']]],
    'time': [0x24, ['array', 4, ['unsigned int']]],
    'data': [0x34, ['array', 6, ['unsigned int']]],
    'vsync': [0x4c, ['unsigned short']],
    'hsync': [0x4e, ['unsigned short']],
    'chip': [0x50, ['array', 2, ['pointer', ['rfbi_chip_s']]]],
}],
  'SchemaInfoObjectVariant': [ 0x10, {
    'q_case': [0x0, ['pointer', ['char']]],
    'type': [0x8, ['pointer', ['char']]],
}],
  'I2SCodec': [ 0x68, {
    'opaque': [0x0, ['pointer', ['void']]],
    'set_rate': [0x8, ['pointer', ['void']]],
    'tx_swallow': [0x10, ['pointer', ['void']]],
    'rx_swallow': [0x18, ['pointer', ['IRQState']]],
    'tx_start': [0x20, ['pointer', ['IRQState']]],
    'tx_rate': [0x28, ['int']],
    'cts': [0x2c, ['int']],
    'rx_rate': [0x30, ['int']],
    'rts': [0x34, ['int']],
    'in': [0x38, ['i2s_fifo_s']],
    'out': [0x50, ['i2s_fifo_s']],
}],
  'ChardevHead': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['Chardev']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['Chardev']]]],
}],
  'q_obj_NetdevUserOptions_wrapper': [ 0x8, {
    'data': [0x0, ['pointer', ['NetdevUserOptions']]],
}],
  'PortioList': [ 0x40, {
    'ports': [0x0, ['pointer', ['MemoryRegionPortio']]],
    'owner': [0x8, ['pointer', ['Object']]],
    'address_space': [0x10, ['pointer', ['MemoryRegion']]],
    'nr': [0x18, ['unsigned int']],
    'regions': [0x20, ['pointer', ['pointer', ['MemoryRegion']]]],
    'opaque': [0x28, ['pointer', ['void']]],
    'name': [0x30, ['pointer', ['char']]],
    'flush_coalesced_mmio': [0x38, ['unsigned char']],
}],
  'TBContext': [ 0x78, {
    'tbs': [0x0, ['pointer', ['TranslationBlock']]],
    'htable': [0x8, ['qht']],
    'nb_tbs': [0x40, ['int']],
    'tb_lock': [0x48, ['QemuMutex']],
    'tb_flush_count': [0x70, ['unsigned int']],
    'tb_phys_invalidate_count': [0x74, ['int']],
}],
  '_Rb_tree_iterator<std::pair<const llvm::Function* const, long int': [ 0x8, {
    '_M_node': [0x0, ['pointer', ['_Rb_tree_node_base']]],
}],
  'QXLReleaseInfoExt': [ 0x10, {
    'info': [0x0, ['pointer', ['QXLReleaseInfo']]],
    'group_id': [0x8, ['unsigned int']],
}],
  'USBBtState': [ 0xd718, {
    'dev': [0x0, ['USBDevice']],
    'hci': [0x16a8, ['pointer', ['HCIInfo']]],
    'intr': [0x16b0, ['pointer', ['USBEndpoint']]],
    'config': [0x16b8, ['int']],
    'evt': [0x16c0, ['usb_hci_in_fifo_s']],
    'acl': [0x46d8, ['usb_hci_in_fifo_s']],
    'sco': [0x76f0, ['usb_hci_in_fifo_s']],
    'outcmd': [0xa708, ['usb_hci_out_fifo_s']],
    'outacl': [0xb70c, ['usb_hci_out_fifo_s']],
    'outsco': [0xc710, ['usb_hci_out_fifo_s']],
}],
  'BlockBackendAIOCB': [ 0x38, {
    'common': [0x0, ['BlockAIOCB']],
    'blk': [0x28, ['pointer', ['BlockBackend']]],
    'ret': [0x30, ['int']],
}],
  'elf32_sym': [ 0x10, {
    'st_name': [0x0, ['unsigned int']],
    'st_value': [0x4, ['unsigned int']],
    'st_size': [0x8, ['unsigned int']],
    'st_info': [0xc, ['unsigned char']],
    'st_other': [0xd, ['unsigned char']],
    'st_shndx': [0xe, ['unsigned short']],
}],
  'QCryptoBlockInfoLUKSSlot': [ 0x28, {
    'active': [0x0, ['unsigned char']],
    'has_iters': [0x1, ['unsigned char']],
    'iters': [0x8, ['long']],
    'has_stripes': [0x10, ['unsigned char']],
    'stripes': [0x18, ['long']],
    'key_offset': [0x20, ['long']],
}],
  '_Rb_tree_node<std::__cxx11::basic_string<char, std::char_traits<char': [ 0x40, {
    '_M_storage': [0x20, ['__aligned_membuf<std::__cxx11::basic_string<char, std::char_traits<char']],
}],
  'SDL_MouseButtonEvent': [ 0x8, {
    'type': [0x0, ['unsigned char']],
    'which': [0x1, ['unsigned char']],
    'button': [0x2, ['unsigned char']],
    'state': [0x3, ['unsigned char']],
    'x': [0x4, ['unsigned short']],
    'y': [0x6, ['unsigned short']],
}],
  'isa_impl_wrap<llvm::ConstantInt, llvm::Constant* const, const llvm::Constant*': [ 0x1, {
}],
  'ARMMMUFaultInfo': [ 0x8, {
    's2addr': [0x0, ['unsigned int']],
    'stage2': [0x4, ['unsigned char']],
    's1ptw': [0x5, ['unsigned char']],
}],
  'omap_dma_reg_set_s': [ 0x38, {
    'src': [0x0, ['unsigned long']],
    'dest': [0x8, ['unsigned long']],
    'frame': [0x10, ['int']],
    'element': [0x14, ['int']],
    'pck_element': [0x18, ['int']],
    'frame_delta': [0x1c, ['array', 2, ['int']]],
    'elem_delta': [0x24, ['array', 2, ['int']]],
    'frames': [0x2c, ['int']],
    'elements': [0x30, ['int']],
    'pck_elements': [0x34, ['int']],
}],
  'BlockJob': [ 0xa8, {
    'driver': [0x0, ['pointer', ['BlockJobDriver']]],
    'blk': [0x8, ['pointer', ['BlockBackend']]],
    'id': [0x10, ['pointer', ['char']]],
    'co': [0x18, ['pointer', ['Coroutine']]],
    'cancelled': [0x20, ['unsigned char']],
    'pause_count': [0x24, ['int']],
    'user_paused': [0x28, ['unsigned char']],
    'busy': [0x29, ['unsigned char']],
    'paused': [0x2a, ['unsigned char']],
    'ready': [0x2b, ['unsigned char']],
    'deferred_to_main_loop': [0x2c, ['unsigned char']],
    'job_list': [0x30, ['Enumeration', {'target': 'int', 'choices': {0: 'IOMMU_NONE', 1: 'IOMMU_RO', 2: 'IOMMU_WO', 3: 'IOMMU_RW'}}]],
    'iostatus': [0x40, ['Enumeration', {'target': 'int', 'choices': {0: 'BLOCK_DEVICE_IO_STATUS_OK', 1: 'BLOCK_DEVICE_IO_STATUS_FAILED', 2: 'BLOCK_DEVICE_IO_STATUS_NOSPACE', 3: 'BLOCK_DEVICE_IO_STATUS__MAX'}}]],
    'offset': [0x48, ['long']],
    'len': [0x50, ['long']],
    'speed': [0x58, ['long']],
    'cb': [0x60, ['pointer', ['void']]],
    'blocker': [0x68, ['pointer', ['Error']]],
    'nodes': [0x70, ['pointer', ['_GSList']]],
    'opaque': [0x78, ['pointer', ['void']]],
    'refcnt': [0x80, ['int']],
    'completed': [0x84, ['unsigned char']],
    'ret': [0x88, ['int']],
    'txn': [0x90, ['pointer', ['BlockJobTxn']]],
    'txn_list': [0x98, ['Enumeration', {'target': 'int', 'choices': {0: 'IOMMU_NOTIFIER_NONE', 1: 'IOMMU_NOTIFIER_UNMAP', 2: 'IOMMU_NOTIFIER_MAP'}}]],
}],
  'disassemble_info': [ 0xb8, {
    'fprintf_func': [0x0, ['pointer', ['void']]],
    'stream': [0x8, ['pointer', ['_IO_FILE']]],
    'application_data': [0x10, ['pointer', ['void']]],
    'flavour': [0x18, ['Enumeration', {'target': 'int', 'choices': {0: 'bfd_target_unknown_flavour', 1: 'bfd_target_aout_flavour', 2: 'bfd_target_coff_flavour', 3: 'bfd_target_ecoff_flavour', 4: 'bfd_target_elf_flavour', 5: 'bfd_target_ieee_flavour', 6: 'bfd_target_nlm_flavour', 7: 'bfd_target_oasys_flavour', 8: 'bfd_target_tekhex_flavour', 9: 'bfd_target_srec_flavour', 10: 'bfd_target_ihex_flavour', 11: 'bfd_target_som_flavour', 12: 'bfd_target_os9k_flavour', 13: 'bfd_target_versados_flavour', 14: 'bfd_target_msdos_flavour', 15: 'bfd_target_evax_flavour'}}]],
    'arch': [0x1c, ['Enumeration', {'target': 'int', 'choices': {0: 'bfd_arch_unknown', 1: 'bfd_arch_obscure', 2: 'bfd_arch_m68k', 3: 'bfd_arch_vax', 4: 'bfd_arch_i960', 5: 'bfd_arch_a29k', 6: 'bfd_arch_sparc', 7: 'bfd_arch_mips', 8: 'bfd_arch_i386', 9: 'bfd_arch_we32k', 10: 'bfd_arch_tahoe', 11: 'bfd_arch_i860', 12: 'bfd_arch_romp', 13: 'bfd_arch_alliant', 14: 'bfd_arch_convex', 15: 'bfd_arch_m88k', 16: 'bfd_arch_pyramid', 17: 'bfd_arch_h8300', 18: 'bfd_arch_powerpc', 19: 'bfd_arch_rs6000', 20: 'bfd_arch_hppa', 21: 'bfd_arch_d10v', 22: 'bfd_arch_z8k', 23: 'bfd_arch_h8500', 24: 'bfd_arch_sh', 25: 'bfd_arch_alpha', 26: 'bfd_arch_arm', 27: 'bfd_arch_ns32k', 28: 'bfd_arch_w65', 29: 'bfd_arch_tic30', 30: 'bfd_arch_v850', 31: 'bfd_arch_arc', 32: 'bfd_arch_m32r', 33: 'bfd_arch_mn10200', 34: 'bfd_arch_mn10300', 35: 'bfd_arch_cris', 36: 'bfd_arch_microblaze', 37: 'bfd_arch_moxie', 38: 'bfd_arch_ia64', 39: 'bfd_arch_nios2', 40: 'bfd_arch_lm32', 41: 'bfd_arch_last'}}]],
    'mach': [0x20, ['unsigned long']],
    'endian': [0x28, ['Enumeration', {'target': 'int', 'choices': {0: 'BFD_ENDIAN_BIG', 1: 'BFD_ENDIAN_LITTLE', 2: 'BFD_ENDIAN_UNKNOWN'}}]],
    'symbols': [0x30, ['pointer', ['pointer', ['symbol_cache_entry']]]],
    'num_symbols': [0x38, ['int']],
    'flags': [0x40, ['unsigned long']],
    'private_data': [0x48, ['pointer', ['void']]],
    'read_memory_func': [0x50, ['pointer', ['void']]],
    'memory_error_func': [0x58, ['pointer', ['void']]],
    'print_address_func': [0x60, ['pointer', ['void']]],
    'print_insn': [0x68, ['pointer', ['void']]],
    'symbol_at_address_func': [0x70, ['pointer', ['void']]],
    'buffer': [0x78, ['pointer', ['unsigned char']]],
    'buffer_vma': [0x80, ['unsigned long']],
    'buffer_length': [0x88, ['int']],
    'bytes_per_line': [0x8c, ['int']],
    'bytes_per_chunk': [0x90, ['int']],
    'display_endian': [0x94, ['Enumeration', {'target': 'int', 'choices': {0: 'BFD_ENDIAN_BIG', 1: 'BFD_ENDIAN_LITTLE', 2: 'BFD_ENDIAN_UNKNOWN'}}]],
    'insn_info_valid': [0x98, ['char']],
    'branch_delay_insns': [0x99, ['char']],
    'data_size': [0x9a, ['char']],
    'insn_type': [0x9c, ['Enumeration', {'target': 'int', 'choices': {0: 'dis_noninsn', 1: 'dis_nonbranch', 2: 'dis_branch', 3: 'dis_condbranch', 4: 'dis_jsr', 5: 'dis_condjsr', 6: 'dis_dref', 7: 'dis_dref2'}}]],
    'target': [0xa0, ['unsigned long']],
    'target2': [0xa8, ['unsigned long']],
    'disassembler_options': [0xb0, ['pointer', ['char']]],
}],
  'CCIDBus': [ 0x68, {
    'qbus': [0x0, ['BusState']],
}],
  'SpiceChannelList': [ 0x10, {
    'next': [0x0, ['pointer', ['SpiceChannelList']]],
    'value': [0x8, ['pointer', ['SpiceChannel']]],
}],
  'vfio_group_head': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['VFIOGroup']]],
}],
  '_Sink': [ 0x1, {
}],
  'Vmxnet3_TxCompDesc': [ 0x10, {
    'ext1': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 12}]],
    'txdIdx': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 0}]],
    'ext2': [0x4, ['unsigned int']],
    'ext3': [0x8, ['unsigned int']],
    'rsvd': [0xc, ['BitField', {'end_bit': 24, 'start_bit': 0}]],
    'type': [0xc, ['BitField', {'end_bit': 31, 'start_bit': 24}]],
    'gen': [0xc, ['BitField', {'end_bit': 32, 'start_bit': 31}]],
}],
  'q_obj_x_blockdev_change_arg': [ 0x28, {
    'parent': [0x0, ['pointer', ['char']]],
    'has_child': [0x8, ['unsigned char']],
    'child': [0x10, ['pointer', ['char']]],
    'has_node': [0x18, ['unsigned char']],
    'node': [0x20, ['pointer', ['char']]],
}],
  'BlockdevOptionsSsh': [ 0x20, {
    'server': [0x0, ['pointer', ['InetSocketAddress']]],
    'path': [0x8, ['pointer', ['char']]],
    'has_user': [0x10, ['unsigned char']],
    'user': [0x18, ['pointer', ['char']]],
}],
  'AHCIControlRegs': [ 0x14, {
    'cap': [0x0, ['unsigned int']],
    'ghc': [0x4, ['unsigned int']],
    'irqstatus': [0x8, ['unsigned int']],
    'impl': [0xc, ['unsigned int']],
    'version': [0x10, ['unsigned int']],
}],
  'CCID_XferBlock': [ 0xa, {
    'hdr': [0x0, ['CCID_Header']],
    'bBWI': [0x7, ['unsigned char']],
    'wLevelParameter': [0x8, ['unsigned short']],
    'abData': [0xa, ['array', 0, ['unsigned char']]],
}],
  '__unnamed_0x4a7b': [ 0x20, {
    'notifier': [0x0, ['Notifier']],
    'cpu': [0x18, ['pointer', ['ARMCPU']]],
}],
  '__unnamed_0x2536': [ 0x10, {
    'le_next': [0x0, ['pointer', ['BusState']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['BusState']]]],
}],
  'hmac_sha512_ctx': [ 0x288, {
    'outer': [0x0, ['sha512_ctx']],
    'inner': [0xd8, ['sha512_ctx']],
    'state': [0x1b0, ['sha512_ctx']],
}],
  'ilist_traits<llvm::GlobalVariable': [ 0x10, {
    'Sentinel': [0x0, ['void']],
}],
  'vfio_as_head': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['VFIOAddressSpace']]],
}],
  'AcpiGenericAddress': [ 0xc, {
    'space_id': [0x0, ['unsigned char']],
    'bit_width': [0x1, ['unsigned char']],
    'bit_offset': [0x2, ['unsigned char']],
    'access_width': [0x3, ['unsigned char']],
    'address': [0x4, ['unsigned long']],
}],
  'VirtIOBlockReq': [ 0xa8, {
    'elem': [0x0, ['VirtQueueElement']],
    'sector_num': [0x30, ['long']],
    'dev': [0x38, ['pointer', ['VirtIOBlock']]],
    'vq': [0x40, ['pointer', ['VirtQueue']]],
    'in': [0x48, ['pointer', ['virtio_blk_inhdr']]],
    'out': [0x50, ['virtio_blk_outhdr']],
    'qiov': [0x60, ['QEMUIOVector']],
    'in_len': [0x78, ['unsigned long']],
    'next': [0x80, ['pointer', ['VirtIOBlockReq']]],
    'mr_next': [0x88, ['pointer', ['VirtIOBlockReq']]],
    'acct': [0x90, ['BlockAcctCookie']],
}],
  'BlockDevOps': [ 0x28, {
    'change_media_cb': [0x0, ['pointer', ['void']]],
    'eject_request_cb': [0x8, ['pointer', ['void']]],
    'is_tray_open': [0x10, ['pointer', ['void']]],
    'is_medium_locked': [0x18, ['pointer', ['void']]],
    'resize_cb': [0x20, ['pointer', ['void']]],
}],
  'GICv3State': [ 0x4d70, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem_dist': [0x300, ['MemoryRegion']],
    'iomem_redist': [0x400, ['MemoryRegion']],
    'num_cpu': [0x500, ['unsigned int']],
    'num_irq': [0x504, ['unsigned int']],
    'revision': [0x508, ['unsigned int']],
    'security_extn': [0x50c, ['unsigned char']],
    'irq_reset_nonsecure': [0x50d, ['unsigned char']],
    'dev_fd': [0x510, ['int']],
    'migration_blocker': [0x518, ['pointer', ['Error']]],
    'gicd_ctlr': [0x520, ['unsigned int']],
    'gicd_statusr': [0x524, ['array', 2, ['unsigned int']]],
    'group': [0x52c, ['array', 32, ['unsigned int']]],
    'grpmod': [0x5ac, ['array', 32, ['unsigned int']]],
    'enabled': [0x62c, ['array', 32, ['unsigned int']]],
    'pending': [0x6ac, ['array', 32, ['unsigned int']]],
    'active': [0x72c, ['array', 32, ['unsigned int']]],
    'level': [0x7ac, ['array', 32, ['unsigned int']]],
    'edge_trigger': [0x82c, ['array', 32, ['unsigned int']]],
    'gicd_ipriority': [0x8ac, ['array', 1020, ['unsigned char']]],
    'gicd_irouter': [0xca8, ['array', 1020, ['unsigned long']]],
    'gicd_irouter_target': [0x2c88, ['array', 1020, ['pointer', ['GICv3CPUState']]]],
    'gicd_nsacr': [0x4c68, ['array', 64, ['unsigned int']]],
    'cpu': [0x4d68, ['pointer', ['GICv3CPUState']]],
}],
  'InternalSnapshotState': [ 0x1d8, {
    'common': [0x0, ['BlkActionState']],
    'bs': [0x28, ['pointer', ['BlockDriverState']]],
    'aio_context': [0x30, ['pointer', ['AioContext']]],
    'sn': [0x38, ['QEMUSnapshotInfo']],
    'created': [0x1d0, ['unsigned char']],
}],
  'in_addr': [ 0x4, {
    's_addr': [0x0, ['unsigned int']],
}],
  'usb_redir_free_bulk_streams_header': [ 0x4, {
    'endpoints': [0x0, ['unsigned int']],
}],
  'NetdevDumpOptions': [ 0x20, {
    'has_len': [0x0, ['unsigned char']],
    'len': [0x8, ['unsigned long']],
    'has_file': [0x10, ['unsigned char']],
    'file': [0x18, ['pointer', ['char']]],
}],
  'xs_permissions': [ 0x8, {
    'id': [0x0, ['unsigned int']],
    'perms': [0x4, ['Enumeration', {'target': 'int', 'choices': {0: 'XS_PERM_NONE', 8: 'XS_PERM_OWNER', 2: 'XS_PERM_WRITE', 4: 'XS_PERM_ENOENT_OK', 1: 'XS_PERM_READ'}}]],
}],
  'OHCIPort': [ 0x50, {
    'port': [0x0, ['USBPort']],
    'ctrl': [0x48, ['unsigned int']],
}],
  'MPIDefaultReply': [ 0x14, {
    'Reserved': [0x0, ['array', 2, ['unsigned char']]],
    'MsgLength': [0x2, ['unsigned char']],
    'Function': [0x3, ['unsigned char']],
    'Reserved1': [0x4, ['array', 3, ['unsigned char']]],
    'MsgFlags': [0x7, ['unsigned char']],
    'MsgContext': [0x8, ['unsigned int']],
    'Reserved2': [0xc, ['array', 2, ['unsigned char']]],
    'IOCStatus': [0xe, ['unsigned short']],
    'IOCLogInfo': [0x10, ['unsigned int']],
}],
  'NetLegacyOptions': [ 0x10, {
    'type': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'NET_LEGACY_OPTIONS_KIND_NONE', 1: 'NET_LEGACY_OPTIONS_KIND_NIC', 2: 'NET_LEGACY_OPTIONS_KIND_USER', 3: 'NET_LEGACY_OPTIONS_KIND_TAP', 4: 'NET_LEGACY_OPTIONS_KIND_L2TPV3', 5: 'NET_LEGACY_OPTIONS_KIND_SOCKET', 6: 'NET_LEGACY_OPTIONS_KIND_VDE', 7: 'NET_LEGACY_OPTIONS_KIND_DUMP', 8: 'NET_LEGACY_OPTIONS_KIND_BRIDGE', 9: 'NET_LEGACY_OPTIONS_KIND_NETMAP', 10: 'NET_LEGACY_OPTIONS_KIND_VHOST_USER', 11: 'NET_LEGACY_OPTIONS_KIND__MAX'}}]],
    'u': [0x8, ['__unnamed_0xafca']],
}],
  'InputMoveEvent': [ 0x10, {
    'axis': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'INPUT_AXIS_X', 1: 'INPUT_AXIS_Y', 2: 'INPUT_AXIS__MAX'}}]],
    'value': [0x8, ['long']],
}],
  '__unnamed_0x1eae': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['MemoryRegion']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['MemoryRegion']]]],
}],
  'q_obj_device_list_properties_arg': [ 0x8, {
    'q_typename': [0x0, ['pointer', ['char']]],
}],
  'HIDState': [ 0x130, {
    '__unnamed_0x22ac': [0x0, ['__unnamed_0x23ec']],
    'head': [0x104, ['unsigned int']],
    'n': [0x108, ['unsigned int']],
    'kind': [0x10c, ['int']],
    'protocol': [0x110, ['int']],
    'idle': [0x114, ['unsigned char']],
    'idle_pending': [0x115, ['unsigned char']],
    'idle_timer': [0x118, ['pointer', ['QEMUTimer']]],
    'event': [0x120, ['pointer', ['void']]],
    's': [0x128, ['pointer', ['QemuInputHandlerState']]],
}],
  'AIOReq': [ 0x48, {
    'aiocb': [0x0, ['pointer', ['SheepdogAIOCB']]],
    'iov_offset': [0x8, ['unsigned int']],
    'oid': [0x10, ['unsigned long']],
    'base_oid': [0x18, ['unsigned long']],
    'offset': [0x20, ['unsigned long']],
    'data_len': [0x28, ['unsigned int']],
    'flags': [0x2c, ['unsigned char']],
    'id': [0x30, ['unsigned int']],
    'create': [0x34, ['unsigned char']],
    'aio_siblings': [0x38, ['__unnamed_0x39f6']],
}],
  'XHCIEPContext': [ 0x88, {
    'xhci': [0x0, ['pointer', ['XHCIState']]],
    'slotid': [0x8, ['unsigned int']],
    'epid': [0xc, ['unsigned int']],
    'ring': [0x10, ['XHCIRing']],
    'xfer_count': [0x20, ['unsigned int']],
    'transfers': [0x28, ['__unnamed_0x4142']],
    'retry': [0x38, ['pointer', ['XHCITransfer']]],
    'type': [0x40, ['Enumeration', {'target': 'int', 'choices': {0: 'ET_INVALID', 1: 'ET_ISO_OUT', 2: 'ET_BULK_OUT', 3: 'ET_INTR_OUT', 4: 'ET_CONTROL', 5: 'ET_ISO_IN', 6: 'ET_BULK_IN', 7: 'ET_INTR_IN'}}]],
    'pctx': [0x48, ['unsigned long']],
    'max_psize': [0x50, ['unsigned int']],
    'state': [0x54, ['unsigned int']],
    'kick_active': [0x58, ['unsigned int']],
    'max_pstreams': [0x5c, ['unsigned int']],
    'lsa': [0x60, ['unsigned char']],
    'nr_pstreams': [0x64, ['unsigned int']],
    'pstreams': [0x68, ['pointer', ['XHCIStreamContext']]],
    'interval': [0x70, ['unsigned int']],
    'mfindex_last': [0x78, ['long']],
    'kick_timer': [0x80, ['pointer', ['QEMUTimer']]],
}],
  'DriveMirror': [ 0x98, {
    'has_job_id': [0x0, ['unsigned char']],
    'job_id': [0x8, ['pointer', ['char']]],
    'device': [0x10, ['pointer', ['char']]],
    'target': [0x18, ['pointer', ['char']]],
    'has_format': [0x20, ['unsigned char']],
    'format': [0x28, ['pointer', ['char']]],
    'has_node_name': [0x30, ['unsigned char']],
    'node_name': [0x38, ['pointer', ['char']]],
    'has_replaces': [0x40, ['unsigned char']],
    'replaces': [0x48, ['pointer', ['char']]],
    'sync': [0x50, ['Enumeration', {'target': 'int', 'choices': {0: 'MIRROR_SYNC_MODE_TOP', 1: 'MIRROR_SYNC_MODE_FULL', 2: 'MIRROR_SYNC_MODE_NONE', 3: 'MIRROR_SYNC_MODE_INCREMENTAL', 4: 'MIRROR_SYNC_MODE__MAX'}}]],
    'has_mode': [0x54, ['unsigned char']],
    'mode': [0x58, ['Enumeration', {'target': 'int', 'choices': {0: 'NEW_IMAGE_MODE_EXISTING', 1: 'NEW_IMAGE_MODE_ABSOLUTE_PATHS', 2: 'NEW_IMAGE_MODE__MAX'}}]],
    'has_speed': [0x5c, ['unsigned char']],
    'speed': [0x60, ['long']],
    'has_granularity': [0x68, ['unsigned char']],
    'granularity': [0x6c, ['unsigned int']],
    'has_buf_size': [0x70, ['unsigned char']],
    'buf_size': [0x78, ['long']],
    'has_on_source_error': [0x80, ['unsigned char']],
    'on_source_error': [0x84, ['Enumeration', {'target': 'int', 'choices': {0: 'BLOCKDEV_ON_ERROR_REPORT', 1: 'BLOCKDEV_ON_ERROR_IGNORE', 2: 'BLOCKDEV_ON_ERROR_ENOSPC', 3: 'BLOCKDEV_ON_ERROR_STOP', 4: 'BLOCKDEV_ON_ERROR_AUTO', 5: 'BLOCKDEV_ON_ERROR__MAX'}}]],
    'has_on_target_error': [0x88, ['unsigned char']],
    'on_target_error': [0x8c, ['Enumeration', {'target': 'int', 'choices': {0: 'BLOCKDEV_ON_ERROR_REPORT', 1: 'BLOCKDEV_ON_ERROR_IGNORE', 2: 'BLOCKDEV_ON_ERROR_ENOSPC', 3: 'BLOCKDEV_ON_ERROR_STOP', 4: 'BLOCKDEV_ON_ERROR_AUTO', 5: 'BLOCKDEV_ON_ERROR__MAX'}}]],
    'has_unmap': [0x90, ['unsigned char']],
    'unmap': [0x91, ['unsigned char']],
}],
  '__unnamed_0x2332': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['VncState']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['VncState']]]],
}],
  'TMProperty': [ 0x8, {
    'get': [0x0, ['pointer', ['void']]],
}],
  'ilist_nextprev_traits<llvm::NamedMDNode': [ 0x1, {
}],
  'mfi_array': [ 0x120, {
    'size': [0x0, ['unsigned long']],
    'num_drives': [0x8, ['unsigned char']],
    'reserved': [0x9, ['unsigned char']],
    'array_ref': [0xa, ['unsigned short']],
    'pad': [0xc, ['array', 20, ['unsigned char']]],
    'pd': [0x20, ['array', 32, ['__unnamed_0x7c73']]],
}],
  'of_dpa_flow_context': [ 0x98, {
    'in_pport': [0x0, ['unsigned int']],
    'tunnel_id': [0x4, ['unsigned int']],
    'iov': [0x8, ['pointer', ['iovec']]],
    'iovcnt': [0x10, ['int']],
    'ethhdr_rewrite': [0x14, ['eth_header']],
    'vlanhdr_rewrite': [0x22, ['vlan_header']],
    'vlanhdr': [0x26, ['vlan_header']],
    'of_dpa': [0x30, ['pointer', ['of_dpa']]],
    'fields': [0x38, ['of_dpa_flow_pkt_fields']],
    'action_set': [0x78, ['of_dpa_flow_action']],
}],
  'V9fsFidState': [ 0xa0, {
    'fid_type': [0x0, ['int']],
    'fid': [0x4, ['int']],
    'path': [0x8, ['V9fsPath']],
    'fs': [0x18, ['V9fsFidOpenState']],
    'fs_reclaim': [0x48, ['V9fsFidOpenState']],
    'flags': [0x78, ['int']],
    'open_flags': [0x7c, ['int']],
    'uid': [0x80, ['unsigned int']],
    'ref': [0x84, ['int']],
    'clunked': [0x88, ['int']],
    'next': [0x90, ['pointer', ['V9fsFidState']]],
    'rclm_lst': [0x98, ['pointer', ['V9fsFidState']]],
}],
  'QXLInstance': [ 0x18, {
    'base': [0x0, ['SpiceBaseInstance']],
    'id': [0x8, ['int']],
    'st': [0x10, ['pointer', ['QXLState']]],
}],
  'BusClass': [ 0x98, {
    'parent_class': [0x0, ['ObjectClass']],
    'print_dev': [0x60, ['pointer', ['void']]],
    'get_dev_path': [0x68, ['pointer', ['void']]],
    'get_fw_dev_path': [0x70, ['pointer', ['void']]],
    'reset': [0x78, ['pointer', ['void']]],
    'realize': [0x80, ['pointer', ['void']]],
    'unrealize': [0x88, ['pointer', ['void']]],
    'max_dev': [0x90, ['int']],
    'automatic_ids': [0x94, ['int']],
}],
  '__alloc_traits<std::allocator<std::pair<const llvm::Function* const, long int': [ 0x1, {
}],
  'mfi_frame_header': [ 0x18, {
    'frame_cmd': [0x0, ['unsigned char']],
    'sense_len': [0x1, ['unsigned char']],
    'cmd_status': [0x2, ['unsigned char']],
    'scsi_status': [0x3, ['unsigned char']],
    'target_id': [0x4, ['unsigned char']],
    'lun_id': [0x5, ['unsigned char']],
    'cdb_len': [0x6, ['unsigned char']],
    'sge_count': [0x7, ['unsigned char']],
    'context': [0x8, ['unsigned long']],
    'flags': [0x10, ['unsigned short']],
    'timeout': [0x12, ['unsigned short']],
    'data_len': [0x14, ['unsigned int']],
}],
  '__unnamed_0x199e': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['CryptoDevBackendClient']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['CryptoDevBackendClient']]]],
}],
  'keymap': [ 0x2, {
    'column': [0x0, ['signed char']],
    'row': [0x1, ['signed char']],
}],
  'BitmapRcu': [ 0x20, {
    'rcu': [0x0, ['rcu_head']],
    'bmap': [0x10, ['pointer', ['unsigned long']]],
    'unsentmap': [0x18, ['pointer', ['unsigned long']]],
}],
  '__unnamed_0x7b0c': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['SCSIRequest']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['SCSIRequest']]]],
}],
  'qemu_signalfd_siginfo': [ 0x80, {
    'ssi_signo': [0x0, ['unsigned int']],
    'ssi_errno': [0x4, ['int']],
    'ssi_code': [0x8, ['int']],
    'ssi_pid': [0xc, ['unsigned int']],
    'ssi_uid': [0x10, ['unsigned int']],
    'ssi_fd': [0x14, ['int']],
    'ssi_tid': [0x18, ['unsigned int']],
    'ssi_band': [0x1c, ['unsigned int']],
    'ssi_overrun': [0x20, ['unsigned int']],
    'ssi_trapno': [0x24, ['unsigned int']],
    'ssi_status': [0x28, ['int']],
    'ssi_int': [0x2c, ['int']],
    'ssi_ptr': [0x30, ['unsigned long']],
    'ssi_utime': [0x38, ['unsigned long']],
    'ssi_stime': [0x40, ['unsigned long']],
    'ssi_addr': [0x48, ['unsigned long']],
    'pad': [0x50, ['array', 48, ['unsigned char']]],
}],
  'SpicePlaybackInterface': [ 0x18, {
    'base': [0x0, ['SpiceBaseInterface']],
}],
  'QXLCopyBits': [ 0x8, {
    'src_pos': [0x0, ['QXLPoint']],
}],
  'CowRequest': [ 0x30, {
    'start': [0x0, ['long']],
    'end': [0x8, ['long']],
    'list': [0x10, ['__unnamed_0x32aa']],
    'wait_queue': [0x20, ['CoQueue']],
}],
  '__unnamed_0x52eb': [ 0x18, {
    'cmd': [0x0, ['virtio_scsi_cmd_req']],
    'tmf': [0x0, ['virtio_scsi_ctrl_tmf_req']],
    'an': [0x0, ['virtio_scsi_ctrl_an_req']],
}],
  'ndpopt': [ 0x20, {
    'ndpopt_type': [0x0, ['unsigned char']],
    'ndpopt_len': [0x1, ['unsigned char']],
    'ndpopt_body': [0x2, ['__unnamed_0x145a']],
}],
  '__unnamed_0x928': [ 0x10, {
    'ifrn_name': [0x0, ['array', 16, ['char']]],
}],
  'q_obj_query_command_line_options_arg': [ 0x10, {
    'has_option': [0x0, ['unsigned char']],
    'option': [0x8, ['pointer', ['char']]],
}],
  'QXLPattern': [ 0x10, {
    'pat': [0x0, ['unsigned long']],
    'pos': [0x8, ['QXLPoint']],
}],
  'ChardevRingbuf': [ 0x20, {
    'has_logfile': [0x0, ['unsigned char']],
    'logfile': [0x8, ['pointer', ['char']]],
    'has_logappend': [0x10, ['unsigned char']],
    'logappend': [0x11, ['unsigned char']],
    'has_size': [0x12, ['unsigned char']],
    'size': [0x18, ['long']],
}],
  '__unnamed_0x2b5e': [ 0x10, {
    '__unnamed_0x2b66': [0x0, ['__unnamed_0x2b2f']],
}],
  'DumpState': [ 0x10, {
    'start_ts': [0x0, ['long']],
    'fd': [0x8, ['int']],
    'pcap_caplen': [0xc, ['int']],
}],
  'q_obj_block_passwd_arg': [ 0x28, {
    'has_device': [0x0, ['unsigned char']],
    'device': [0x8, ['pointer', ['char']]],
    'has_node_name': [0x10, ['unsigned char']],
    'node_name': [0x18, ['pointer', ['char']]],
    'password': [0x20, ['pointer', ['char']]],
}],
  'NCQTransferState': [ 0x70, {
    'drive': [0x0, ['pointer', ['AHCIDevice']]],
    'aiocb': [0x8, ['pointer', ['BlockAIOCB']]],
    'cmdh': [0x10, ['pointer', ['AHCICmdHdr']]],
    'sglist': [0x18, ['QEMUSGList']],
    'acct': [0x40, ['BlockAcctCookie']],
    'sector_count': [0x58, ['unsigned int']],
    'lba': [0x60, ['unsigned long']],
    'tag': [0x68, ['unsigned char']],
    'cmd': [0x69, ['unsigned char']],
    'slot': [0x6a, ['unsigned char']],
    'used': [0x6b, ['unsigned char']],
    'halt': [0x6c, ['unsigned char']],
}],
  'USBCombinedPacket': [ 0x30, {
    'first': [0x0, ['pointer', ['USBPacket']]],
    'packets': [0x8, ['packets_head']],
    'iov': [0x18, ['QEMUIOVector']],
}],
  'virtio_crypto_hash_data_req': [ 0x30, {
    'para': [0x0, ['virtio_crypto_hash_para']],
    'padding': [0x8, ['array', 40, ['unsigned char']]],
}],
  '__unnamed_0x3579': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['SimpleSpiceUpdate']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['SimpleSpiceUpdate']]]],
}],
  'IntegratorCMState': [ 0x540, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'memsz': [0x400, ['unsigned int']],
    'flash': [0x410, ['MemoryRegion']],
    'cm_osc': [0x510, ['unsigned int']],
    'cm_ctrl': [0x514, ['unsigned int']],
    'cm_lock': [0x518, ['unsigned int']],
    'cm_auxosc': [0x51c, ['unsigned int']],
    'cm_sdram': [0x520, ['unsigned int']],
    'cm_init': [0x524, ['unsigned int']],
    'cm_flags': [0x528, ['unsigned int']],
    'cm_nvflags': [0x52c, ['unsigned int']],
    'cm_refcnt_offset': [0x530, ['unsigned int']],
    'int_level': [0x534, ['unsigned int']],
    'irq_enabled': [0x538, ['unsigned int']],
    'fiq_enabled': [0x53c, ['unsigned int']],
}],
  'QEMUIOVector': [ 0x18, {
    'iov': [0x0, ['pointer', ['iovec']]],
    'niov': [0x8, ['int']],
    'nalloc': [0xc, ['int']],
    'size': [0x10, ['unsigned long']],
}],
  'count_info': [ 0xc, {
    'bytes': [0x0, ['int']],
    'blocks': [0x4, ['int']],
    'ptr': [0x8, ['int']],
}],
  'ilist_sentinel_traits<llvm::Function': [ 0x1, {
}],
  'usb_redir_stop_interrupt_receiving_header': [ 0x1, {
    'endpoint': [0x0, ['unsigned char']],
}],
  'TCGLabel': [ 0x10, {
    'id': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 1}]],
    'has_value': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'u': [0x8, ['__unnamed_0x40df']],
}],
  'PCIHostBridgeClass': [ 0xe0, {
    'parent_class': [0x0, ['SysBusDeviceClass']],
    'root_bus_path': [0xd8, ['pointer', ['void']]],
}],
  'ChildrenHead': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['BusChild']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['BusChild']]]],
}],
  'remove_reference<std::pair<long int, llvm::Type*': [ 0x1, {
}],
  'q_obj_PCDIMMDeviceInfo_wrapper': [ 0x8, {
    'data': [0x0, ['pointer', ['PCDIMMDeviceInfo']]],
}],
  'AspeedI2CState': [ 0x1590, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'irq': [0x400, ['pointer', ['IRQState']]],
    'intr_status': [0x408, ['unsigned int']],
    'busses': [0x410, ['array', 14, ['AspeedI2CBus']]],
}],
  'mv88w8618_timer_state': [ 0x18, {
    'ptimer': [0x0, ['pointer', ['ptimer_state']]],
    'limit': [0x8, ['unsigned int']],
    'freq': [0xc, ['int']],
    'irq': [0x10, ['pointer', ['IRQState']]],
}],
  'CPUState': [ 0x82a0, {
    'parent_obj': [0x0, ['DeviceState']],
    'nr_cores': [0x70, ['int']],
    'nr_threads': [0x74, ['int']],
    'numa_node': [0x78, ['int']],
    'thread': [0x80, ['pointer', ['QemuThread']]],
    'thread_id': [0x88, ['int']],
    'host_tid': [0x8c, ['unsigned int']],
    'running': [0x90, ['unsigned char']],
    'has_waiter': [0x91, ['unsigned char']],
    'halt_cond': [0x98, ['pointer', ['QemuCond']]],
    'thread_kicked': [0xa0, ['unsigned char']],
    'created': [0xa1, ['unsigned char']],
    'stop': [0xa2, ['unsigned char']],
    'stopped': [0xa3, ['unsigned char']],
    'unplug': [0xa4, ['unsigned char']],
    'crash_occurred': [0xa5, ['unsigned char']],
    'exit_request': [0xa6, ['unsigned char']],
    'interrupt_request': [0xa8, ['unsigned int']],
    'singlestep_enabled': [0xac, ['int']],
    'icount_extra': [0xb0, ['long']],
    'jmp_env': [0xb8, ['array', 1, ['__jmp_buf_tag']]],
    'work_mutex': [0x180, ['QemuMutex']],
    'queued_work_first': [0x1a8, ['pointer', ['qemu_work_item']]],
    'queued_work_last': [0x1b0, ['pointer', ['qemu_work_item']]],
    'cpu_ases': [0x1b8, ['pointer', ['CPUAddressSpace']]],
    'num_ases': [0x1c0, ['int']],
    'as': [0x1c8, ['pointer', ['AddressSpace']]],
    'memory': [0x1d0, ['pointer', ['MemoryRegion']]],
    'env_ptr': [0x1d8, ['pointer', ['void']]],
    'tb_jmp_cache': [0x1e0, ['array', 4096, ['pointer', ['TranslationBlock']]]],
    'gdb_regs': [0x81e0, ['pointer', ['GDBRegisterState']]],
    'gdb_num_regs': [0x81e8, ['int']],
    'gdb_num_g_regs': [0x81ec, ['int']],
    'node': [0x81f0, ['__unnamed_0x1480']],
    'breakpoints': [0x8200, ['breakpoints_head']],
    'watchpoints': [0x8210, ['watchpoints_head']],
    'watchpoint_hit': [0x8220, ['pointer', ['CPUWatchpoint']]],
    'opaque': [0x8228, ['pointer', ['void']]],
    'mem_io_pc': [0x8230, ['unsigned long']],
    'mem_io_vaddr': [0x8238, ['unsigned long']],
    'kvm_fd': [0x8240, ['int']],
    'kvm_vcpu_dirty': [0x8244, ['unsigned char']],
    'kvm_state': [0x8248, ['pointer', ['KVMState']]],
    'kvm_run': [0x8250, ['pointer', ['kvm_run']]],
    'trace_dstate': [0x8258, ['pointer', ['unsigned long']]],
    'cpu_index': [0x8260, ['int']],
    'halted': [0x8264, ['unsigned int']],
    'icount_decr': [0x8268, ['__unnamed_0x1500']],
    'can_do_io': [0x826c, ['unsigned int']],
    'exception_index': [0x8270, ['int']],
    'rr_guest_instr_count': [0x8278, ['unsigned long']],
    'panda_guest_pc': [0x8280, ['unsigned long']],
    'throttle_thread_scheduled': [0x8288, ['unsigned char']],
    'tcg_exit_req': [0x828c, ['unsigned int']],
    'hax_vcpu_dirty': [0x8290, ['unsigned char']],
    'hax_vcpu': [0x8298, ['pointer', ['hax_vcpu_state']]],
}],
  'blkif_x86_32_request': [ 0x6c, {
    'operation': [0x0, ['unsigned char']],
    'nr_segments': [0x1, ['unsigned char']],
    'handle': [0x2, ['unsigned short']],
    'id': [0x4, ['unsigned long']],
    'sector_number': [0xc, ['unsigned long']],
    'seg': [0x14, ['array', 11, ['blkif_request_segment']]],
}],
  'do_nmi_s': [ 0x18, {
    'cpu_index': [0x0, ['int']],
    'err': [0x8, ['pointer', ['Error']]],
    'handled': [0x10, ['unsigned char']],
}],
  'rebind<llvm::Value*': [ 0x1, {
}],
  'CMD646BAR': [ 0x210, {
    'cmd': [0x0, ['MemoryRegion']],
    'data': [0x100, ['MemoryRegion']],
    'bus': [0x200, ['pointer', ['IDEBus']]],
    'pci_dev': [0x208, ['pointer', ['PCIIDEState']]],
}],
  'QIOChannelWebsockHeader': [ 0xe, {
    'b0': [0x0, ['unsigned char']],
    'b1': [0x1, ['unsigned char']],
    'u': [0x2, ['__unnamed_0x1dbb']],
}],
  'NBDRequest': [ 0x18, {
    'handle': [0x0, ['unsigned long']],
    'from': [0x8, ['unsigned long']],
    'len': [0x10, ['unsigned int']],
    'flags': [0x14, ['unsigned short']],
    'type': [0x16, ['unsigned short']],
}],
  '__unnamed_0x146': [ 0x80, {
    '__val': [0x0, ['array', 16, ['unsigned long']]],
}],
  'IDEDeviceClass': [ 0xc8, {
    'parent_class': [0x0, ['DeviceClass']],
    'init': [0xc0, ['pointer', ['void']]],
}],
  'STM32F205State': [ 0x4d30, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'kernel_filename': [0x300, ['pointer', ['char']]],
    'cpu_model': [0x308, ['pointer', ['char']]],
    'syscfg': [0x310, ['__unnamed_0x2932']],
    'usart': [0x740, ['array', 6, ['__unnamed_0x2cba']]],
    'timer': [0x2180, ['array', 4, ['STM32F2XXTimerState']]],
    'adc': [0x3340, ['array', 3, ['__unnamed_0x2d5d']]],
    'spi': [0x4060, ['array', 3, ['__unnamed_0x2eb2']]],
    'adc_irqs': [0x4d20, ['pointer', ['OrIRQState']]],
}],
  'QXLCursorHeader': [ 0x12, {
    'unique': [0x0, ['unsigned long']],
    'type': [0x8, ['unsigned short']],
    'width': [0xa, ['unsigned short']],
    'height': [0xc, ['unsigned short']],
    'hot_spot_x': [0xe, ['unsigned short']],
    'hot_spot_y': [0x10, ['unsigned short']],
}],
  'rebind<std::_Rb_tree_node<std::__cxx11::basic_string<char, std::char_traits<char': [ 0x1, {
}],
  'ilist_default_traits<llvm::Argument': [ 0x1, {
}],
  'MemoryRegionOps': [ 0x80, {
    'read': [0x0, ['pointer', ['void']]],
    'write': [0x8, ['pointer', ['void']]],
    'read_with_attrs': [0x10, ['pointer', ['void']]],
    'write_with_attrs': [0x18, ['pointer', ['void']]],
    'endianness': [0x20, ['Enumeration', {'target': 'int', 'choices': {0: 'DEVICE_NATIVE_ENDIAN', 1: 'DEVICE_BIG_ENDIAN', 2: 'DEVICE_LITTLE_ENDIAN'}}]],
    'valid': [0x28, ['Enumeration', {'target': 'int', 'choices': {0: 'RR_DEBUG_SILENT', 1: 'RR_DEBUG_WHISPER', 2: 'RR_DEBUG_QUIET', 3: 'RR_DEBUG_NOISY'}}]],
    'impl': [0x40, ['__unnamed_0x1d1a']],
    'old_mmio': [0x50, ['MemoryRegionMmio']],
}],
  'VHDXFileParameters': [ 0x8, {
    'block_size': [0x0, ['unsigned int']],
    'data_bits': [0x4, ['unsigned int']],
}],
  '__unnamed_0x1a8d': [ 0x10, {
    'type': [0x0, ['unsigned int']],
    'code': [0x8, ['unsigned long']],
}],
  'dma_s': [ 0x68, {
    'soc': [0x0, ['soc_dma_s']],
    'chnum': [0x38, ['int']],
    'ch_enable_mask': [0x40, ['unsigned long']],
    'channel_freq': [0x48, ['long']],
    'enabled_count': [0x50, ['int']],
    'memmap': [0x58, ['pointer', ['memmap_entry_s']]],
    'memmap_size': [0x60, ['int']],
    'ch': [0x68, ['array', 0, ['soc_dma_ch_s']]],
}],
  'mv88w8618_tx_desc': [ 0x10, {
    'cmdstat': [0x0, ['unsigned int']],
    'res': [0x4, ['unsigned short']],
    'bytes': [0x6, ['unsigned short']],
    'buffer': [0x8, ['unsigned int']],
    'next': [0xc, ['unsigned int']],
}],
  'EEprom9346': [ 0x94, {
    'contents': [0x0, ['array', 64, ['unsigned short']]],
    'mode': [0x80, ['int']],
    'tick': [0x84, ['unsigned int']],
    'address': [0x88, ['unsigned char']],
    'input': [0x8a, ['unsigned short']],
    'output': [0x8c, ['unsigned short']],
    'eecs': [0x8e, ['unsigned char']],
    'eesk': [0x8f, ['unsigned char']],
    'eedi': [0x90, ['unsigned char']],
    'eedo': [0x91, ['unsigned char']],
}],
  'TimedAverage': [ 0x60, {
    'period': [0x0, ['unsigned long']],
    'windows': [0x8, ['array', 2, ['TimedAverageWindow']]],
    'current': [0x58, ['unsigned int']],
    'clock_type': [0x5c, ['Enumeration', {'target': 'int', 'choices': {0: 'QEMU_CLOCK_REALTIME', 1: 'QEMU_CLOCK_VIRTUAL', 2: 'QEMU_CLOCK_HOST', 3: 'QEMU_CLOCK_VIRTUAL_RT', 4: 'QEMU_CLOCK_MAX'}}]],
}],
  'PCIEAERErr': [ 0x28, {
    'status': [0x0, ['unsigned int']],
    'source_id': [0x4, ['unsigned short']],
    'flags': [0x6, ['unsigned short']],
    'header': [0x8, ['array', 4, ['unsigned int']]],
    'prefix': [0x18, ['array', 4, ['unsigned int']]],
}],
  'AcpiMadtGenericMsiFrame': [ 0x18, {
    'type': [0x0, ['unsigned char']],
    'length': [0x1, ['unsigned char']],
    'reserved': [0x2, ['unsigned short']],
    'gic_msi_frame_id': [0x4, ['unsigned int']],
    'base_address': [0x8, ['unsigned long']],
    'flags': [0x10, ['unsigned int']],
    'spi_count': [0x14, ['unsigned short']],
    'spi_base': [0x16, ['unsigned short']],
}],
  'mu': [ 0x18, {
    'm': [0x0, ['void']],
    'a': [0x10, ['unsigned char']],
    's': [0x14, ['unsigned int']],
}],
  'AspeedSoCState': [ 0x22be0, {
    'parent': [0x0, ['DeviceState']],
    'cpu': [0x70, ['ARMCPU']],
    'iomem': [0x1ec90, ['MemoryRegion']],
    'sram': [0x1ed90, ['MemoryRegion']],
    'vic': [0x1ee90, ['AspeedVICState']],
    'timerctrl': [0x1f2e0, ['AspeedTimerCtrlState']],
    'i2c': [0x1f9b0, ['AspeedI2CState']],
    'scu': [0x20f40, ['AspeedSCUState']],
    'fmc': [0x21500, ['AspeedSMCState']],
    'spi': [0x21b40, ['array', 2, ['AspeedSMCState']]],
    'sdmc': [0x227c0, ['AspeedSDMCState']],
}],
  'UnixSocketAddress': [ 0x8, {
    'path': [0x0, ['pointer', ['char']]],
}],
  'Abort': [ 0x1, {
    'qapi_dummy_for_empty_struct': [0x0, ['char']],
}],
  '_IO_FILE': [ 0xd8, {
    '_flags': [0x0, ['int']],
    '_IO_read_ptr': [0x8, ['pointer', ['char']]],
    '_IO_read_end': [0x10, ['pointer', ['char']]],
    '_IO_read_base': [0x18, ['pointer', ['char']]],
    '_IO_write_base': [0x20, ['pointer', ['char']]],
    '_IO_write_ptr': [0x28, ['pointer', ['char']]],
    '_IO_write_end': [0x30, ['pointer', ['char']]],
    '_IO_buf_base': [0x38, ['pointer', ['char']]],
    '_IO_buf_end': [0x40, ['pointer', ['char']]],
    '_IO_save_base': [0x48, ['pointer', ['char']]],
    '_IO_backup_base': [0x50, ['pointer', ['char']]],
    '_IO_save_end': [0x58, ['pointer', ['char']]],
    '_markers': [0x60, ['pointer', ['_IO_marker']]],
    '_chain': [0x68, ['pointer', ['_IO_FILE']]],
    '_fileno': [0x70, ['int']],
    '_flags2': [0x74, ['int']],
    '_old_offset': [0x78, ['long']],
    '_cur_column': [0x80, ['unsigned short']],
    '_vtable_offset': [0x82, ['signed char']],
    '_shortbuf': [0x83, ['array', 1, ['char']]],
    '_lock': [0x88, ['pointer', 'void']],
    '_offset': [0x90, ['long']],
    '__pad1': [0x98, ['pointer', ['void']]],
    '__pad2': [0xa0, ['pointer', ['void']]],
    '__pad3': [0xa8, ['pointer', ['void']]],
    '__pad4': [0xb0, ['pointer', ['void']]],
    '__pad5': [0xb8, ['unsigned long']],
    '_mode': [0xc0, ['int']],
    '_unused2': [0xc4, ['array', 20, ['char']]],
}],
  'ms': [ 0x18, {
    'm': [0x0, ['void']],
    's': [0x10, ['unsigned int']],
}],
  'capture_list_head': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['CaptureState']]],
}],
  'of_dpa': [ 0x20, {
    'world': [0x0, ['pointer', ['world']]],
    'flow_tbl': [0x8, ['pointer', ['_GHashTable']]],
    'group_tbl': [0x10, ['pointer', ['_GHashTable']]],
    'flow_tbl_max_size': [0x18, ['unsigned int']],
    'group_tbl_max_size': [0x1c, ['unsigned int']],
}],
  '__unnamed_0x1045': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['InputLinux']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['InputLinux']]]],
}],
  'QemuOpt': [ 0x38, {
    'name': [0x0, ['pointer', ['char']]],
    'str': [0x8, ['pointer', ['char']]],
    'desc': [0x10, ['pointer', ['QemuOptDesc']]],
    'value': [0x18, ['Enumeration', {'target': 'int', 'choices': {0: 'QEMU_CLOCK_REALTIME', 1: 'QEMU_CLOCK_VIRTUAL', 2: 'QEMU_CLOCK_HOST', 3: 'QEMU_CLOCK_VIRTUAL_RT', 4: 'QEMU_CLOCK_MAX'}}]],
    'opts': [0x20, ['pointer', ['QemuOpts']]],
    'next': [0x28, ['__unnamed_0xa83']],
}],
  'QJSON': [ 0x10, {
    'str': [0x0, ['pointer', ['QString']]],
    'omit_comma': [0x8, ['unsigned char']],
}],
  'VFIOBAR': [ 0x48, {
    'region': [0x0, ['VFIORegion']],
    'ioport': [0x38, ['unsigned char']],
    'mem64': [0x39, ['unsigned char']],
    'quirks': [0x40, ['__unnamed_0x3382']],
}],
  'SnapshotInfo': [ 0x38, {
    'id': [0x0, ['pointer', ['char']]],
    'name': [0x8, ['pointer', ['char']]],
    'vm_state_size': [0x10, ['long']],
    'date_sec': [0x18, ['long']],
    'date_nsec': [0x20, ['long']],
    'vm_clock_sec': [0x28, ['long']],
    'vm_clock_nsec': [0x30, ['long']],
}],
  'PCMCIACardState': [ 0x78, {
    'parent_obj': [0x0, ['DeviceState']],
    'slot': [0x70, ['pointer', ['PCMCIASocket']]],
}],
  'cb_listhead': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['capture_callback']]],
}],
  '__numeric_traits_integer<long unsigned int': [ 0x1, {
}],
  'VirtioPCIClass': [ 0x118, {
    'parent_class': [0x0, ['PCIDeviceClass']],
    'parent_dc_realize': [0x108, ['pointer', ['void']]],
    'realize': [0x110, ['pointer', ['void']]],
}],
  'qcrypto_nettle_hmac_ctx': [ 0x288, {
    'md5_ctx': [0x0, ['hmac_md5_ctx']],
    'ripemd160_ctx': [0x0, ['hmac_ripemd160_ctx']],
    'sha256_ctx': [0x0, ['hmac_sha256_ctx']],
    'sha512_ctx': [0x0, ['hmac_sha512_ctx']],
    'sha1_ctx': [0x0, ['hmac_sha1_ctx']],
}],
  'QCryptoTLSCredsAnon': [ 0x58, {
    'parent_obj': [0x0, ['QCryptoTLSCreds']],
    'data': [0x50, ['Enumeration', {'target': 'int', 'choices': {0: 'QEMU_CLOCK_REALTIME', 1: 'QEMU_CLOCK_VIRTUAL', 2: 'QEMU_CLOCK_HOST', 3: 'QEMU_CLOCK_VIRTUAL_RT', 4: 'QEMU_CLOCK_MAX'}}]],
}],
  '__unnamed_0x94c': [ 0x18, {
    'ifru_hwaddr': [0x0, ['sockaddr']],
    'ifru_data': [0x0, ['pointer', ['char']]],
    'ifru_broadaddr': [0x0, ['sockaddr']],
    'ifru_map': [0x0, ['ifmap']],
    'ifru_mtu': [0x0, ['int']],
    'ifru_addr': [0x0, ['sockaddr']],
    'ifru_flags': [0x0, ['short']],
    'ifru_ivalue': [0x0, ['int']],
    'ifru_newname': [0x0, ['array', 16, ['char']]],
    'ifru_dstaddr': [0x0, ['sockaddr']],
    'ifru_slave': [0x0, ['array', 16, ['char']]],
    'ifru_netmask': [0x0, ['sockaddr']],
}],
  'VFIOMSIXInfo': [ 0x120, {
    'table_bar': [0x0, ['unsigned char']],
    'pba_bar': [0x1, ['unsigned char']],
    'entries': [0x2, ['unsigned short']],
    'table_offset': [0x4, ['unsigned int']],
    'pba_offset': [0x8, ['unsigned int']],
    'mmap_mem': [0x10, ['MemoryRegion']],
    'mmap': [0x110, ['pointer', ['void']]],
    'pending': [0x118, ['pointer', ['unsigned long']]],
}],
  'binary_function<const llvm::Function*, const llvm::Function*, bool': [ 0x1, {
}],
  'BIOSLinker': [ 0x10, {
    'cmd_blob': [0x0, ['pointer', ['_GArray']]],
    'file_list': [0x8, ['pointer', ['_GArray']]],
}],
  'CadenceTTCState': [ 0x4e0, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'timer': [0x400, ['array', 3, ['__unnamed_0x206c']]],
}],
  '__unnamed_0x13b9': [ 0x596, {
    'tp_buf': [0x0, ['array', 1430, ['char']]],
    'tp_data': [0x0, ['__unnamed_0x1364']],
    'tp_error': [0x0, ['__unnamed_0x1397']],
}],
  '__unnamed_0x13b4': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['Slirp']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['Slirp']]]],
}],
  'q_obj_x_blockdev_remove_medium_arg': [ 0x20, {
    'has_device': [0x0, ['unsigned char']],
    'device': [0x8, ['pointer', ['char']]],
    'has_id': [0x10, ['unsigned char']],
    'id': [0x18, ['pointer', ['char']]],
}],
  'q_obj_screendump_arg': [ 0x8, {
    'filename': [0x0, ['pointer', ['char']]],
}],
  'cast_retty_impl<llvm::Function, llvm::Value*': [ 0x1, {
}],
  '__unnamed_0x8c6a': [ 0x48, {
    'parser': [0x0, ['JSONMessageParser']],
    'in_command_mode': [0x40, ['unsigned char']],
}],
  'VirtIOInputConfig': [ 0x98, {
    'config': [0x0, ['virtio_input_config']],
    'node': [0x88, ['__unnamed_0x8169']],
}],
  '__unnamed_0x1d38': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['BusState']]],
}],
  'VRingDesc': [ 0x10, {
    'addr': [0x0, ['unsigned long']],
    'len': [0x8, ['unsigned int']],
    'flags': [0xc, ['unsigned short']],
    'next': [0xe, ['unsigned short']],
}],
  'xenkbd_motion': [ 0x10, {
    'type': [0x0, ['unsigned char']],
    'rel_x': [0x4, ['int']],
    'rel_y': [0x8, ['int']],
    'rel_z': [0xc, ['int']],
}],
  'isa_impl_wrap<llvm::Instruction, llvm::Value* const, const llvm::Value*': [ 0x1, {
}],
  'StrongARMPICState': [ 0x420, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'irq': [0x400, ['pointer', ['IRQState']]],
    'fiq': [0x408, ['pointer', ['IRQState']]],
    'pending': [0x410, ['unsigned int']],
    'enabled': [0x414, ['unsigned int']],
    'is_fiq': [0x418, ['unsigned int']],
    'int_idle': [0x41c, ['unsigned int']],
}],
  'BlockStatsList': [ 0x10, {
    'next': [0x0, ['pointer', ['BlockStatsList']]],
    'value': [0x8, ['pointer', ['BlockStats']]],
}],
  'iterator_traits<long int const*': [ 0x1, {
}],
  'BlockdevCacheOptions': [ 0x4, {
    'has_direct': [0x0, ['unsigned char']],
    'direct': [0x1, ['unsigned char']],
    'has_no_flush': [0x2, ['unsigned char']],
    'no_flush': [0x3, ['unsigned char']],
}],
  '_Identity<std::__cxx11::basic_string<char, std::char_traits<char': [ 0x1, {
}],
  'TCGTemp': [ 0x28, {
    'val_type': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 8}]],
    'base_type': [0x0, ['BitField', {'end_bit': 24, 'start_bit': 16}]],
    'type': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 24}]],
    'reg': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 0}]],
    'mem_coherent': [0x4, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'temp_allocated': [0x4, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'mem_allocated': [0x4, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'indirect_base': [0x4, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'indirect_reg': [0x4, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'temp_local': [0x4, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'fixed_reg': [0x4, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'val': [0x8, ['long']],
    'mem_base': [0x10, ['pointer', ['TCGTemp']]],
    'mem_offset': [0x18, ['long']],
    'name': [0x20, ['pointer', ['char']]],
}],
  'qemu_work_item': [ 0x20, {
    'next': [0x0, ['pointer', ['qemu_work_item']]],
    'func': [0x8, ['pointer', ['void']]],
    'data': [0x10, ['__unnamed_0x137d']],
    'free': [0x18, ['unsigned char']],
    'exclusive': [0x19, ['unsigned char']],
    'done': [0x1a, ['unsigned char']],
}],
  'IMXCCMState': [ 0x300, {
    'parent_obj': [0x0, ['SysBusDevice']],
}],
  '__unnamed_0x2f3e': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['EHCIQueue']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['EHCIQueue']]]],
}],
  'virtio_net_ctrl_mq': [ 0x2, {
    'virtqueue_pairs': [0x0, ['unsigned short']],
}],
  'udpiphdr': [ 0x1c, {
    'ui_i': [0x0, ['ipovly']],
    'ui_u': [0x14, ['udphdr']],
}],
  'FWCfgMemState': [ 0x6f0, {
    'parent_obj': [0x0, ['FWCfgState']],
    'ctl_iomem': [0x460, ['MemoryRegion']],
    'data_iomem': [0x560, ['MemoryRegion']],
    'data_width': [0x660, ['unsigned int']],
    'wide_data_ops': [0x668, ['MemoryRegionOps']],
}],
  'MapEntry': [ 0x40, {
    'start': [0x0, ['long']],
    'length': [0x8, ['long']],
    'data': [0x10, ['unsigned char']],
    'zero': [0x11, ['unsigned char']],
    'depth': [0x18, ['long']],
    'has_offset': [0x20, ['unsigned char']],
    'offset': [0x28, ['long']],
    'has_filename': [0x30, ['unsigned char']],
    'filename': [0x38, ['pointer', ['char']]],
}],
  'isa_impl<llvm::ConstantInt, llvm::Constant, void': [ 0x1, {
}],
  'VGACommonState': [ 0x10af0, {
    'legacy_address_space': [0x0, ['pointer', ['MemoryRegion']]],
    'vram_ptr': [0x8, ['pointer', ['unsigned char']]],
    'vram': [0x10, ['MemoryRegion']],
    'vram_vbe': [0x110, ['MemoryRegion']],
    'vram_size': [0x210, ['unsigned int']],
    'vram_size_mb': [0x214, ['unsigned int']],
    'vbe_size': [0x218, ['unsigned int']],
    'latch': [0x21c, ['unsigned int']],
    'has_chain4_alias': [0x220, ['unsigned char']],
    'chain4_alias': [0x230, ['MemoryRegion']],
    'sr_index': [0x330, ['unsigned char']],
    'sr': [0x331, ['array', 256, ['unsigned char']]],
    'sr_vbe': [0x431, ['array', 256, ['unsigned char']]],
    'gr_index': [0x531, ['unsigned char']],
    'gr': [0x532, ['array', 256, ['unsigned char']]],
    'ar_index': [0x632, ['unsigned char']],
    'ar': [0x633, ['array', 21, ['unsigned char']]],
    'ar_flip_flop': [0x648, ['int']],
    'cr_index': [0x64c, ['unsigned char']],
    'cr': [0x64d, ['array', 256, ['unsigned char']]],
    'msr': [0x74d, ['unsigned char']],
    'fcr': [0x74e, ['unsigned char']],
    'st00': [0x74f, ['unsigned char']],
    'st01': [0x750, ['unsigned char']],
    'dac_state': [0x751, ['unsigned char']],
    'dac_sub_index': [0x752, ['unsigned char']],
    'dac_read_index': [0x753, ['unsigned char']],
    'dac_write_index': [0x754, ['unsigned char']],
    'dac_cache': [0x755, ['array', 3, ['unsigned char']]],
    'dac_8bit': [0x758, ['int']],
    'palette': [0x75c, ['array', 768, ['unsigned char']]],
    'bank_offset': [0xa5c, ['int']],
    'get_bpp': [0xa60, ['pointer', ['void']]],
    'get_offsets': [0xa68, ['pointer', ['void']]],
    'get_resolution': [0xa70, ['pointer', ['void']]],
    'vga_port_list': [0xa78, ['PortioList']],
    'vbe_port_list': [0xab8, ['PortioList']],
    'vbe_index': [0xaf8, ['unsigned short']],
    'vbe_regs': [0xafa, ['array', 10, ['unsigned short']]],
    'vbe_start_addr': [0xb10, ['unsigned int']],
    'vbe_line_offset': [0xb14, ['unsigned int']],
    'vbe_bank_mask': [0xb18, ['unsigned int']],
    'vbe_mapped': [0xb1c, ['int']],
    'con': [0xb20, ['pointer', ['QemuConsole']]],
    'font_offsets': [0xb28, ['array', 2, ['unsigned int']]],
    'graphic_mode': [0xb30, ['int']],
    'shift_control': [0xb34, ['unsigned char']],
    'double_scan': [0xb35, ['unsigned char']],
    'line_offset': [0xb38, ['unsigned int']],
    'line_compare': [0xb3c, ['unsigned int']],
    'start_addr': [0xb40, ['unsigned int']],
    'plane_updated': [0xb44, ['unsigned int']],
    'last_line_offset': [0xb48, ['unsigned int']],
    'last_cw': [0xb4c, ['unsigned char']],
    'last_ch': [0xb4d, ['unsigned char']],
    'last_width': [0xb50, ['unsigned int']],
    'last_height': [0xb54, ['unsigned int']],
    'last_scr_width': [0xb58, ['unsigned int']],
    'last_scr_height': [0xb5c, ['unsigned int']],
    'last_depth': [0xb60, ['unsigned int']],
    'last_byteswap': [0xb64, ['unsigned char']],
    'force_shadow': [0xb65, ['unsigned char']],
    'cursor_start': [0xb66, ['unsigned char']],
    'cursor_end': [0xb67, ['unsigned char']],
    'cursor_visible_phase': [0xb68, ['unsigned char']],
    'cursor_blink_time': [0xb70, ['long']],
    'cursor_offset': [0xb78, ['unsigned int']],
    'hw_ops': [0xb80, ['pointer', ['GraphicHwOps']]],
    'full_update_text': [0xb88, ['unsigned char']],
    'full_update_gfx': [0xb89, ['unsigned char']],
    'big_endian_fb': [0xb8a, ['unsigned char']],
    'default_endian_fb': [0xb8b, ['unsigned char']],
    'invalidated_y_table': [0xb8c, ['array', 64, ['unsigned int']]],
    'hw_cursor_x': [0xc8c, ['unsigned int']],
    'hw_cursor_y': [0xc90, ['unsigned int']],
    'cursor_invalidate': [0xc98, ['pointer', ['void']]],
    'cursor_draw_line': [0xca0, ['pointer', ['void']]],
    'last_palette': [0xca8, ['array', 256, ['unsigned int']]],
    'last_ch_attr': [0x10a8, ['array', 16000, ['unsigned int']]],
    'retrace': [0x10aa8, ['pointer', ['void']]],
    'update_retrace_info': [0x10ab0, ['pointer', ['void']]],
    'retrace_info': [0x10ab8, ['vga_retrace']],
    'is_vbe_vmstate': [0x10ae0, ['unsigned char']],
}],
  'vm_change_state_head': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['vm_change_state_entry']]],
}],
  'SpiceVoiceOut': [ 0xc8, {
    'hw': [0x0, ['HWVoiceOut']],
    'sin': [0x88, ['SpicePlaybackInstance']],
    'rate': [0x98, ['SpiceRateCtl']],
    'active': [0xa8, ['int']],
    'frame': [0xb0, ['pointer', ['unsigned int']]],
    'fpos': [0xb8, ['pointer', ['unsigned int']]],
    'fsize': [0xc0, ['unsigned int']],
}],
  'AC97BusMasterRegs': [ 0x18, {
    'bdbar': [0x0, ['unsigned int']],
    'civ': [0x4, ['unsigned char']],
    'lvi': [0x5, ['unsigned char']],
    'sr': [0x6, ['unsigned short']],
    'picb': [0x8, ['unsigned short']],
    'piv': [0xa, ['unsigned char']],
    'cr': [0xb, ['unsigned char']],
    'bd_valid': [0xc, ['unsigned int']],
    'bd': [0x10, ['BD']],
}],
  'PandaPluginInfo': [ 0x18, {
    'index': [0x0, ['long']],
    'name': [0x8, ['pointer', ['char']]],
    'address': [0x10, ['long']],
}],
  '_GSourceCallbackFuncs': [ 0x18, {
    'ref': [0x0, ['pointer', ['void']]],
    'unref': [0x8, ['pointer', ['void']]],
    'get': [0x10, ['pointer', ['void']]],
}],
  'VirtioBusState': [ 0x70, {
    'parent_obj': [0x0, ['BusState']],
    'ioeventfd_started': [0x68, ['unsigned char']],
    'ioeventfd_grabbed': [0x6c, ['int']],
}],
  'virtio_gpu_transfer_to_host_2d': [ 0x38, {
    'hdr': [0x0, ['virtio_gpu_ctrl_hdr']],
    'r': [0x18, ['virtio_gpu_rect']],
    'offset': [0x28, ['unsigned long']],
    'resource_id': [0x30, ['unsigned int']],
    'padding': [0x34, ['unsigned int']],
}],
  'VhostUserLog': [ 0x10, {
    'mmap_size': [0x0, ['unsigned long']],
    'mmap_offset': [0x8, ['unsigned long']],
}],
  'virtio_gpu_config': [ 0x10, {
    'events_read': [0x0, ['unsigned int']],
    'events_clear': [0x4, ['unsigned int']],
    'num_scanouts': [0x8, ['unsigned int']],
    'num_capsets': [0xc, ['unsigned int']],
}],
  'virtio_input_event': [ 0x8, {
    'type': [0x0, ['unsigned short']],
    'code': [0x2, ['unsigned short']],
    'value': [0x4, ['unsigned int']],
}],
  'MTPState': [ 0x1708, {
    'dev': [0x0, ['USBDevice']],
    'root': [0x16a8, ['pointer', ['char']]],
    'desc': [0x16b0, ['pointer', ['char']]],
    'flags': [0x16b8, ['unsigned int']],
    'data_in': [0x16c0, ['pointer', ['MTPData']]],
    'data_out': [0x16c8, ['pointer', ['MTPData']]],
    'result': [0x16d0, ['pointer', ['MTPControl']]],
    'session': [0x16d8, ['unsigned int']],
    'next_handle': [0x16dc, ['unsigned int']],
    'objects': [0x16e0, ['__unnamed_0x3e00']],
    'inotifyfd': [0x16f0, ['int']],
    'events': [0x16f8, ['events']],
}],
  'new_allocator<std::_Rb_tree_node<std::pair<const std::__cxx11::basic_string<char, std::char_traits<char': [ 0x1, {
}],
  'QObjectOutputVisitor': [ 0xb8, {
    'visitor': [0x0, ['Visitor']],
    'stack': [0xa0, ['__unnamed_0xce0']],
    'root': [0xa8, ['pointer', ['QObject']]],
    'result': [0xb0, ['pointer', ['pointer', ['QObject']]]],
}],
  'RockerOfDpaFlowMask': [ 0x38, {
    'has_in_pport': [0x0, ['unsigned char']],
    'in_pport': [0x4, ['unsigned int']],
    'has_tunnel_id': [0x8, ['unsigned char']],
    'tunnel_id': [0xc, ['unsigned int']],
    'has_vlan_id': [0x10, ['unsigned char']],
    'vlan_id': [0x12, ['unsigned short']],
    'has_eth_src': [0x14, ['unsigned char']],
    'eth_src': [0x18, ['pointer', ['char']]],
    'has_eth_dst': [0x20, ['unsigned char']],
    'eth_dst': [0x28, ['pointer', ['char']]],
    'has_ip_proto': [0x30, ['unsigned char']],
    'ip_proto': [0x31, ['unsigned char']],
    'has_ip_tos': [0x32, ['unsigned char']],
    'ip_tos': [0x33, ['unsigned char']],
}],
  'DigicBoard': [ 0x28, {
    'ram_size': [0x0, ['unsigned long']],
    'add_rom0': [0x8, ['pointer', ['void']]],
    'rom0_def_filename': [0x10, ['pointer', ['char']]],
    'add_rom1': [0x18, ['pointer', ['void']]],
    'rom1_def_filename': [0x20, ['pointer', ['char']]],
}],
  '__unnamed_0x118d': [ 0x10, {
    'le_next': [0x0, ['pointer', ['NamedGPIOList']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['NamedGPIOList']]]],
}],
  'VHDXRegionTableHeader': [ 0x10, {
    'signature': [0x0, ['unsigned int']],
    'checksum': [0x4, ['unsigned int']],
    'entry_count': [0x8, ['unsigned int']],
    'reserved': [0xc, ['unsigned int']],
}],
  'virtio_gpu_resource_create_2d': [ 0x28, {
    'hdr': [0x0, ['virtio_gpu_ctrl_hdr']],
    'resource_id': [0x18, ['unsigned int']],
    'format': [0x1c, ['unsigned int']],
    'width': [0x20, ['unsigned int']],
    'height': [0x24, ['unsigned int']],
}],
  'virtio_net_hdr_mrg_rxbuf': [ 0xc, {
    'hdr': [0x0, ['virtio_net_hdr']],
    'num_buffers': [0xa, ['unsigned short']],
}],
  'I2CBus': [ 0x78, {
    'qbus': [0x0, ['BusState']],
    'current_devs': [0x68, ['__unnamed_0x156b']],
    'saved_address': [0x70, ['unsigned char']],
    'broadcast': [0x71, ['unsigned char']],
}],
  'BlockCryptoCreateData': [ 0x20, {
    'filename': [0x0, ['pointer', ['char']]],
    'opts': [0x8, ['pointer', ['QemuOpts']]],
    'blk': [0x10, ['pointer', ['BlockBackend']]],
    'size': [0x18, ['unsigned long']],
}],
  'q_obj_human_monitor_command_arg': [ 0x18, {
    'command_line': [0x0, ['pointer', ['char']]],
    'has_cpu_index': [0x8, ['unsigned char']],
    'cpu_index': [0x10, ['long']],
}],
  'mfi_ctrl_props': [ 0x40, {
    'seq_num': [0x0, ['unsigned short']],
    'pred_fail_poll_interval': [0x2, ['unsigned short']],
    'intr_throttle_cnt': [0x4, ['unsigned short']],
    'intr_throttle_timeout': [0x6, ['unsigned short']],
    'rebuild_rate': [0x8, ['unsigned char']],
    'patrol_read_rate': [0x9, ['unsigned char']],
    'bgi_rate': [0xa, ['unsigned char']],
    'cc_rate': [0xb, ['unsigned char']],
    'recon_rate': [0xc, ['unsigned char']],
    'cache_flush_interval': [0xd, ['unsigned char']],
    'spinup_drv_cnt': [0xe, ['unsigned char']],
    'spinup_delay': [0xf, ['unsigned char']],
    'cluster_enable': [0x10, ['unsigned char']],
    'coercion_mode': [0x11, ['unsigned char']],
    'alarm_enable': [0x12, ['unsigned char']],
    'disable_auto_rebuild': [0x13, ['unsigned char']],
    'disable_battery_warn': [0x14, ['unsigned char']],
    'ecc_bucket_size': [0x15, ['unsigned char']],
    'ecc_bucket_leak_rate': [0x16, ['unsigned short']],
    'restore_hotspare_on_insertion': [0x18, ['unsigned char']],
    'expose_encl_devices': [0x19, ['unsigned char']],
    'maintainPdFailHistory': [0x1a, ['unsigned char']],
    'disallowHostRequestReordering': [0x1b, ['unsigned char']],
    'abortCCOnError': [0x1c, ['unsigned char']],
    'loadBalanceMode': [0x1d, ['unsigned char']],
    'disableAutoDetectBackplane': [0x1e, ['unsigned char']],
    'snapVDSpace': [0x1f, ['unsigned char']],
    'OnOffProperties': [0x20, ['unsigned int']],
    'autoSnapVDSpace': [0x24, ['unsigned char']],
    'viewSpace': [0x25, ['unsigned char']],
    'spinDownTime': [0x26, ['unsigned short']],
    'reserved': [0x28, ['array', 24, ['unsigned char']]],
}],
  'virtio_scsi_cmd_req': [ 0x13, {
    'lun': [0x0, ['array', 8, ['unsigned char']]],
    'tag': [0x8, ['unsigned long']],
    'task_attr': [0x10, ['unsigned char']],
    'prio': [0x11, ['unsigned char']],
    'crn': [0x12, ['unsigned char']],
    'cdb': [0x13, ['array', 0, ['unsigned char']]],
}],
  '__unnamed_0xe13': [ 0x404, {
    'len': [0x0, ['int']],
    'buffer': [0x4, ['array', 1024, ['unsigned char']]],
}],
  '__unnamed_0x400e': [ 0x18, {
    '__unnamed_0x401c': [0x0, ['__unnamed_0x3fea']],
    '__unnamed_0x4017': [0x0, ['__unnamed_0x3fac']],
}],
  'ilist_nextprev_traits<llvm::Argument': [ 0x1, {
}],
  'sigval': [ 0x8, {
    'sival_int': [0x0, ['int']],
    'sival_ptr': [0x0, ['pointer', ['void']]],
}],
  'q_obj_blockdev_snapshot_delete_internal_sync_arg': [ 0x28, {
    'device': [0x0, ['pointer', ['char']]],
    'has_id': [0x8, ['unsigned char']],
    'id': [0x10, ['pointer', ['char']]],
    'has_name': [0x18, ['unsigned char']],
    'name': [0x20, ['pointer', ['char']]],
}],
  'USBPacket': [ 0x78, {
    'pid': [0x0, ['int']],
    'id': [0x8, ['unsigned long']],
    'ep': [0x10, ['pointer', ['USBEndpoint']]],
    'stream': [0x18, ['unsigned int']],
    'iov': [0x20, ['QEMUIOVector']],
    'parameter': [0x38, ['unsigned long']],
    'short_not_ok': [0x40, ['unsigned char']],
    'int_req': [0x41, ['unsigned char']],
    'status': [0x44, ['int']],
    'actual_length': [0x48, ['int']],
    'state': [0x4c, ['Enumeration', {'target': 'int', 'choices': {0: 'USB_PACKET_UNDEFINED', 1: 'USB_PACKET_SETUP', 2: 'USB_PACKET_QUEUED', 3: 'USB_PACKET_ASYNC', 4: 'USB_PACKET_COMPLETE', 5: 'USB_PACKET_CANCELED'}}]],
    'combined': [0x50, ['pointer', ['USBCombinedPacket']]],
    'queue': [0x58, ['Enumeration', {'target': 'int', 'choices': {0: 'MODULE_INIT_BLOCK', 1: 'MODULE_INIT_OPTS', 2: 'MODULE_INIT_QAPI', 3: 'MODULE_INIT_QOM', 4: 'MODULE_INIT_TRACE', 5: 'MODULE_INIT_MAX'}}]],
    'combined_entry': [0x68, ['__unnamed_0x13cb']],
}],
  'omap_gpiosw_info_s': [ 0x10, {
    'name': [0x0, ['pointer', ['char']]],
    'line': [0x8, ['int']],
    'type': [0xc, ['int']],
}],
  'DUMMY_Q': [ 0x10, {
    'head': [0x0, ['DUMMY_Q_HEAD']],
}],
  'mv88w8618_eth_state': [ 0x2480, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'irq': [0x400, ['pointer', ['IRQState']]],
    'smir': [0x408, ['unsigned int']],
    'icr': [0x40c, ['unsigned int']],
    'imr': [0x410, ['unsigned int']],
    'mmio_index': [0x414, ['int']],
    'vlan_header': [0x418, ['unsigned int']],
    'tx_queue': [0x41c, ['array', 2, ['unsigned int']]],
    'rx_queue': [0x424, ['array', 4, ['unsigned int']]],
    'frx_queue': [0x434, ['array', 4, ['unsigned int']]],
    'cur_rx': [0x444, ['array', 4, ['unsigned int']]],
    'nic': [0x458, ['pointer', ['NICState']]],
    'conf': [0x460, ['NICConf']],
}],
  'TraceEventGroup': [ 0x8, {
    'events': [0x0, ['pointer', ['pointer', ['TraceEvent']]]],
}],
  'MemMapEntry': [ 0x10, {
    'base': [0x0, ['unsigned long']],
    'size': [0x8, ['unsigned long']],
}],
  'NetPacket': [ 0x28, {
    'entry': [0x0, ['__unnamed_0xe35']],
    'sender': [0x10, ['pointer', ['NetClientState']]],
    'flags': [0x18, ['unsigned int']],
    'size': [0x1c, ['int']],
    'sent_cb': [0x20, ['pointer', ['void']]],
    'data': [0x28, ['array', 0, ['unsigned char']]],
}],
  'HotpluggableCPUList': [ 0x10, {
    'next': [0x0, ['pointer', ['HotpluggableCPUList']]],
    'value': [0x8, ['pointer', ['HotpluggableCPU']]],
}],
  'blkif_x86_32_sring': [ 0xac, {
    'req_prod': [0x0, ['unsigned int']],
    'req_event': [0x4, ['unsigned int']],
    'rsp_prod': [0x8, ['unsigned int']],
    'rsp_event': [0xc, ['unsigned int']],
    'pvt': [0x10, ['__unnamed_0x489a']],
    '__pad': [0x14, ['array', 44, ['unsigned char']]],
    'ring': [0x40, ['array', 1, ['blkif_x86_32_sring_entry']]],
}],
  'requested_infos': [ 0x10, {
    'client_id': [0x0, ['pointer', ['unsigned char']]],
    'client_id_len': [0x8, ['int']],
    'want_dns': [0xc, ['unsigned char']],
    'want_boot_url': [0xd, ['unsigned char']],
}],
  'PXA2xxI2SState': [ 0x1a0, {
    'iomem': [0x0, ['MemoryRegion']],
    'irq': [0x100, ['pointer', ['IRQState']]],
    'rx_dma': [0x108, ['pointer', ['IRQState']]],
    'tx_dma': [0x110, ['pointer', ['IRQState']]],
    'data_req': [0x118, ['pointer', ['void']]],
    'control': [0x120, ['array', 2, ['unsigned int']]],
    'status': [0x128, ['unsigned int']],
    'mask': [0x12c, ['unsigned int']],
    'clk': [0x130, ['unsigned int']],
    'enable': [0x134, ['int']],
    'rx_len': [0x138, ['int']],
    'tx_len': [0x13c, ['int']],
    'codec_out': [0x140, ['pointer', ['void']]],
    'codec_in': [0x148, ['pointer', ['void']]],
    'opaque': [0x150, ['pointer', ['void']]],
    'fifo_len': [0x158, ['int']],
    'fifo': [0x15c, ['array', 16, ['unsigned int']]],
}],
  '__unnamed_0xf0d': [ 0x10, {
    'le_next': [0x0, ['pointer', ['HWVoiceOut']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['HWVoiceOut']]]],
}],
  'of_dpa_group': [ 0x20, {
    'id': [0x0, ['unsigned int']],
    '__unnamed_0x1ae8': [0x8, ['__unnamed_0x1a9c']],
}],
  'BlockConf': [ 0x38, {
    'blk': [0x0, ['pointer', ['BlockBackend']]],
    'physical_block_size': [0x8, ['unsigned short']],
    'logical_block_size': [0xa, ['unsigned short']],
    'min_io_size': [0xc, ['unsigned short']],
    'opt_io_size': [0x10, ['unsigned int']],
    'bootindex': [0x14, ['int']],
    'discard_granularity': [0x18, ['unsigned int']],
    'cyls': [0x1c, ['unsigned int']],
    'heads': [0x20, ['unsigned int']],
    'secs': [0x24, ['unsigned int']],
    'wce': [0x28, ['Enumeration', {'target': 'int', 'choices': {0: 'ON_OFF_AUTO_AUTO', 1: 'ON_OFF_AUTO_ON', 2: 'ON_OFF_AUTO_OFF', 3: 'ON_OFF_AUTO__MAX'}}]],
    'rerror': [0x2c, ['Enumeration', {'target': 'int', 'choices': {0: 'BLOCKDEV_ON_ERROR_REPORT', 1: 'BLOCKDEV_ON_ERROR_IGNORE', 2: 'BLOCKDEV_ON_ERROR_ENOSPC', 3: 'BLOCKDEV_ON_ERROR_STOP', 4: 'BLOCKDEV_ON_ERROR_AUTO', 5: 'BLOCKDEV_ON_ERROR__MAX'}}]],
    'werror': [0x30, ['Enumeration', {'target': 'int', 'choices': {0: 'BLOCKDEV_ON_ERROR_REPORT', 1: 'BLOCKDEV_ON_ERROR_IGNORE', 2: 'BLOCKDEV_ON_ERROR_ENOSPC', 3: 'BLOCKDEV_ON_ERROR_STOP', 4: 'BLOCKDEV_ON_ERROR_AUTO', 5: 'BLOCKDEV_ON_ERROR__MAX'}}]],
}],
  'CaptureState': [ 0x28, {
    'opaque': [0x0, ['pointer', ['void']]],
    'ops': [0x8, ['capture_ops']],
    'entries': [0x18, ['__unnamed_0x957']],
}],
  'PL190State': [ 0x510, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'level': [0x400, ['unsigned int']],
    'soft_level': [0x404, ['unsigned int']],
    'irq_enable': [0x408, ['unsigned int']],
    'fiq_select': [0x40c, ['unsigned int']],
    'vect_control': [0x410, ['array', 16, ['unsigned char']]],
    'vect_addr': [0x420, ['array', 17, ['unsigned int']]],
    'prio_mask': [0x464, ['array', 18, ['unsigned int']]],
    'protected': [0x4ac, ['int']],
    'priority': [0x4b0, ['int']],
    'prev_prio': [0x4b4, ['array', 17, ['int']]],
    'irq': [0x4f8, ['pointer', ['IRQState']]],
    'fiq': [0x500, ['pointer', ['IRQState']]],
}],
  'pair<unsigned int, llvm::PointerAlignElem': [ 0x14, {
    'first': [0x0, ['unsigned int']],
    'second': [0x4, ['PointerAlignElem']],
}],
  'mfi_info_device': [ 0x48, {
    'type': [0x0, ['unsigned char']],
    'reserved': [0x1, ['array', 6, ['unsigned char']]],
    'port_count': [0x7, ['unsigned char']],
    'port_addr': [0x8, ['array', 8, ['unsigned long']]],
}],
  'VmdkMetaData': [ 0x18, {
    'l1_index': [0x0, ['unsigned int']],
    'l2_index': [0x4, ['unsigned int']],
    'l2_offset': [0x8, ['unsigned int']],
    'valid': [0xc, ['int']],
    'l2_cache_entry': [0x10, ['pointer', ['unsigned int']]],
}],
  'q_obj_ChardevFile_wrapper': [ 0x8, {
    'data': [0x0, ['pointer', ['ChardevFile']]],
}],
  'HIDPointerEvent': [ 0x10, {
    'xdx': [0x0, ['int']],
    'ydy': [0x4, ['int']],
    'dz': [0x8, ['int']],
    'buttons_state': [0xc, ['int']],
}],
  '_XkbRedirectKeyAction': [ 0x8, {
    'type': [0x0, ['unsigned char']],
    'new_key': [0x1, ['unsigned char']],
    'mods_mask': [0x2, ['unsigned char']],
    'mods': [0x3, ['unsigned char']],
    'vmods_mask0': [0x4, ['unsigned char']],
    'vmods_mask1': [0x5, ['unsigned char']],
    'vmods0': [0x6, ['unsigned char']],
    'vmods1': [0x7, ['unsigned char']],
}],
  'syminfo': [ 0x28, {
    'lookup_symbol': [0x0, ['pointer', ['void']]],
    'disas_num_syms': [0x8, ['unsigned int']],
    'disas_symtab': [0x10, ['__unnamed_0x230e']],
    'disas_strtab': [0x18, ['pointer', ['char']]],
    'next': [0x20, ['pointer', ['syminfo']]],
}],
  'AwA10TimerContext': [ 0x10, {
    'container': [0x0, ['pointer', ['AwA10PITState']]],
    'index': [0x8, ['int']],
}],
  'CpuInfoMIPS': [ 0x8, {
    'PC': [0x0, ['long']],
}],
  'MegasasBaseClass': [ 0x128, {
    'parent_class': [0x0, ['PCIDeviceClass']],
    'product_name': [0x108, ['pointer', ['char']]],
    'product_version': [0x110, ['pointer', ['char']]],
    'mmio_bar': [0x118, ['int']],
    'ioport_bar': [0x11c, ['int']],
    'osts': [0x120, ['int']],
}],
  'SCSIBlockReq': [ 0x268, {
    'req': [0x0, ['SCSIDiskReq']],
    'io_header': [0x1f8, ['sg_io_hdr']],
    'cmd': [0x250, ['unsigned char']],
    'cdb1': [0x251, ['unsigned char']],
    'group_number': [0x252, ['unsigned char']],
    'cdb': [0x253, ['array', 16, ['unsigned char']]],
}],
  'VirtIOGPU': [ 0x930, {
    'parent_obj': [0x0, ['VirtIODevice']],
    'ctrl_bh': [0xe8, ['pointer', ['QEMUBH']]],
    'cursor_bh': [0xf0, ['pointer', ['QEMUBH']]],
    'ctrl_vq': [0xf8, ['pointer', ['VirtQueue']]],
    'cursor_vq': [0x100, ['pointer', ['VirtQueue']]],
    'enable': [0x108, ['int']],
    'config_size': [0x10c, ['int']],
    'qdev': [0x110, ['pointer', ['DeviceState']]],
    'reslist': [0x118, ['__unnamed_0x3041']],
    'cmdq': [0x128, ['__unnamed_0x3062']],
    'fenceq': [0x138, ['__unnamed_0x3083']],
    'scanout': [0x148, ['array', 16, ['virtio_gpu_scanout']]],
    'req_state': [0x7c8, ['array', 16, ['virtio_gpu_requested_state']]],
    'conf': [0x8c8, ['virtio_gpu_conf']],
    'hostmem': [0x8d8, ['unsigned long']],
    'enabled_output_bitmask': [0x8e0, ['int']],
    'virtio_config': [0x8e4, ['virtio_gpu_config']],
    'use_virgl_renderer': [0x8f4, ['unsigned char']],
    'renderer_inited': [0x8f5, ['unsigned char']],
    'renderer_blocked': [0x8f8, ['int']],
    'fence_poll': [0x900, ['pointer', ['QEMUTimer']]],
    'print_stats': [0x908, ['pointer', ['QEMUTimer']]],
    'inflight': [0x910, ['unsigned int']],
    'stats': [0x914, ['__unnamed_0x30a4']],
    'migration_blocker': [0x928, ['pointer', ['Error']]],
}],
  '__unnamed_0xaeaa': [ 0x8, {
    'abs': [0x0, ['q_obj_InputMoveEvent_wrapper']],
    'btn': [0x0, ['q_obj_InputBtnEvent_wrapper']],
    'rel': [0x0, ['q_obj_InputMoveEvent_wrapper']],
    'key': [0x0, ['q_obj_InputKeyEvent_wrapper']],
}],
  'md5_ctx': [ 0x60, {
    'state': [0x0, ['array', 4, ['unsigned int']]],
    'count': [0x10, ['unsigned long']],
    'block': [0x18, ['array', 64, ['unsigned char']]],
    'index': [0x58, ['unsigned int']],
}],
  'IMXSPIState': [ 0x4b0, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'irq': [0x400, ['pointer', ['IRQState']]],
    'cs_lines': [0x408, ['array', 4, ['pointer', ['IRQState']]]],
    'bus': [0x428, ['pointer', ['SSIBus']]],
    'regs': [0x430, ['array', 17, ['unsigned int']]],
    'rx_fifo': [0x478, ['__unnamed_0x4875']],
    'tx_fifo': [0x490, ['__unnamed_0x4875']],
    'burst_length': [0x4a8, ['short']],
}],
  'SchemaInfo': [ 0x38, {
    'name': [0x0, ['pointer', ['char']]],
    'meta_type': [0x8, ['Enumeration', {'target': 'int', 'choices': {0: 'SCHEMA_META_TYPE_BUILTIN', 1: 'SCHEMA_META_TYPE_ENUM', 2: 'SCHEMA_META_TYPE_ARRAY', 3: 'SCHEMA_META_TYPE_OBJECT', 4: 'SCHEMA_META_TYPE_ALTERNATE', 5: 'SCHEMA_META_TYPE_COMMAND', 6: 'SCHEMA_META_TYPE_EVENT', 7: 'SCHEMA_META_TYPE__MAX'}}]],
    'u': [0x10, ['__unnamed_0xb263']],
}],
  'QmpCommand': [ 0x30, {
    'name': [0x0, ['pointer', ['char']]],
    'fn': [0x8, ['pointer', ['void']]],
    'options': [0x10, ['Enumeration', {'target': 'int', 'choices': {0: 'QCO_NO_OPTIONS', 1: 'QCO_NO_SUCCESS_RESP'}}]],
    'node': [0x18, ['__unnamed_0x847']],
    'enabled': [0x28, ['unsigned char']],
}],
  'SDL_Cursor': [ 0x38, {
    'area': [0x0, ['SDL_Rect']],
    'hot_x': [0x8, ['short']],
    'hot_y': [0xa, ['short']],
    'data': [0x10, ['pointer', ['unsigned char']]],
    'mask': [0x18, ['pointer', ['unsigned char']]],
    'save': [0x20, ['array', 2, ['pointer', ['unsigned char']]]],
    'wm_cursor': [0x30, ['pointer', ['WMcursor']]],
}],
  '__unnamed_0x36d9': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['USBPort']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['USBPort']]]],
}],
  'AlignedCharArray<4ul, 4ul': [ 0x4, {
    'buffer': [0x0, ['array', 4, ['char']]],
}],
  'CharBackend': [ 0x30, {
    'chr': [0x0, ['pointer', ['Chardev']]],
    'chr_event': [0x8, ['pointer', ['void']]],
    'chr_can_read': [0x10, ['pointer', ['void']]],
    'chr_read': [0x18, ['pointer', ['void']]],
    'opaque': [0x20, ['pointer', ['void']]],
    'tag': [0x28, ['int']],
    'fe_open': [0x2c, ['int']],
}],
  'omap_dma_s': [ 0x2720, {
    'dma': [0x0, ['pointer', ['soc_dma_s']]],
    'iomem': [0x10, ['MemoryRegion']],
    'mpu': [0x110, ['pointer', ['omap_mpu_state_s']]],
    'clk': [0x118, ['pointer', ['clk']]],
    'irq': [0x120, ['array', 4, ['pointer', ['IRQState']]]],
    'intr_update': [0x140, ['pointer', ['void']]],
    'model': [0x148, ['Enumeration', {'target': 'int', 'choices': {0: 'omap_dma_3_0', 1: 'omap_dma_3_1', 2: 'omap_dma_3_2', 3: 'omap_dma_4'}}]],
    'omap_3_1_mapping_disabled': [0x14c, ['int']],
    'gcr': [0x150, ['unsigned int']],
    'ocp': [0x154, ['unsigned int']],
    'caps': [0x158, ['array', 5, ['unsigned int']]],
    'irqen': [0x16c, ['array', 4, ['unsigned int']]],
    'irqstat': [0x17c, ['array', 4, ['unsigned int']]],
    'chans': [0x18c, ['int']],
    'ch': [0x190, ['array', 32, ['omap_dma_channel_s']]],
    'lcd_ch': [0x2690, ['omap_dma_lcd_channel_s']],
}],
  '__unnamed_0x561': [ 0x100, {
    'gregs': [0x0, ['array', 23, ['long long']]],
    'fpregs': [0xb8, ['pointer', ['_libc_fpstate']]],
    '__reserved1': [0xc0, ['array', 8, ['unsigned long long']]],
}],
  'omap_intr_handler_s': [ 0x500, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'pins': [0x300, ['pointer', ['pointer', ['IRQState']]]],
    'parent_intr': [0x308, ['array', 2, ['pointer', ['IRQState']]]],
    'mmio': [0x320, ['MemoryRegion']],
    'iclk': [0x420, ['pointer', ['void']]],
    'fclk': [0x428, ['pointer', ['void']]],
    'nbanks': [0x430, ['unsigned char']],
    'level_only': [0x434, ['int']],
    'size': [0x438, ['unsigned int']],
    'revision': [0x43c, ['unsigned char']],
    'new_agr': [0x440, ['array', 2, ['unsigned int']]],
    'sir_intr': [0x448, ['array', 2, ['int']]],
    'autoidle': [0x450, ['int']],
    'mask': [0x454, ['unsigned int']],
    'bank': [0x458, ['array', 3, ['omap_intr_handler_bank_s']]],
}],
  'OSSConf': [ 0x28, {
    'try_mmap': [0x0, ['int']],
    'nfrags': [0x4, ['int']],
    'fragsize': [0x8, ['int']],
    'devpath_out': [0x10, ['pointer', ['char']]],
    'devpath_in': [0x18, ['pointer', ['char']]],
    'exclusive': [0x20, ['int']],
    'policy': [0x24, ['int']],
}],
  'PVSCSIRingInfo': [ 0x2b0, {
    'rs_pa': [0x0, ['unsigned long']],
    'txr_len_mask': [0x8, ['unsigned int']],
    'rxr_len_mask': [0xc, ['unsigned int']],
    'msg_len_mask': [0x10, ['unsigned int']],
    'req_ring_pages_pa': [0x18, ['array', 32, ['unsigned long']]],
    'cmp_ring_pages_pa': [0x118, ['array', 32, ['unsigned long']]],
    'msg_ring_pages_pa': [0x218, ['array', 16, ['unsigned long']]],
    'consumed_ptr': [0x298, ['unsigned long']],
    'filled_cmp_ptr': [0x2a0, ['unsigned long']],
    'filled_msg_ptr': [0x2a8, ['unsigned long']],
}],
  'IPackDevice': [ 0x80, {
    'parent_obj': [0x0, ['DeviceState']],
    'slot': [0x70, ['int']],
    'irq': [0x78, ['pointer', ['pointer', ['IRQState']]]],
}],
  'QXLRect': [ 0x10, {
    'top': [0x0, ['int']],
    'left': [0x4, ['int']],
    'bottom': [0x8, ['int']],
    'right': [0xc, ['int']],
}],
  'QString': [ 0x28, {
    'base': [0x0, ['QObject']],
    'string': [0x10, ['pointer', ['char']]],
    'length': [0x18, ['unsigned long']],
    'capacity': [0x20, ['unsigned long']],
}],
  '__unnamed_0x30ab': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['ChannelList']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['ChannelList']]]],
}],
  'TPMPassthruThreadParams': [ 0x18, {
    'tpm_state': [0x0, ['pointer', ['TPMState']]],
    'recv_data_callback': [0x8, ['pointer', ['void']]],
    'tb': [0x10, ['pointer', ['TPMBackend']]],
}],
  '__unnamed_0x2ac7': [ 0x18, {
    'data': [0x0, ['pointer', ['unsigned char']]],
    'sp': [0x8, ['unsigned int']],
    'rp': [0xc, ['unsigned int']],
    'size': [0x10, ['unsigned int']],
}],
  '__unnamed_0x2ac5': [ 0x4, {
    'bmAttributes_1': [0x0, ['unsigned char']],
    'bmAttributes_2': [0x1, ['unsigned char']],
    'bmAttributes_3': [0x2, ['unsigned char']],
    'bmAttributes_4': [0x3, ['unsigned char']],
}],
  'q_obj_load_plugin_arg': [ 0x28, {
    'has_file_name': [0x0, ['unsigned char']],
    'file_name': [0x8, ['pointer', ['char']]],
    'plugin_name': [0x10, ['pointer', ['char']]],
    'has_plugin_args': [0x18, ['unsigned char']],
    'plugin_args': [0x20, ['pointer', ['char']]],
}],
  'MonitorQAPIEventState': [ 0x20, {
    'event': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'QAPI_EVENT_ACPI_DEVICE_OST', 1: 'QAPI_EVENT_BALLOON_CHANGE', 2: 'QAPI_EVENT_BLOCK_IMAGE_CORRUPTED', 3: 'QAPI_EVENT_BLOCK_IO_ERROR', 4: 'QAPI_EVENT_BLOCK_JOB_CANCELLED', 5: 'QAPI_EVENT_BLOCK_JOB_COMPLETED', 6: 'QAPI_EVENT_BLOCK_JOB_ERROR', 7: 'QAPI_EVENT_BLOCK_JOB_READY', 8: 'QAPI_EVENT_BLOCK_WRITE_THRESHOLD', 9: 'QAPI_EVENT_DEVICE_DELETED', 10: 'QAPI_EVENT_DEVICE_TRAY_MOVED', 11: 'QAPI_EVENT_DUMP_COMPLETED', 12: 'QAPI_EVENT_GUEST_PANICKED', 13: 'QAPI_EVENT_MEM_UNPLUG_ERROR', 14: 'QAPI_EVENT_MIGRATION', 15: 'QAPI_EVENT_MIGRATION_PASS', 16: 'QAPI_EVENT_NIC_RX_FILTER_CHANGED', 17: 'QAPI_EVENT_POWERDOWN', 18: 'QAPI_EVENT_QUORUM_FAILURE', 19: 'QAPI_EVENT_QUORUM_REPORT_BAD', 20: 'QAPI_EVENT_RESET', 21: 'QAPI_EVENT_RESUME', 22: 'QAPI_EVENT_RTC_CHANGE', 23: 'QAPI_EVENT_SHUTDOWN', 24: 'QAPI_EVENT_SPICE_CONNECTED', 25: 'QAPI_EVENT_SPICE_DISCONNECTED', 26: 'QAPI_EVENT_SPICE_INITIALIZED', 27: 'QAPI_EVENT_SPICE_MIGRATE_COMPLETED', 28: 'QAPI_EVENT_STOP', 29: 'QAPI_EVENT_SUSPEND', 30: 'QAPI_EVENT_SUSPEND_DISK', 31: 'QAPI_EVENT_VNC_CONNECTED', 32: 'QAPI_EVENT_VNC_DISCONNECTED', 33: 'QAPI_EVENT_VNC_INITIALIZED', 34: 'QAPI_EVENT_VSERPORT_CHANGE', 35: 'QAPI_EVENT_WAKEUP', 36: 'QAPI_EVENT_WATCHDOG', 37: 'QAPI_EVENT__MAX'}}]],
    'data': [0x8, ['pointer', ['QDict']]],
    'timer': [0x10, ['pointer', ['QEMUTimer']]],
    'qdict': [0x18, ['pointer', ['QDict']]],
}],
  '__unnamed_0x1441': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['USBPort']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['USBPort']]]],
}],
  '__unnamed_0x4170': [ 0x278, {
    'regs': [0x0, ['array', 64, ['unsigned long']]],
    'xregs': [0x200, ['array', 16, ['unsigned int']]],
    'vec_len': [0x240, ['int']],
    'vec_stride': [0x244, ['int']],
    'scratch': [0x248, ['array', 8, ['unsigned int']]],
    'fp_status': [0x268, ['float_status']],
    'standard_fp_status': [0x270, ['float_status']],
}],
  'InterfaceImpl': [ 0x8, {
    'typename': [0x0, ['pointer', ['char']]],
}],
  'VirtIORNGConf': [ 0x20, {
    'rng': [0x0, ['pointer', ['RngBackend']]],
    'max_bytes': [0x8, ['unsigned long']],
    'period_ms': [0x10, ['unsigned int']],
    'default_backend': [0x18, ['pointer', ['RngRandom']]],
}],
  'VirtIOInputClass': [ 0x170, {
    'parent': [0x0, ['VirtioDeviceClass']],
    'realize': [0x150, ['pointer', ['void']]],
    'unrealize': [0x158, ['pointer', ['void']]],
    'change_active': [0x160, ['pointer', ['void']]],
    'handle_status': [0x168, ['pointer', ['void']]],
}],
  '_Select1st<std::pair<const llvm::Function* const, long int': [ 0x1, {
}],
  'ProtobufCBuffer': [ 0x8, {
    'append': [0x0, ['pointer', ['void']]],
}],
  '__unnamed_0x28df': [ 0x8, {
    'bcdUSB_lo': [0x0, ['unsigned char']],
    'bcdUSB_hi': [0x1, ['unsigned char']],
    'bDeviceClass': [0x2, ['unsigned char']],
    'bDeviceSubClass': [0x3, ['unsigned char']],
    'bDeviceProtocol': [0x4, ['unsigned char']],
    'bMaxPacketSize0': [0x5, ['unsigned char']],
    'bNumConfigurations': [0x6, ['unsigned char']],
    'bReserved': [0x7, ['unsigned char']],
}],
  'remove_reference<const std::piecewise_construct_t&': [ 0x1, {
}],
  '__alloc_traits<std::allocator<long int': [ 0x1, {
}],
  'allocator_traits<std::allocator<llvm::Value*': [ 0x1, {
}],
  '__unnamed_0x8b9f': [ 0x10, {
    'le_next': [0x0, ['pointer', ['MonFdsetFd']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['MonFdsetFd']]]],
}],
  'pcnet_TMD': [ 0x10, {
    'tbadr': [0x0, ['unsigned int']],
    'length': [0x4, ['short']],
    'status': [0x6, ['short']],
    'misc': [0x8, ['unsigned int']],
    'res': [0xc, ['unsigned int']],
}],
  'RewriterState': [ 0x60, {
    'parent_obj': [0x0, ['NetFilterState']],
    'incoming_queue': [0x50, ['pointer', ['NetQueue']]],
    'connection_track_table': [0x58, ['pointer', ['_GHashTable']]],
}],
  'MonitorDef': [ 0x20, {
    'name': [0x0, ['pointer', ['char']]],
    'offset': [0x8, ['int']],
    'get_value': [0x10, ['pointer', ['void']]],
    'type': [0x18, ['int']],
}],
  'ilist_default_traits<llvm::Function': [ 0x1, {
}],
  'SDBus': [ 0x68, {
    'qbus': [0x0, ['BusState']],
}],
  'rocker': [ 0xd60, {
    'parent_obj': [0x0, ['PCIDevice']],
    'mmio': [0x8f0, ['MemoryRegion']],
    'msix_bar': [0x9f0, ['MemoryRegion']],
    'name': [0xaf0, ['pointer', ['char']]],
    'world_name': [0xaf8, ['pointer', ['char']]],
    'fp_ports': [0xb00, ['unsigned int']],
    'fp_ports_peers': [0xb08, ['pointer', ['NICPeers']]],
    'fp_start_macaddr': [0xb10, ['MACAddr']],
    'switch_id': [0xb18, ['unsigned long']],
    'fp_port': [0xb20, ['array', 62, ['pointer', ['fp_port']]]],
    'test_reg': [0xd10, ['unsigned int']],
    'test_reg64': [0xd18, ['unsigned long']],
    'test_dma_addr': [0xd20, ['unsigned long']],
    'test_dma_size': [0xd28, ['unsigned int']],
    'lower32': [0xd30, ['unsigned long']],
    'rings': [0xd38, ['pointer', ['pointer', ['desc_ring']]]],
    'worlds': [0xd40, ['array', 1, ['pointer', ['world']]]],
    'world_dflt': [0xd48, ['pointer', ['world']]],
    'next': [0xd50, ['__unnamed_0x335c']],
}],
  '__alloc_traits<std::allocator<const llvm::PassInfo*': [ 0x1, {
}],
  'StatusInfo': [ 0x8, {
    'running': [0x0, ['unsigned char']],
    'singlestep': [0x1, ['unsigned char']],
    'status': [0x4, ['Enumeration', {'target': 'int', 'choices': {0: 'RUN_STATE_DEBUG', 1: 'RUN_STATE_INMIGRATE', 2: 'RUN_STATE_INTERNAL_ERROR', 3: 'RUN_STATE_IO_ERROR', 4: 'RUN_STATE_PAUSED', 5: 'RUN_STATE_POSTMIGRATE', 6: 'RUN_STATE_PRELAUNCH', 7: 'RUN_STATE_FINISH_MIGRATE', 8: 'RUN_STATE_RESTORE_VM', 9: 'RUN_STATE_RUNNING', 10: 'RUN_STATE_SAVE_VM', 11: 'RUN_STATE_SHUTDOWN', 12: 'RUN_STATE_SUSPENDED', 13: 'RUN_STATE_WATCHDOG', 14: 'RUN_STATE_GUEST_PANICKED', 15: 'RUN_STATE_COLO', 16: 'RUN_STATE__MAX'}}]],
}],
  'NotifierList': [ 0x8, {
    'notifiers': [0x0, ['__unnamed_0x737']],
}],
  'FsContext': [ 0x30, {
    'uid': [0x0, ['unsigned int']],
    'fs_root': [0x8, ['pointer', ['char']]],
    'export_flags': [0x10, ['int']],
    'xops': [0x18, ['pointer', ['pointer', ['xattr_operations']]]],
    'exops': [0x20, ['extended_ops']],
    'private': [0x28, ['pointer', ['void']]],
}],
  'USBPortOps': [ 0x28, {
    'attach': [0x0, ['pointer', ['void']]],
    'detach': [0x8, ['pointer', ['void']]],
    'child_detach': [0x10, ['pointer', ['void']]],
    'wakeup': [0x18, ['pointer', ['void']]],
    'complete': [0x20, ['pointer', ['void']]],
}],
  'ucontext': [ 0x3a8, {
    'uc_flags': [0x0, ['unsigned long']],
    'uc_link': [0x8, ['pointer', ['ucontext']]],
    'uc_stack': [0x10, ['sigaltstack']],
    'uc_mcontext': [0x28, ['__unnamed_0x561']],
    'uc_sigmask': [0x128, ['__unnamed_0xfc']],
    '__fpregs_mem': [0x1a8, ['_libc_fpstate']],
}],
  '__unnamed_0x36de': [ 0x18, {
    'drbar': [0x0, ['pointer', ['unsigned int']]],
    'drsr': [0x8, ['pointer', ['unsigned int']]],
    'dracr': [0x10, ['pointer', ['unsigned int']]],
}],
  'CryptoDevBackend': [ 0x268, {
    'parent_obj': [0x0, ['Object']],
    'ready': [0x28, ['unsigned char']],
    'is_used': [0x29, ['unsigned char']],
    'conf': [0x30, ['CryptoDevBackendConf']],
}],
  'PageSearchStatus': [ 0x18, {
    'block': [0x0, ['pointer', ['RAMBlock']]],
    'offset': [0x8, ['unsigned long']],
    'complete_round': [0x10, ['unsigned char']],
}],
  'musicpal_key_state': [ 0x450, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'kbd_extended': [0x400, ['unsigned int']],
    'pressed_keys': [0x404, ['unsigned int']],
    'out': [0x408, ['array', 8, ['pointer', ['IRQState']]]],
}],
  'FWPathProvider': [ 0x28, {
    'parent_obj': [0x0, ['Object']],
}],
  'AwEmacState': [ 0x24c0, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'irq': [0x400, ['pointer', ['IRQState']]],
    'nic': [0x408, ['pointer', ['NICState']]],
    'conf': [0x410, ['NICConf']],
    'mii': [0x2428, ['RTL8201CPState']],
    'phy_addr': [0x2430, ['unsigned char']],
    'ctl': [0x2434, ['unsigned int']],
    'tx_mode': [0x2438, ['unsigned int']],
    'rx_ctl': [0x243c, ['unsigned int']],
    'int_ctl': [0x2440, ['unsigned int']],
    'int_sta': [0x2444, ['unsigned int']],
    'phy_target': [0x2448, ['unsigned int']],
    'rx_fifo': [0x2450, ['Enumeration', {'target': 'int', 'choices': {1: 'BDRV_FIX_LEAKS', 2: 'BDRV_FIX_ERRORS'}}]],
    'rx_num_packets': [0x2468, ['unsigned int']],
    'rx_packet_size': [0x246c, ['unsigned int']],
    'rx_packet_pos': [0x2470, ['unsigned int']],
    'tx_fifo': [0x2478, ['array', 2, ['Enumeration', {'target': 'int', 'choices': {1: 'BDRV_FIX_LEAKS', 2: 'BDRV_FIX_ERRORS'}}]]],
    'tx_length': [0x24a8, ['array', 2, ['unsigned int']]],
    'tx_channel': [0x24b0, ['unsigned int']],
}],
  'UHCIPCIDeviceClass': [ 0x128, {
    'parent_class': [0x0, ['PCIDeviceClass']],
    'info': [0x108, ['UHCIInfo']],
}],
  'QEMUAudioTimeStamp': [ 0x8, {
    'old_ts': [0x0, ['unsigned long']],
}],
  '__unnamed_0x145a': [ 0x1e, {
    'linklayer_addr': [0x0, ['array', 6, ['unsigned char']]],
    'prefixinfo': [0x0, ['prefixinfo']],
    'rdnss': [0x0, ['rdnss']],
}],
  '__unnamed_0x2ace': [ 0x10, {
    'le_next': [0x0, ['pointer', ['BusState']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['BusState']]]],
}],
  'png_info_struct': [ 0x1d0, {
    'width': [0x0, ['unsigned long']],
    'height': [0x8, ['unsigned long']],
    'valid': [0x10, ['unsigned long']],
    'rowbytes': [0x18, ['unsigned long']],
    'palette': [0x20, ['pointer', ['png_color_struct']]],
    'num_palette': [0x28, ['unsigned short']],
    'num_trans': [0x2a, ['unsigned short']],
    'bit_depth': [0x2c, ['unsigned char']],
    'color_type': [0x2d, ['unsigned char']],
    'compression_type': [0x2e, ['unsigned char']],
    'filter_type': [0x2f, ['unsigned char']],
    'interlace_type': [0x30, ['unsigned char']],
    'channels': [0x31, ['unsigned char']],
    'pixel_depth': [0x32, ['unsigned char']],
    'spare_byte': [0x33, ['unsigned char']],
    'signature': [0x34, ['array', 8, ['unsigned char']]],
    'gamma': [0x3c, ['float']],
    'srgb_intent': [0x40, ['unsigned char']],
    'num_text': [0x44, ['int']],
    'max_text': [0x48, ['int']],
    'text': [0x50, ['pointer', ['png_text_struct']]],
    'mod_time': [0x58, ['png_time_struct']],
    'sig_bit': [0x60, ['png_color_8_struct']],
    'trans': [0x68, ['pointer', ['unsigned char']]],
    'trans_values': [0x70, ['png_color_16_struct']],
    'background': [0x7a, ['png_color_16_struct']],
    'x_offset': [0x88, ['long']],
    'y_offset': [0x90, ['long']],
    'offset_unit_type': [0x98, ['unsigned char']],
    'x_pixels_per_unit': [0xa0, ['unsigned long']],
    'y_pixels_per_unit': [0xa8, ['unsigned long']],
    'phys_unit_type': [0xb0, ['unsigned char']],
    'hist': [0xb8, ['pointer', ['unsigned short']]],
    'x_white': [0xc0, ['float']],
    'y_white': [0xc4, ['float']],
    'x_red': [0xc8, ['float']],
    'y_red': [0xcc, ['float']],
    'x_green': [0xd0, ['float']],
    'y_green': [0xd4, ['float']],
    'x_blue': [0xd8, ['float']],
    'y_blue': [0xdc, ['float']],
    'pcal_purpose': [0xe0, ['pointer', ['char']]],
    'pcal_X0': [0xe8, ['long']],
    'pcal_X1': [0xf0, ['long']],
    'pcal_units': [0xf8, ['pointer', ['char']]],
    'pcal_params': [0x100, ['pointer', ['pointer', ['char']]]],
    'pcal_type': [0x108, ['unsigned char']],
    'pcal_nparams': [0x109, ['unsigned char']],
    'free_me': [0x110, ['unsigned long']],
    'unknown_chunks': [0x118, ['pointer', ['png_unknown_chunk_t']]],
    'unknown_chunks_num': [0x120, ['unsigned long']],
    'iccp_name': [0x128, ['pointer', ['char']]],
    'iccp_profile': [0x130, ['pointer', ['char']]],
    'iccp_proflen': [0x138, ['unsigned long']],
    'iccp_compression': [0x140, ['unsigned char']],
    'splt_palettes': [0x148, ['pointer', ['png_sPLT_struct']]],
    'splt_palettes_num': [0x150, ['unsigned long']],
    'scal_unit': [0x158, ['unsigned char']],
    'scal_pixel_width': [0x160, ['double']],
    'scal_pixel_height': [0x168, ['double']],
    'scal_s_width': [0x170, ['pointer', ['char']]],
    'scal_s_height': [0x178, ['pointer', ['char']]],
    'row_pointers': [0x180, ['pointer', ['pointer', ['unsigned char']]]],
    'int_gamma': [0x188, ['long']],
    'int_x_white': [0x190, ['long']],
    'int_y_white': [0x198, ['long']],
    'int_x_red': [0x1a0, ['long']],
    'int_y_red': [0x1a8, ['long']],
    'int_x_green': [0x1b0, ['long']],
    'int_y_green': [0x1b8, ['long']],
    'int_x_blue': [0x1c0, ['long']],
    'int_y_blue': [0x1c8, ['long']],
}],
  '_Vector_base<llvm::Value*, std::allocator<llvm::Value*': [ 0x18, {
    '_M_impl': [0x0, ['_Vector_impl']],
}],
  'simplify_type<llvm::Type*': [ 0x1, {
}],
  'uint16List': [ 0x10, {
    'next': [0x0, ['pointer', ['uint16List']]],
    'value': [0x8, ['unsigned short']],
}],
  'q_obj_qom_list_types_arg': [ 0x18, {
    'has_implements': [0x0, ['unsigned char']],
    'implements': [0x8, ['pointer', ['char']]],
    'has_abstract': [0x10, ['unsigned char']],
    'abstract': [0x11, ['unsigned char']],
}],
  '__unnamed_0xc4d': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['BlockBackendPublic']]],
}],
  'E1000E_RSSInfo_st': [ 0x10, {
    'enabled': [0x0, ['unsigned char']],
    'hash': [0x4, ['unsigned int']],
    'queue': [0x8, ['unsigned int']],
    'type': [0xc, ['unsigned int']],
}],
  'serpent_ctx': [ 0x210, {
    'keys': [0x0, ['array', 4, ['array', 33, ['unsigned int']]]],
}],
  'VncPaletteEntry': [ 0x18, {
    'idx': [0x0, ['int']],
    'color': [0x4, ['unsigned int']],
    'next': [0x8, ['__unnamed_0x1911']],
}],
  'pcap_sf_pkthdr': [ 0x10, {
    'ts': [0x0, ['__unnamed_0x1d8f']],
    'caplen': [0x8, ['unsigned int']],
    'len': [0xc, ['unsigned int']],
}],
  'xattr_operations': [ 0x28, {
    'name': [0x0, ['pointer', ['char']]],
    'getxattr': [0x8, ['pointer', ['void']]],
    'listxattr': [0x10, ['pointer', ['void']]],
    'setxattr': [0x18, ['pointer', ['void']]],
    'removexattr': [0x20, ['pointer', ['void']]],
}],
  'PlatformBusFDTData': [ 0x20, {
    'fdt': [0x0, ['pointer', ['void']]],
    'irq_start': [0x8, ['int']],
    'pbus_node_name': [0x10, ['pointer', ['char']]],
    'pbus': [0x18, ['pointer', ['PlatformBusDevice']]],
}],
  'SDState': [ 0x380, {
    'parent_obj': [0x0, ['DeviceState']],
    'mode': [0x70, ['unsigned int']],
    'state': [0x74, ['int']],
    'ocr': [0x78, ['unsigned int']],
    'ocr_power_timer': [0x80, ['pointer', ['QEMUTimer']]],
    'scr': [0x88, ['array', 8, ['unsigned char']]],
    'cid': [0x90, ['array', 16, ['unsigned char']]],
    'csd': [0xa0, ['array', 16, ['unsigned char']]],
    'rca': [0xb0, ['unsigned short']],
    'card_status': [0xb4, ['unsigned int']],
    'sd_status': [0xb8, ['array', 64, ['unsigned char']]],
    'vhs': [0xf8, ['unsigned int']],
    'wp_switch': [0xfc, ['unsigned char']],
    'wp_groups': [0x100, ['pointer', ['unsigned long']]],
    'wpgrps_size': [0x108, ['int']],
    'size': [0x110, ['unsigned long']],
    'blk_len': [0x118, ['unsigned int']],
    'multi_blk_cnt': [0x11c, ['unsigned int']],
    'erase_start': [0x120, ['unsigned int']],
    'erase_end': [0x124, ['unsigned int']],
    'pwd': [0x128, ['array', 16, ['unsigned char']]],
    'pwd_len': [0x138, ['unsigned int']],
    'function_group': [0x13c, ['array', 6, ['unsigned char']]],
    'spi': [0x142, ['unsigned char']],
    'current_cmd': [0x143, ['unsigned char']],
    'expecting_acmd': [0x144, ['unsigned char']],
    'blk_written': [0x148, ['unsigned int']],
    'data_start': [0x150, ['unsigned long']],
    'data_offset': [0x158, ['unsigned int']],
    'data': [0x15c, ['array', 512, ['unsigned char']]],
    'readonly_cb': [0x360, ['pointer', ['IRQState']]],
    'inserted_cb': [0x368, ['pointer', ['IRQState']]],
    'blk': [0x370, ['pointer', ['BlockBackend']]],
    'enable': [0x378, ['unsigned char']],
}],
  'VncBasicInfoList': [ 0x10, {
    'next': [0x0, ['pointer', ['VncBasicInfoList']]],
    'value': [0x8, ['pointer', ['VncBasicInfo']]],
}],
  'SCSIRequest': [ 0x198, {
    'bus': [0x0, ['pointer', ['SCSIBus']]],
    'dev': [0x8, ['pointer', ['SCSIDevice']]],
    'ops': [0x10, ['pointer', ['SCSIReqOps']]],
    'refcount': [0x18, ['unsigned int']],
    'tag': [0x1c, ['unsigned int']],
    'lun': [0x20, ['unsigned int']],
    'status': [0x24, ['unsigned int']],
    'hba_private': [0x28, ['pointer', ['void']]],
    'resid': [0x30, ['unsigned long']],
    'cmd': [0x38, ['SCSICommand']],
    'cancel_notifiers': [0x68, ['NotifierList']],
    'sense': [0x70, ['array', 252, ['unsigned char']]],
    'sense_len': [0x16c, ['unsigned int']],
    'enqueued': [0x170, ['unsigned char']],
    'io_canceled': [0x171, ['unsigned char']],
    'retry': [0x172, ['unsigned char']],
    'dma_started': [0x173, ['unsigned char']],
    'aiocb': [0x178, ['pointer', ['BlockAIOCB']]],
    'sg': [0x180, ['pointer', ['QEMUSGList']]],
    'next': [0x188, ['__unnamed_0x7a82']],
}],
  'PCIESlot': [ 0x1440, {
    'parent_obj': [0x0, ['PCIEPort']],
    'chassis': [0x1420, ['unsigned char']],
    'slot': [0x1422, ['unsigned short']],
    'next': [0x1428, ['__unnamed_0x29bc']],
}],
  '__unnamed_0x3429': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['BlockDriverState']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['BlockDriverState']]]],
}],
  'QmpCommandList': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['QmpCommand']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['QmpCommand']]]],
}],
  'QemuSpin': [ 0x4, {
    'value': [0x0, ['int']],
}],
  'mfi_stp_frame': [ 0x48, {
    'header': [0x0, ['mfi_frame_header']],
    'fis': [0x18, ['array', 10, ['unsigned short']]],
    'stp_flags': [0x2c, ['unsigned int']],
    'sgl': [0x30, ['__unnamed_0x6987']],
}],
  'mfi_ctrl_info': [ 0x800, {
    'pci': [0x0, ['mfi_info_pci']],
    'host': [0x20, ['mfi_info_host']],
    'device': [0x68, ['mfi_info_device']],
    'image_check_word': [0xb0, ['unsigned int']],
    'image_component_count': [0xb4, ['unsigned int']],
    'image_component': [0xb8, ['array', 8, ['mfi_info_component']]],
    'pending_image_component_count': [0x2f8, ['unsigned int']],
    'pending_image_component': [0x2fc, ['array', 8, ['mfi_info_component']]],
    'max_arms': [0x53c, ['unsigned char']],
    'max_spans': [0x53d, ['unsigned char']],
    'max_arrays': [0x53e, ['unsigned char']],
    'max_lds': [0x53f, ['unsigned char']],
    'product_name': [0x540, ['array', 80, ['char']]],
    'serial_number': [0x590, ['array', 32, ['char']]],
    'hw_present': [0x5b0, ['unsigned int']],
    'current_fw_time': [0x5b4, ['unsigned int']],
    'max_cmds': [0x5b8, ['unsigned short']],
    'max_sg_elements': [0x5ba, ['unsigned short']],
    'max_request_size': [0x5bc, ['unsigned int']],
    'lds_present': [0x5c0, ['unsigned short']],
    'lds_degraded': [0x5c2, ['unsigned short']],
    'lds_offline': [0x5c4, ['unsigned short']],
    'pd_present': [0x5c6, ['unsigned short']],
    'pd_disks_present': [0x5c8, ['unsigned short']],
    'pd_disks_pred_failure': [0x5ca, ['unsigned short']],
    'pd_disks_failed': [0x5cc, ['unsigned short']],
    'nvram_size': [0x5ce, ['unsigned short']],
    'memory_size': [0x5d0, ['unsigned short']],
    'flash_size': [0x5d2, ['unsigned short']],
    'ram_correctable_errors': [0x5d4, ['unsigned short']],
    'ram_uncorrectable_errors': [0x5d6, ['unsigned short']],
    'cluster_allowed': [0x5d8, ['unsigned char']],
    'cluster_active': [0x5d9, ['unsigned char']],
    'max_strips_per_io': [0x5da, ['unsigned short']],
    'raid_levels': [0x5dc, ['unsigned int']],
    'adapter_ops': [0x5e0, ['unsigned int']],
    'ld_ops': [0x5e4, ['unsigned int']],
    'stripe_sz_ops': [0x5e8, ['__unnamed_0x7088']],
    'pd_ops': [0x5ec, ['unsigned int']],
    'pd_mix_support': [0x5f0, ['unsigned int']],
    'ecc_bucket_count': [0x5f4, ['unsigned char']],
    'reserved2': [0x5f5, ['array', 11, ['unsigned char']]],
    'properties': [0x600, ['mfi_ctrl_props']],
    'package_version': [0x640, ['array', 96, ['char']]],
    'pad': [0x6a0, ['array', 352, ['unsigned char']]],
}],
  'QCryptoBlockOptionsLUKS': [ 0x10, {
    'has_key_secret': [0x0, ['unsigned char']],
    'key_secret': [0x8, ['pointer', ['char']]],
}],
  'DeviceState': [ 0x70, {
    'parent_obj': [0x0, ['Object']],
    'id': [0x28, ['pointer', ['char']]],
    'realized': [0x30, ['unsigned char']],
    'pending_deleted_event': [0x31, ['unsigned char']],
    'opts': [0x38, ['pointer', ['QemuOpts']]],
    'hotplugged': [0x40, ['int']],
    'parent_bus': [0x48, ['pointer', ['BusState']]],
    'gpios': [0x50, ['__unnamed_0x11c0']],
    'child_bus': [0x58, ['__unnamed_0x11d5']],
    'num_child_bus': [0x60, ['int']],
    'instance_id_alias': [0x64, ['int']],
    'alias_required_for_version': [0x68, ['int']],
}],
  '__unnamed_0x56fc': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['numa_addr_range']]],
}],
  'vhost_vring_state': [ 0x8, {
    'index': [0x0, ['unsigned int']],
    'num': [0x4, ['unsigned int']],
}],
  'scsi_sense': [ 0xc, {
    'error_type': [0x0, ['unsigned char']],
    'key': [0x4, ['Enumeration', {'target': 'int', 'choices': {0: 'SCSI_SENSE_NO_SENSE', 1: 'SCSI_SENSE_RECOVERED_ERROR', 2: 'SCSI_SENSE_NOT_READY', 3: 'SCSI_SENSE_MEDIUM_ERROR', 4: 'SCSI_SENSE_HARDWARE_ERROR', 5: 'SCSI_SENSE_ILLEGAL_REQUEST', 6: 'SCSI_SENSE_UNIT_ATTENTION', 7: 'SCSI_SENSE_DATA_PROTECTION', 8: 'SCSI_SENSE_BLANK_CHECK', 9: 'SCSI_SENSE_VENDOR_SPECIFIC', 10: 'SCSI_SENSE_COPY_ABORTED', 11: 'SCSI_SENSE_COMMAND_ABORTED', 12: 'SCSI_SENSE_OBSOLETE_ERROR_CODE', 13: 'SCSI_SENSE_OVERFLOW_COMMAND', 14: 'SCSI_SENSE_MISCOMPARE'}}]],
    'ascq': [0x8, ['int']],
}],
  'PciDeviceId': [ 0x10, {
    'device': [0x0, ['long']],
    'vendor': [0x8, ['long']],
}],
  'virtio_crypto_aead_session_para': [ 0x18, {
    'algo': [0x0, ['unsigned int']],
    'key_len': [0x4, ['unsigned int']],
    'hash_result_len': [0x8, ['unsigned int']],
    'aad_len': [0xc, ['unsigned int']],
    'op': [0x10, ['unsigned int']],
    'padding': [0x14, ['unsigned int']],
}],
  '__unnamed_0x430a': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['MPTSASRequest']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['MPTSASRequest']]]],
}],
  'AlignedCharArray<4ul, 8ul': [ 0x8, {
    'buffer': [0x0, ['array', 8, ['char']]],
}],
  'IDEDevice': [ 0xd8, {
    'qdev': [0x0, ['DeviceState']],
    'unit': [0x70, ['unsigned int']],
    'conf': [0x78, ['BlockConf']],
    'chs_trans': [0xb0, ['int']],
    'version': [0xb8, ['pointer', ['char']]],
    'serial': [0xc0, ['pointer', ['char']]],
    'model': [0xc8, ['pointer', ['char']]],
    'wwn': [0xd0, ['unsigned long']],
}],
  '_Panda__SrcInfo': [ 0x38, {
    'base': [0x0, ['ProtobufCMessage']],
    'filename': [0x18, ['unsigned int']],
    'linenum': [0x1c, ['unsigned int']],
    'astnodename': [0x20, ['unsigned int']],
    'has_insertionpoint': [0x24, ['int']],
    'insertionpoint': [0x28, ['unsigned int']],
    'has_ast_loc_id': [0x2c, ['int']],
    'ast_loc_id': [0x30, ['unsigned int']],
}],
  '__va_list_tag': [ 0x18, {
    'gp_offset': [0x0, ['unsigned int']],
    'fp_offset': [0x4, ['unsigned int']],
    'overflow_arg_area': [0x8, ['pointer', ['void']]],
    'reg_save_area': [0x10, ['pointer', ['void']]],
}],
  'QIOTaskThreadData': [ 0x20, {
    'task': [0x0, ['pointer', ['QIOTask']]],
    'worker': [0x8, ['pointer', ['void']]],
    'opaque': [0x10, ['pointer', ['void']]],
    'destroy': [0x18, ['pointer', ['void']]],
}],
  'CompatEntry': [ 0x104, {
    'idstr': [0x0, ['array', 256, ['char']]],
    'instance_id': [0x100, ['int']],
}],
  'io_iocb_vector': [ 0x18, {
    'vec': [0x0, ['pointer', ['iovec']]],
    'nr': [0x8, ['int']],
    'offset': [0x10, ['long long']],
}],
  '__unnamed_0x9e2e': [ 0x10, {
    'guest_cid': [0x0, ['unsigned long']],
    'vhostfd': [0x8, ['pointer', ['char']]],
}],
  'new_allocator<std::pair<const std::__cxx11::basic_string<char, std::char_traits<char': [ 0x1, {
}],
  'VhostUserMemory': [ 0x108, {
    'nregions': [0x0, ['unsigned int']],
    'padding': [0x4, ['unsigned int']],
    'regions': [0x8, ['array', 8, ['VhostUserMemoryRegion']]],
}],
  'SWVoiceIn': [ 0xa0, {
    'card': [0x0, ['pointer', ['QEMUSoundCard']]],
    'active': [0x8, ['int']],
    'info': [0xc, ['audio_pcm_info']],
    'ratio': [0x30, ['long']],
    'rate': [0x38, ['pointer', ['void']]],
    'total_hw_samples_acquired': [0x40, ['int']],
    'buf': [0x48, ['pointer', ['st_sample']]],
    'clip': [0x50, ['pointer', ['void']]],
    'hw': [0x58, ['pointer', ['HWVoiceIn']]],
    'name': [0x60, ['pointer', ['char']]],
    'vol': [0x68, ['mixeng_volume']],
    'callback': [0x80, ['audio_callback']],
    'entries': [0x90, ['Enumeration', {'target': 'int', 'choices': {0: 'QEMU_CLOCK_REALTIME', 1: 'QEMU_CLOCK_VIRTUAL', 2: 'QEMU_CLOCK_HOST', 3: 'QEMU_CLOCK_VIRTUAL_RT', 4: 'QEMU_CLOCK_MAX'}}]],
}],
  'q_obj_BLOCK_IMAGE_CORRUPTED_arg': [ 0x48, {
    'device': [0x0, ['pointer', ['char']]],
    'has_node_name': [0x8, ['unsigned char']],
    'node_name': [0x10, ['pointer', ['char']]],
    'msg': [0x18, ['pointer', ['char']]],
    'has_offset': [0x20, ['unsigned char']],
    'offset': [0x28, ['long']],
    'has_size': [0x30, ['unsigned char']],
    'size': [0x38, ['long']],
    'fatal': [0x40, ['unsigned char']],
}],
  '__unnamed_0x11c0': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['NamedGPIOList']]],
}],
  'MemoryDeviceInfoList': [ 0x10, {
    'next': [0x0, ['pointer', ['MemoryDeviceInfoList']]],
    'value': [0x8, ['pointer', ['MemoryDeviceInfo']]],
}],
  'new_allocator<std::__cxx11::basic_string<char, std::char_traits<char': [ 0x1, {
}],
  'VHDXVirtualDiskPhysicalSectorSize': [ 0x4, {
    'physical_sector_size': [0x0, ['unsigned int']],
}],
  'Chardev': [ 0x90, {
    'parent_obj': [0x0, ['Object']],
    'chr_write_lock': [0x28, ['QemuMutex']],
    'be': [0x50, ['pointer', ['CharBackend']]],
    'label': [0x58, ['pointer', ['char']]],
    'filename': [0x60, ['pointer', ['char']]],
    'logfd': [0x68, ['int']],
    'be_open': [0x6c, ['int']],
    'fd_in_tag': [0x70, ['unsigned int']],
    'features': [0x78, ['array', 1, ['unsigned long']]],
    'next': [0x80, ['__unnamed_0x1be5']],
}],
  '__unnamed_0x1d23': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['NamedGPIOList']]],
}],
  '__unnamed_0x205c': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['AddressSpace']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['AddressSpace']]]],
}],
  'BlkActionState': [ 0x28, {
    'action': [0x0, ['pointer', ['TransactionAction']]],
    'ops': [0x8, ['pointer', ['BlkActionOps']]],
    'block_job_txn': [0x10, ['pointer', ['BlockJobTxn']]],
    'txn_props': [0x18, ['pointer', ['TransactionProperties']]],
    'entry': [0x20, ['__unnamed_0x6729']],
}],
  'q_obj_ChardevUdp_wrapper': [ 0x8, {
    'data': [0x0, ['pointer', ['ChardevUdp']]],
}],
  'NetdevUserOptions': [ 0x110, {
    'has_hostname': [0x0, ['unsigned char']],
    'hostname': [0x8, ['pointer', ['char']]],
    'has_q_restrict': [0x10, ['unsigned char']],
    'q_restrict': [0x11, ['unsigned char']],
    'has_ipv4': [0x12, ['unsigned char']],
    'ipv4': [0x13, ['unsigned char']],
    'has_ipv6': [0x14, ['unsigned char']],
    'ipv6': [0x15, ['unsigned char']],
    'has_ip': [0x16, ['unsigned char']],
    'ip': [0x18, ['pointer', ['char']]],
    'has_net': [0x20, ['unsigned char']],
    'net': [0x28, ['pointer', ['char']]],
    'has_host': [0x30, ['unsigned char']],
    'host': [0x38, ['pointer', ['char']]],
    'has_tftp': [0x40, ['unsigned char']],
    'tftp': [0x48, ['pointer', ['char']]],
    'has_bootfile': [0x50, ['unsigned char']],
    'bootfile': [0x58, ['pointer', ['char']]],
    'has_dhcpstart': [0x60, ['unsigned char']],
    'dhcpstart': [0x68, ['pointer', ['char']]],
    'has_dns': [0x70, ['unsigned char']],
    'dns': [0x78, ['pointer', ['char']]],
    'has_dnssearch': [0x80, ['unsigned char']],
    'dnssearch': [0x88, ['pointer', ['StringList']]],
    'has_ipv6_prefix': [0x90, ['unsigned char']],
    'ipv6_prefix': [0x98, ['pointer', ['char']]],
    'has_ipv6_prefixlen': [0xa0, ['unsigned char']],
    'ipv6_prefixlen': [0xa8, ['long']],
    'has_ipv6_host': [0xb0, ['unsigned char']],
    'ipv6_host': [0xb8, ['pointer', ['char']]],
    'has_ipv6_dns': [0xc0, ['unsigned char']],
    'ipv6_dns': [0xc8, ['pointer', ['char']]],
    'has_smb': [0xd0, ['unsigned char']],
    'smb': [0xd8, ['pointer', ['char']]],
    'has_smbserver': [0xe0, ['unsigned char']],
    'smbserver': [0xe8, ['pointer', ['char']]],
    'has_hostfwd': [0xf0, ['unsigned char']],
    'hostfwd': [0xf8, ['pointer', ['StringList']]],
    'has_guestfwd': [0x100, ['unsigned char']],
    'guestfwd': [0x108, ['pointer', ['StringList']]],
}],
  'scsi_mode_page_power_condition': [ 0x38, {
    'pm_bg_precedence': [0x0, ['int']],
    'standby_y': [0x4, ['int']],
    'idle_c': [0x8, ['int']],
    'idle_b': [0xc, ['int']],
    'idle_a': [0x10, ['int']],
    'standby_z': [0x14, ['int']],
    'idle_a_condition_timer': [0x18, ['unsigned int']],
    'standby_z_condition_timer': [0x1c, ['unsigned int']],
    'idle_b_condition_timer': [0x20, ['unsigned int']],
    'idle_c_condition_timer': [0x24, ['unsigned int']],
    'standby_y_condition_timer': [0x28, ['unsigned int']],
    'ccf_idle': [0x2c, ['int']],
    'ccf_standby': [0x30, ['int']],
    'ccf_stopped': [0x34, ['int']],
}],
  '__uses_alloc_base': [ 0x1, {
}],
  'q_obj_ChardevSocket_wrapper': [ 0x8, {
    'data': [0x0, ['pointer', ['ChardevSocket']]],
}],
  'BlockdevRefList': [ 0x10, {
    'next': [0x0, ['pointer', ['BlockdevRefList']]],
    'value': [0x8, ['pointer', ['BlockdevRef']]],
}],
  'BlockdevOptionsQcow2': [ 0x70, {
    'file': [0x0, ['pointer', ['BlockdevRef']]],
    'has_backing': [0x8, ['unsigned char']],
    'backing': [0x10, ['pointer', ['BlockdevRef']]],
    'has_lazy_refcounts': [0x18, ['unsigned char']],
    'lazy_refcounts': [0x19, ['unsigned char']],
    'has_pass_discard_request': [0x1a, ['unsigned char']],
    'pass_discard_request': [0x1b, ['unsigned char']],
    'has_pass_discard_snapshot': [0x1c, ['unsigned char']],
    'pass_discard_snapshot': [0x1d, ['unsigned char']],
    'has_pass_discard_other': [0x1e, ['unsigned char']],
    'pass_discard_other': [0x1f, ['unsigned char']],
    'has_overlap_check': [0x20, ['unsigned char']],
    'overlap_check': [0x28, ['pointer', ['Qcow2OverlapChecks']]],
    'has_cache_size': [0x30, ['unsigned char']],
    'cache_size': [0x38, ['long']],
    'has_l2_cache_size': [0x40, ['unsigned char']],
    'l2_cache_size': [0x48, ['long']],
    'has_refcount_cache_size': [0x50, ['unsigned char']],
    'refcount_cache_size': [0x58, ['long']],
    'has_cache_clean_interval': [0x60, ['unsigned char']],
    'cache_clean_interval': [0x68, ['long']],
}],
  'VEDBoardInfo': [ 0x120, {
    'bootinfo': [0x0, ['arm_boot_info']],
    'motherboard_map': [0xe0, ['pointer', ['unsigned long']]],
    'loader_start': [0xe8, ['unsigned long']],
    'gic_cpu_if_addr': [0xf0, ['unsigned long']],
    'proc_id': [0xf8, ['unsigned int']],
    'num_voltage_sensors': [0xfc, ['unsigned int']],
    'voltages': [0x100, ['pointer', ['unsigned int']]],
    'num_clocks': [0x108, ['unsigned int']],
    'clocks': [0x110, ['pointer', ['unsigned int']]],
    'init': [0x118, ['pointer', ['void']]],
}],
  'RTL8201CPState': [ 0x8, {
    'bmcr': [0x0, ['unsigned short']],
    'bmsr': [0x2, ['unsigned short']],
    'anar': [0x4, ['unsigned short']],
    'anlpar': [0x6, ['unsigned short']],
}],
  'Vmxnet3_RxCompDesc': [ 0x10, {
    'sop': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 15}]],
    'ext2': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 31}]],
    'ext1': [0x0, ['BitField', {'end_bit': 14, 'start_bit': 12}]],
    'eop': [0x0, ['BitField', {'end_bit': 15, 'start_bit': 14}]],
    'rqID': [0x0, ['BitField', {'end_bit': 26, 'start_bit': 16}]],
    'cnc': [0x0, ['BitField', {'end_bit': 31, 'start_bit': 30}]],
    'rxdIdx': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 0}]],
    'rssType': [0x0, ['BitField', {'end_bit': 30, 'start_bit': 26}]],
    'rssHash': [0x4, ['unsigned int']],
    'tci': [0x8, ['BitField', {'end_bit': 32, 'start_bit': 16}]],
    'ts': [0x8, ['BitField', {'end_bit': 16, 'start_bit': 15}]],
    'len': [0x8, ['BitField', {'end_bit': 14, 'start_bit': 0}]],
    'err': [0x8, ['BitField', {'end_bit': 15, 'start_bit': 14}]],
    'ipc': [0xc, ['BitField', {'end_bit': 20, 'start_bit': 19}]],
    'tcp': [0xc, ['BitField', {'end_bit': 19, 'start_bit': 18}]],
    'csum': [0xc, ['BitField', {'end_bit': 16, 'start_bit': 0}]],
    'frg': [0xc, ['BitField', {'end_bit': 23, 'start_bit': 22}]],
    'type': [0xc, ['BitField', {'end_bit': 31, 'start_bit': 24}]],
    'udp': [0xc, ['BitField', {'end_bit': 18, 'start_bit': 17}]],
    'fcs': [0xc, ['BitField', {'end_bit': 24, 'start_bit': 23}]],
    'v4': [0xc, ['BitField', {'end_bit': 22, 'start_bit': 21}]],
    'v6': [0xc, ['BitField', {'end_bit': 21, 'start_bit': 20}]],
    'tuc': [0xc, ['BitField', {'end_bit': 17, 'start_bit': 16}]],
    'gen': [0xc, ['BitField', {'end_bit': 32, 'start_bit': 31}]],
}],
  'msos_prop_data': [ 0x4, {
    'dwPropertyDataLength': [0x0, ['unsigned int']],
    'bPropertyData': [0x4, ['array', 0, ['unsigned char']]],
}],
  'NetdevTapOptions': [ 0xb0, {
    'has_ifname': [0x0, ['unsigned char']],
    'ifname': [0x8, ['pointer', ['char']]],
    'has_fd': [0x10, ['unsigned char']],
    'fd': [0x18, ['pointer', ['char']]],
    'has_fds': [0x20, ['unsigned char']],
    'fds': [0x28, ['pointer', ['char']]],
    'has_script': [0x30, ['unsigned char']],
    'script': [0x38, ['pointer', ['char']]],
    'has_downscript': [0x40, ['unsigned char']],
    'downscript': [0x48, ['pointer', ['char']]],
    'has_br': [0x50, ['unsigned char']],
    'br': [0x58, ['pointer', ['char']]],
    'has_helper': [0x60, ['unsigned char']],
    'helper': [0x68, ['pointer', ['char']]],
    'has_sndbuf': [0x70, ['unsigned char']],
    'sndbuf': [0x78, ['unsigned long']],
    'has_vnet_hdr': [0x80, ['unsigned char']],
    'vnet_hdr': [0x81, ['unsigned char']],
    'has_vhost': [0x82, ['unsigned char']],
    'vhost': [0x83, ['unsigned char']],
    'has_vhostfd': [0x84, ['unsigned char']],
    'vhostfd': [0x88, ['pointer', ['char']]],
    'has_vhostfds': [0x90, ['unsigned char']],
    'vhostfds': [0x98, ['pointer', ['char']]],
    'has_vhostforce': [0xa0, ['unsigned char']],
    'vhostforce': [0xa1, ['unsigned char']],
    'has_queues': [0xa2, ['unsigned char']],
    'queues': [0xa4, ['unsigned int']],
    'has_poll_us': [0xa8, ['unsigned char']],
    'poll_us': [0xac, ['unsigned int']],
}],
  'TPMDriverOps': [ 0x78, {
    'type': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'TPM_TYPE_PASSTHROUGH', 1: 'TPM_TYPE__MAX'}}]],
    'opts': [0x8, ['pointer', ['QemuOptDesc']]],
    'desc': [0x10, ['pointer', ['void']]],
    'create': [0x18, ['pointer', ['void']]],
    'destroy': [0x20, ['pointer', ['void']]],
    'init': [0x28, ['pointer', ['void']]],
    'startup_tpm': [0x30, ['pointer', ['void']]],
    'had_startup_error': [0x38, ['pointer', ['void']]],
    'realloc_buffer': [0x40, ['pointer', ['void']]],
    'deliver_request': [0x48, ['pointer', ['void']]],
    'reset': [0x50, ['pointer', ['void']]],
    'cancel_cmd': [0x58, ['pointer', ['void']]],
    'get_tpm_established_flag': [0x60, ['pointer', ['void']]],
    'reset_tpm_established_flag': [0x68, ['pointer', ['void']]],
    'get_tpm_version': [0x70, ['pointer', ['void']]],
}],
  'elf32_rela': [ 0xc, {
    'r_offset': [0x0, ['unsigned int']],
    'r_info': [0x4, ['unsigned int']],
    'r_addend': [0x8, ['int']],
}],
  'q_obj_VNC_INITIALIZED_arg': [ 0x10, {
    'server': [0x0, ['pointer', ['VncServerInfo']]],
    'client': [0x8, ['pointer', ['VncClientInfo']]],
}],
  'USBDescString': [ 0x20, {
    'index': [0x0, ['unsigned char']],
    'str': [0x8, ['pointer', ['char']]],
    'next': [0x10, ['__unnamed_0x1183']],
}],
  'ip_pseudo_header': [ 0xc, {
    'ip_src': [0x0, ['unsigned int']],
    'ip_dst': [0x4, ['unsigned int']],
    'zeros': [0x8, ['unsigned char']],
    'ip_proto': [0x9, ['unsigned char']],
    'ip_payload': [0xa, ['unsigned short']],
}],
  'ReplicationOps': [ 0x20, {
    'start': [0x0, ['pointer', ['void']]],
    'stop': [0x8, ['pointer', ['void']]],
    'checkpoint': [0x10, ['pointer', ['void']]],
    'get_error': [0x18, ['pointer', ['void']]],
}],
  'HMPMigrationStatus': [ 0x18, {
    'timer': [0x0, ['pointer', ['QEMUTimer']]],
    'mon': [0x8, ['pointer', ['Monitor']]],
    'is_block_migration': [0x10, ['unsigned char']],
}],
  '_GList': [ 0x18, {
    'data': [0x0, ['pointer', ['void']]],
    'next': [0x8, ['pointer', ['_GList']]],
    'prev': [0x10, ['pointer', ['_GList']]],
}],
  'rebind<llvm::SourceMgr::SrcBuffer': [ 0x1, {
}],
  'DigicState': [ 0x1fd00, {
    'parent_obj': [0x0, ['DeviceState']],
    'cpu': [0x70, ['ARMCPU']],
    'timer': [0x1ec90, ['array', 3, ['DigicTimerState']]],
    'uart': [0x1f8c0, ['DigicUartState']],
}],
  '_Select1st<std::pair<const std::pair<long int, llvm::Type*': [ 0x1, {
}],
  'SDL_Rect': [ 0x8, {
    'x': [0x0, ['short']],
    'y': [0x2, ['short']],
    'w': [0x4, ['unsigned short']],
    'h': [0x6, ['unsigned short']],
}],
  'arm_user_vfp_state': [ 0x104, {
    'vregs': [0x0, ['array', 32, ['unsigned long']]],
    'fpscr': [0x100, ['unsigned int']],
}],
  '__unnamed_0x2b48': [ 0x8, {
    'sqe_next': [0x0, ['pointer', ['VFIOINTp']]],
}],
  'iovec': [ 0x10, {
    'iov_base': [0x0, ['pointer', ['void']]],
    'iov_len': [0x8, ['unsigned long']],
}],
  '__unnamed_0x379': [ 0x10, {
    '__u6_addr16': [0x0, ['array', 8, ['unsigned short']]],
    '__u6_addr32': [0x0, ['array', 4, ['unsigned int']]],
    '__u6_addr8': [0x0, ['array', 16, ['unsigned char']]],
}],
  'mv88w8618_flashcfg_state': [ 0x410, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'cfgr0': [0x400, ['unsigned int']],
}],
  '__unnamed_0x3365': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['BlockDriverState']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['BlockDriverState']]]],
}],
  'SSIAutoConnectArg': [ 0x10, {
    'cs_linep': [0x0, ['pointer', ['pointer', ['pointer', ['IRQState']]]]],
    'bus': [0x8, ['pointer', ['SSIBus']]],
}],
  'ARMCPU': [ 0x1ec18, {
    'parent_obj': [0x0, ['CPUState']],
    'env': [0x82a0, ['CPUARMState']],
    'cp_regs': [0x1ea08, ['pointer', ['_GHashTable']]],
    'cpreg_indexes': [0x1ea10, ['pointer', ['unsigned long']]],
    'cpreg_values': [0x1ea18, ['pointer', ['unsigned long']]],
    'cpreg_array_len': [0x1ea20, ['int']],
    'cpreg_vmstate_indexes': [0x1ea28, ['pointer', ['unsigned long']]],
    'cpreg_vmstate_values': [0x1ea30, ['pointer', ['unsigned long']]],
    'cpreg_vmstate_array_len': [0x1ea38, ['int']],
    'gt_timer': [0x1ea40, ['array', 4, ['pointer', ['QEMUTimer']]]],
    'gt_timer_outputs': [0x1ea60, ['array', 4, ['pointer', ['IRQState']]]],
    'gicv3_maintenance_interrupt': [0x1ea80, ['pointer', ['IRQState']]],
    'secure_memory': [0x1ea88, ['pointer', ['MemoryRegion']]],
    'dtb_compatible': [0x1ea90, ['pointer', ['char']]],
    'psci_version': [0x1ea98, ['unsigned int']],
    'start_powered_off': [0x1ea9c, ['unsigned char']],
    'powered_off': [0x1ea9d, ['unsigned char']],
    'has_el2': [0x1ea9e, ['unsigned char']],
    'has_el3': [0x1ea9f, ['unsigned char']],
    'has_pmu': [0x1eaa0, ['unsigned char']],
    'has_mpu': [0x1eaa1, ['unsigned char']],
    'pmsav7_dregion': [0x1eaa4, ['unsigned int']],
    'psci_conduit': [0x1eaa8, ['unsigned int']],
    'kvm_target': [0x1eaac, ['unsigned int']],
    'kvm_init_features': [0x1eab0, ['array', 7, ['unsigned int']]],
    'mp_is_up': [0x1eacc, ['unsigned char']],
    'midr': [0x1ead0, ['unsigned int']],
    'revidr': [0x1ead4, ['unsigned int']],
    'reset_fpsid': [0x1ead8, ['unsigned int']],
    'mvfr0': [0x1eadc, ['unsigned int']],
    'mvfr1': [0x1eae0, ['unsigned int']],
    'mvfr2': [0x1eae4, ['unsigned int']],
    'ctr': [0x1eae8, ['unsigned int']],
    'reset_sctlr': [0x1eaec, ['unsigned int']],
    'id_pfr0': [0x1eaf0, ['unsigned int']],
    'id_pfr1': [0x1eaf4, ['unsigned int']],
    'id_dfr0': [0x1eaf8, ['unsigned int']],
    'pmceid0': [0x1eafc, ['unsigned int']],
    'pmceid1': [0x1eb00, ['unsigned int']],
    'id_afr0': [0x1eb04, ['unsigned int']],
    'id_mmfr0': [0x1eb08, ['unsigned int']],
    'id_mmfr1': [0x1eb0c, ['unsigned int']],
    'id_mmfr2': [0x1eb10, ['unsigned int']],
    'id_mmfr3': [0x1eb14, ['unsigned int']],
    'id_mmfr4': [0x1eb18, ['unsigned int']],
    'id_isar0': [0x1eb1c, ['unsigned int']],
    'id_isar1': [0x1eb20, ['unsigned int']],
    'id_isar2': [0x1eb24, ['unsigned int']],
    'id_isar3': [0x1eb28, ['unsigned int']],
    'id_isar4': [0x1eb2c, ['unsigned int']],
    'id_isar5': [0x1eb30, ['unsigned int']],
    'id_aa64pfr0': [0x1eb38, ['unsigned long']],
    'id_aa64pfr1': [0x1eb40, ['unsigned long']],
    'id_aa64dfr0': [0x1eb48, ['unsigned long']],
    'id_aa64dfr1': [0x1eb50, ['unsigned long']],
    'id_aa64afr0': [0x1eb58, ['unsigned long']],
    'id_aa64afr1': [0x1eb60, ['unsigned long']],
    'id_aa64isar0': [0x1eb68, ['unsigned long']],
    'id_aa64isar1': [0x1eb70, ['unsigned long']],
    'id_aa64mmfr0': [0x1eb78, ['unsigned long']],
    'id_aa64mmfr1': [0x1eb80, ['unsigned long']],
    'dbgdidr': [0x1eb88, ['unsigned int']],
    'clidr': [0x1eb8c, ['unsigned int']],
    'mp_affinity': [0x1eb90, ['unsigned long']],
    'ccsidr': [0x1eb98, ['array', 16, ['unsigned int']]],
    'reset_cbar': [0x1ebd8, ['unsigned long']],
    'reset_auxcr': [0x1ebe0, ['unsigned int']],
    'reset_hivecs': [0x1ebe4, ['unsigned char']],
    'dcz_blocksize': [0x1ebe8, ['unsigned int']],
    'rvbar': [0x1ebf0, ['unsigned long']],
    'gic_num_lrs': [0x1ebf8, ['int']],
    'gic_vpribits': [0x1ebfc, ['int']],
    'gic_vprebits': [0x1ec00, ['int']],
    'el_change_hook': [0x1ec08, ['pointer', ['void']]],
    'el_change_hook_opaque': [0x1ec10, ['pointer', ['void']]],
}],
  'AspeedSMCFlash': [ 0x120, {
    'controller': [0x0, ['pointer', ['AspeedSMCState']]],
    'id': [0x8, ['unsigned char']],
    'size': [0xc, ['unsigned int']],
    'mmio': [0x10, ['MemoryRegion']],
    'flash': [0x110, ['pointer', ['DeviceState']]],
}],
  '__unnamed_0x3361': [ 0x10, {
    'le_next': [0x0, ['pointer', ['BlkdebugSuspendedReq']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['BlkdebugSuspendedReq']]]],
}],
  'OSSVoiceIn': [ 0x98, {
    'hw': [0x0, ['HWVoiceIn']],
    'pcm_buf': [0x78, ['pointer', ['void']]],
    'fd': [0x80, ['int']],
    'nfrags': [0x84, ['int']],
    'fragsize': [0x88, ['int']],
    'conf': [0x90, ['pointer', ['OSSConf']]],
}],
  'BlockDirtyInfo': [ 0x20, {
    'has_name': [0x0, ['unsigned char']],
    'name': [0x8, ['pointer', ['char']]],
    'count': [0x10, ['long']],
    'granularity': [0x18, ['unsigned int']],
    'status': [0x1c, ['Enumeration', {'target': 'int', 'choices': {0: 'DIRTY_BITMAP_STATUS_ACTIVE', 1: 'DIRTY_BITMAP_STATUS_DISABLED', 2: 'DIRTY_BITMAP_STATUS_FROZEN', 3: 'DIRTY_BITMAP_STATUS__MAX'}}]],
}],
  'MAX7310State': [ 0xd0, {
    'parent_obj': [0x0, ['I2CSlave']],
    'i2c_command_byte': [0x78, ['int']],
    'len': [0x7c, ['int']],
    'level': [0x80, ['unsigned char']],
    'direction': [0x81, ['unsigned char']],
    'polarity': [0x82, ['unsigned char']],
    'status': [0x83, ['unsigned char']],
    'command': [0x84, ['unsigned char']],
    'handler': [0x88, ['array', 8, ['pointer', ['IRQState']]]],
    'gpio_in': [0xc8, ['pointer', ['pointer', ['IRQState']]]],
}],
  'SaveStateEntry': [ 0x148, {
    'entry': [0x0, ['__unnamed_0x4843']],
    'idstr': [0x10, ['array', 256, ['char']]],
    'instance_id': [0x110, ['int']],
    'alias_id': [0x114, ['int']],
    'version_id': [0x118, ['int']],
    'section_id': [0x11c, ['int']],
    'ops': [0x120, ['pointer', ['SaveVMHandlers']]],
    'vmsd': [0x128, ['pointer', ['VMStateDescription']]],
    'opaque': [0x130, ['pointer', ['void']]],
    'compat': [0x138, ['pointer', ['CompatEntry']]],
    'is_ram': [0x140, ['int']],
}],
  '_List_iterator<vixl::DecoderVisitor*': [ 0x8, {
    '_M_node': [0x0, ['pointer', ['_List_node_base']]],
}],
  'q_obj_RTC_CHANGE_arg': [ 0x8, {
    'offset': [0x0, ['long']],
}],
  'PCIBridge': [ 0x1410, {
    'parent_obj': [0x0, ['PCIDevice']],
    'sec_bus': [0x8f0, ['PCIBus']],
    'address_space_mem': [0x11f0, ['MemoryRegion']],
    'address_space_io': [0x12f0, ['MemoryRegion']],
    'windows': [0x13f0, ['pointer', ['PCIBridgeWindows']]],
    'map_irq': [0x13f8, ['pointer', ['void']]],
    'bus_name': [0x1400, ['pointer', ['char']]],
}],
  'sw_in_listhead': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['SWVoiceIn']]],
}],
  'InterfaceClass': [ 0x70, {
    'parent_class': [0x0, ['ObjectClass']],
    'concrete_class': [0x60, ['pointer', ['ObjectClass']]],
    'interface_type': [0x68, ['pointer', ['TypeImpl']]],
}],
  'ilist_node_traits<llvm::NamedMDNode': [ 0x1, {
}],
  'OMAPI2CState': [ 0x460, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'irq': [0x400, ['pointer', ['IRQState']]],
    'drq': [0x408, ['array', 2, ['pointer', ['IRQState']]]],
    'bus': [0x418, ['pointer', ['I2CBus']]],
    'revision': [0x420, ['unsigned char']],
    'iclk': [0x428, ['pointer', ['void']]],
    'fclk': [0x430, ['pointer', ['void']]],
    'mask': [0x438, ['unsigned char']],
    'stat': [0x43a, ['unsigned short']],
    'dma': [0x43c, ['unsigned short']],
    'count': [0x43e, ['unsigned short']],
    'count_cur': [0x440, ['int']],
    'fifo': [0x444, ['unsigned int']],
    'rxlen': [0x448, ['int']],
    'txlen': [0x44c, ['int']],
    'control': [0x450, ['unsigned short']],
    'addr': [0x452, ['array', 2, ['unsigned short']]],
    'divider': [0x456, ['unsigned char']],
    'times': [0x457, ['array', 2, ['unsigned char']]],
    'test': [0x45a, ['unsigned short']],
}],
  'virtio_console_config': [ 0xc, {
    'cols': [0x0, ['unsigned short']],
    'rows': [0x2, ['unsigned short']],
    'max_nr_ports': [0x4, ['unsigned int']],
    'emerg_wr': [0x8, ['unsigned int']],
}],
  'sizeList': [ 0x10, {
    'next': [0x0, ['pointer', ['sizeList']]],
    'value': [0x8, ['unsigned long']],
}],
  'remove_reference<std::__cxx11::basic_string<char, std::char_traits<char': [ 0x1, {
}],
  'q_obj_cpu_arg': [ 0x8, {
    'index': [0x0, ['long']],
}],
  '__unnamed_0x726f': [ 0x10, {
    'le_next': [0x0, ['pointer', ['VirtIOSerial']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['VirtIOSerial']]]],
}],
  '__unnamed_0x2f23': [ 0x10, {
    'le_next': [0x0, ['pointer', ['BdrvAioNotifier']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['BdrvAioNotifier']]]],
}],
  'MultiReqBuffer': [ 0x108, {
    'reqs': [0x0, ['array', 32, ['pointer', ['VirtIOBlockReq']]]],
    'num_reqs': [0x100, ['unsigned int']],
    'is_write': [0x104, ['unsigned char']],
}],
  'input_iterator_tag': [ 0x1, {
}],
  'NVICClass': [ 0x100, {
    'parent_class': [0x0, ['ARMGICClass']],
    'parent_realize': [0xf0, ['pointer', ['void']]],
    'parent_reset': [0xf8, ['pointer', ['void']]],
}],
  'USBCCIDState': [ 0x124c0, {
    'dev': [0x0, ['USBDevice']],
    'intr': [0x16a8, ['pointer', ['USBEndpoint']]],
    'bulk': [0x16b0, ['pointer', ['USBEndpoint']]],
    'bus': [0x16b8, ['CCIDBus']],
    'card': [0x1720, ['pointer', ['CCIDCardState']]],
    'bulk_in_pending': [0x1728, ['array', 8, ['BulkIn']]],
    'bulk_in_pending_start': [0x2368, ['unsigned int']],
    'bulk_in_pending_end': [0x236c, ['unsigned int']],
    'bulk_in_pending_num': [0x2370, ['unsigned int']],
    'current_bulk_in': [0x2378, ['pointer', ['BulkIn']]],
    'bulk_out_data': [0x2380, ['array', 65536, ['unsigned char']]],
    'bulk_out_pos': [0x12380, ['unsigned int']],
    'last_answer_error': [0x12388, ['unsigned long']],
    'pending_answers': [0x12390, ['array', 128, ['Answer']]],
    'pending_answers_start': [0x12490, ['unsigned int']],
    'pending_answers_end': [0x12494, ['unsigned int']],
    'pending_answers_num': [0x12498, ['unsigned int']],
    'bError': [0x1249c, ['unsigned char']],
    'bmCommandStatus': [0x1249d, ['unsigned char']],
    'bProtocolNum': [0x1249e, ['unsigned char']],
    'abProtocolDataStructure': [0x1249f, ['CCID_ProtocolDataStructure']],
    'ulProtocolDataStructureSize': [0x124a8, ['unsigned int']],
    'state_vmstate': [0x124ac, ['unsigned int']],
    'migration_target_ip': [0x124b0, ['unsigned int']],
    'migration_target_port': [0x124b4, ['unsigned short']],
    'migration_state': [0x124b6, ['unsigned char']],
    'bmSlotICCState': [0x124b7, ['unsigned char']],
    'powered': [0x124b8, ['unsigned char']],
    'notify_slot_change': [0x124b9, ['unsigned char']],
    'debug': [0x124ba, ['unsigned char']],
}],
  'VFIOCalxedaXgmacDeviceClass': [ 0xe0, {
    'parent_class': [0x0, ['VFIOPlatformDeviceClass']],
    'parent_realize': [0xd8, ['pointer', ['void']]],
}],
  'q_obj_query_rx_filter_arg': [ 0x10, {
    'has_name': [0x0, ['unsigned char']],
    'name': [0x8, ['pointer', ['char']]],
}],
  'SDL_JoyBallEvent': [ 0x8, {
    'type': [0x0, ['unsigned char']],
    'which': [0x1, ['unsigned char']],
    'ball': [0x2, ['unsigned char']],
    'xrel': [0x4, ['short']],
    'yrel': [0x6, ['short']],
}],
  'simplify_type<llvm::Constant*': [ 0x1, {
}],
  '__unnamed_0x8cfe': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['mon_fd_t']]],
}],
  '__unnamed_0x2cc4': [ 0x18, {
    'addr_read': [0x0, ['unsigned int']],
    'addr_write': [0x4, ['unsigned int']],
    'addr_code': [0x8, ['unsigned int']],
    'addend': [0x10, ['unsigned long']],
}],
  '_Vector_base<std::pair<unsigned int, unsigned int': [ 0x18, {
    '_M_impl': [0x0, ['_Vector_impl']],
}],
  '__unnamed_0x11e3': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['USBDescString']]],
}],
  'allocator_traits<std::allocator<std::_Rb_tree_node<std::pair<const llvm::Function* const, long int': [ 0x1, {
}],
  'MigrationInfo': [ 0x98, {
    'has_status': [0x0, ['unsigned char']],
    'status': [0x4, ['Enumeration', {'target': 'int', 'choices': {0: 'MIGRATION_STATUS_NONE', 1: 'MIGRATION_STATUS_SETUP', 2: 'MIGRATION_STATUS_CANCELLING', 3: 'MIGRATION_STATUS_CANCELLED', 4: 'MIGRATION_STATUS_ACTIVE', 5: 'MIGRATION_STATUS_POSTCOPY_ACTIVE', 6: 'MIGRATION_STATUS_COMPLETED', 7: 'MIGRATION_STATUS_FAILED', 8: 'MIGRATION_STATUS_COLO', 9: 'MIGRATION_STATUS__MAX'}}]],
    'has_ram': [0x8, ['unsigned char']],
    'ram': [0x10, ['pointer', ['MigrationStats']]],
    'has_disk': [0x18, ['unsigned char']],
    'disk': [0x20, ['pointer', ['MigrationStats']]],
    'has_xbzrle_cache': [0x28, ['unsigned char']],
    'xbzrle_cache': [0x30, ['pointer', ['XBZRLECacheStats']]],
    'has_total_time': [0x38, ['unsigned char']],
    'total_time': [0x40, ['long']],
    'has_expected_downtime': [0x48, ['unsigned char']],
    'expected_downtime': [0x50, ['long']],
    'has_downtime': [0x58, ['unsigned char']],
    'downtime': [0x60, ['long']],
    'has_setup_time': [0x68, ['unsigned char']],
    'setup_time': [0x70, ['long']],
    'has_cpu_throttle_percentage': [0x78, ['unsigned char']],
    'cpu_throttle_percentage': [0x80, ['long']],
    'has_error_desc': [0x88, ['unsigned char']],
    'error_desc': [0x90, ['pointer', ['char']]],
}],
  'vhost_memory': [ 0x8, {
    'nregions': [0x0, ['unsigned int']],
    'padding': [0x4, ['unsigned int']],
    'regions': [0x8, ['array', 0, ['vhost_memory_region']]],
}],
  'MigrationParameters': [ 0xa0, {
    'has_compress_level': [0x0, ['unsigned char']],
    'compress_level': [0x8, ['long']],
    'has_compress_threads': [0x10, ['unsigned char']],
    'compress_threads': [0x18, ['long']],
    'has_decompress_threads': [0x20, ['unsigned char']],
    'decompress_threads': [0x28, ['long']],
    'has_cpu_throttle_initial': [0x30, ['unsigned char']],
    'cpu_throttle_initial': [0x38, ['long']],
    'has_cpu_throttle_increment': [0x40, ['unsigned char']],
    'cpu_throttle_increment': [0x48, ['long']],
    'has_tls_creds': [0x50, ['unsigned char']],
    'tls_creds': [0x58, ['pointer', ['char']]],
    'has_tls_hostname': [0x60, ['unsigned char']],
    'tls_hostname': [0x68, ['pointer', ['char']]],
    'has_max_bandwidth': [0x70, ['unsigned char']],
    'max_bandwidth': [0x78, ['long']],
    'has_downtime_limit': [0x80, ['unsigned char']],
    'downtime_limit': [0x88, ['long']],
    'has_x_checkpoint_delay': [0x90, ['unsigned char']],
    'x_checkpoint_delay': [0x98, ['long']],
}],
  'ObjectProperty': [ 0x40, {
    'name': [0x0, ['pointer', ['char']]],
    'type': [0x8, ['pointer', ['char']]],
    'description': [0x10, ['pointer', ['char']]],
    'get': [0x18, ['pointer', ['void']]],
    'set': [0x20, ['pointer', ['void']]],
    'resolve': [0x28, ['pointer', ['void']]],
    'release': [0x30, ['pointer', ['void']]],
    'opaque': [0x38, ['pointer', ['void']]],
}],
  'XHCIEvent': [ 0x20, {
    'type': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'TRB_RESERVED', 1: 'TR_NORMAL', 2: 'TR_SETUP', 3: 'TR_DATA', 4: 'TR_STATUS', 5: 'TR_ISOCH', 6: 'TR_LINK', 7: 'TR_EVDATA', 8: 'TR_NOOP', 9: 'CR_ENABLE_SLOT', 10: 'CR_DISABLE_SLOT', 11: 'CR_ADDRESS_DEVICE', 12: 'CR_CONFIGURE_ENDPOINT', 13: 'CR_EVALUATE_CONTEXT', 14: 'CR_RESET_ENDPOINT', 15: 'CR_STOP_ENDPOINT', 16: 'CR_SET_TR_DEQUEUE', 17: 'CR_RESET_DEVICE', 18: 'CR_FORCE_EVENT', 19: 'CR_NEGOTIATE_BW', 20: 'CR_SET_LATENCY_TOLERANCE', 21: 'CR_GET_PORT_BANDWIDTH', 22: 'CR_FORCE_HEADER', 23: 'CR_NOOP', 32: 'ER_TRANSFER', 33: 'ER_COMMAND_COMPLETE', 34: 'ER_PORT_STATUS_CHANGE', 35: 'ER_BANDWIDTH_REQUEST', 36: 'ER_DOORBELL', 37: 'ER_HOST_CONTROLLER', 38: 'ER_DEVICE_NOTIFICATION', 39: 'ER_MFINDEX_WRAP', 48: 'CR_VENDOR_VIA_CHALLENGE_RESPONSE', 49: 'CR_VENDOR_NEC_FIRMWARE_REVISION', 50: 'CR_VENDOR_NEC_CHALLENGE_RESPONSE'}}]],
    'ccode': [0x4, ['Enumeration', {'target': 'int', 'choices': {0: 'CC_INVALID', 1: 'CC_SUCCESS', 2: 'CC_DATA_BUFFER_ERROR', 3: 'CC_BABBLE_DETECTED', 4: 'CC_USB_TRANSACTION_ERROR', 5: 'CC_TRB_ERROR', 6: 'CC_STALL_ERROR', 7: 'CC_RESOURCE_ERROR', 8: 'CC_BANDWIDTH_ERROR', 9: 'CC_NO_SLOTS_ERROR', 10: 'CC_INVALID_STREAM_TYPE_ERROR', 11: 'CC_SLOT_NOT_ENABLED_ERROR', 12: 'CC_EP_NOT_ENABLED_ERROR', 13: 'CC_SHORT_PACKET', 14: 'CC_RING_UNDERRUN', 15: 'CC_RING_OVERRUN', 16: 'CC_VF_ER_FULL', 17: 'CC_PARAMETER_ERROR', 18: 'CC_BANDWIDTH_OVERRUN', 19: 'CC_CONTEXT_STATE_ERROR', 20: 'CC_NO_PING_RESPONSE_ERROR', 21: 'CC_EVENT_RING_FULL_ERROR', 22: 'CC_INCOMPATIBLE_DEVICE_ERROR', 23: 'CC_MISSED_SERVICE_ERROR', 24: 'CC_COMMAND_RING_STOPPED', 25: 'CC_COMMAND_ABORTED', 26: 'CC_STOPPED', 27: 'CC_STOPPED_LENGTH_INVALID', 29: 'CC_MAX_EXIT_LATENCY_TOO_LARGE_ERROR', 31: 'CC_ISOCH_BUFFER_OVERRUN', 32: 'CC_EVENT_LOST_ERROR', 33: 'CC_UNDEFINED_ERROR', 34: 'CC_INVALID_STREAM_ID_ERROR', 35: 'CC_SECONDARY_BANDWIDTH_ERROR', 36: 'CC_SPLIT_TRANSACTION_ERROR'}}]],
    'ptr': [0x8, ['unsigned long']],
    'length': [0x10, ['unsigned int']],
    'flags': [0x14, ['unsigned int']],
    'slotid': [0x18, ['unsigned char']],
    'epid': [0x19, ['unsigned char']],
}],
  'SpiceWatch': [ 0x28, {
    'fd': [0x0, ['int']],
    'event_mask': [0x4, ['int']],
    'func': [0x8, ['pointer', ['void']]],
    'opaque': [0x10, ['pointer', ['void']]],
    'next': [0x18, ['Enumeration', {'target': 'int', 'choices': {0: 'DMA_DIRECTION_TO_DEVICE', 1: 'DMA_DIRECTION_FROM_DEVICE'}}]],
}],
  'IMX31KZM': [ 0x22d30, {
    'soc': [0x0, ['FslIMX31State']],
    'ram': [0x22b30, ['MemoryRegion']],
    'ram_alias': [0x22c30, ['MemoryRegion']],
}],
  'TraceEventInfoList': [ 0x10, {
    'next': [0x0, ['pointer', ['TraceEventInfoList']]],
    'value': [0x8, ['pointer', ['TraceEventInfo']]],
}],
  'TCGBackendData': [ 0x8, {
    'labels': [0x0, ['pointer', ['TCGLabelQemuLdst']]],
}],
  'DriveBackupState': [ 0x40, {
    'common': [0x0, ['BlkActionState']],
    'bs': [0x28, ['pointer', ['BlockDriverState']]],
    'aio_context': [0x30, ['pointer', ['AioContext']]],
    'job': [0x38, ['pointer', ['BlockJob']]],
}],
  'AspeedTimer': [ 0x58, {
    'irq': [0x0, ['pointer', ['IRQState']]],
    'id': [0x8, ['unsigned char']],
    'timer': [0x10, ['QEMUTimer']],
    'level': [0x40, ['int']],
    'reload': [0x44, ['unsigned int']],
    'match': [0x48, ['array', 2, ['unsigned int']]],
    'start': [0x50, ['unsigned long']],
}],
  '__unnamed_0x957': [ 0x10, {
    'le_next': [0x0, ['pointer', ['CaptureState']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['CaptureState']]]],
}],
  '__unnamed_0x9434': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['V9fsPDU']]],
}],
  'RxFilterInfo': [ 0x40, {
    'name': [0x0, ['pointer', ['char']]],
    'promiscuous': [0x8, ['unsigned char']],
    'multicast': [0xc, ['Enumeration', {'target': 'int', 'choices': {0: 'RX_STATE_NORMAL', 1: 'RX_STATE_NONE', 2: 'RX_STATE_ALL', 3: 'RX_STATE__MAX'}}]],
    'unicast': [0x10, ['Enumeration', {'target': 'int', 'choices': {0: 'RX_STATE_NORMAL', 1: 'RX_STATE_NONE', 2: 'RX_STATE_ALL', 3: 'RX_STATE__MAX'}}]],
    'vlan': [0x14, ['Enumeration', {'target': 'int', 'choices': {0: 'RX_STATE_NORMAL', 1: 'RX_STATE_NONE', 2: 'RX_STATE_ALL', 3: 'RX_STATE__MAX'}}]],
    'broadcast_allowed': [0x18, ['unsigned char']],
    'multicast_overflow': [0x19, ['unsigned char']],
    'unicast_overflow': [0x1a, ['unsigned char']],
    'main_mac': [0x20, ['pointer', ['char']]],
    'vlan_table': [0x28, ['pointer', ['intList']]],
    'unicast_table': [0x30, ['pointer', ['strList']]],
    'multicast_table': [0x38, ['pointer', ['strList']]],
}],
  'Monitor': [ 0x100, {
    'chr': [0x0, ['CharBackend']],
    'reset_seen': [0x30, ['int']],
    'flags': [0x34, ['int']],
    'suspend_cnt': [0x38, ['int']],
    'skip_flush': [0x3c, ['unsigned char']],
    'out_lock': [0x40, ['QemuMutex']],
    'outbuf': [0x68, ['pointer', ['QString']]],
    'out_watch': [0x70, ['unsigned int']],
    'mux_out': [0x74, ['int']],
    'rs': [0x78, ['pointer', ['ReadLineState']]],
    'qmp': [0x80, ['__unnamed_0x8c6a']],
    'mon_cpu': [0xc8, ['pointer', ['CPUState']]],
    'password_completion_cb': [0xd0, ['pointer', ['void']]],
    'password_opaque': [0xd8, ['pointer', ['void']]],
    'cmd_table': [0xe0, ['pointer', ['mon_cmd_t']]],
    'fds': [0xe8, ['__unnamed_0x8cfe']],
    'entry': [0xf0, ['__unnamed_0x8d13']],
}],
  '__unnamed_0x950': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['QemuOpts']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['QemuOpts']]]],
}],
  'device_listeners': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['DeviceListener']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['DeviceListener']]]],
}],
  'Flash': [ 0xe0, {
    'parent_obj': [0x0, ['SSISlave']],
    'blk': [0x78, ['pointer', ['BlockBackend']]],
    'storage': [0x80, ['pointer', ['unsigned char']]],
    'size': [0x88, ['unsigned int']],
    'page_size': [0x8c, ['int']],
    'state': [0x90, ['unsigned char']],
    'data': [0x91, ['array', 16, ['unsigned char']]],
    'len': [0xa4, ['unsigned int']],
    'pos': [0xa8, ['unsigned int']],
    'needed_bytes': [0xac, ['unsigned char']],
    'cmd_in_progress': [0xad, ['unsigned char']],
    'cur_addr': [0xb0, ['unsigned int']],
    'nonvolatile_cfg': [0xb4, ['unsigned int']],
    'volatile_cfg': [0xb8, ['unsigned int']],
    'enh_volatile_cfg': [0xbc, ['unsigned int']],
    'spansion_cr1nv': [0xc0, ['unsigned char']],
    'spansion_cr2nv': [0xc1, ['unsigned char']],
    'spansion_cr3nv': [0xc2, ['unsigned char']],
    'spansion_cr4nv': [0xc3, ['unsigned char']],
    'spansion_cr1v': [0xc4, ['unsigned char']],
    'spansion_cr2v': [0xc5, ['unsigned char']],
    'spansion_cr3v': [0xc6, ['unsigned char']],
    'spansion_cr4v': [0xc7, ['unsigned char']],
    'write_enable': [0xc8, ['unsigned char']],
    'four_bytes_address_mode': [0xc9, ['unsigned char']],
    'reset_enable': [0xca, ['unsigned char']],
    'quad_enable': [0xcb, ['unsigned char']],
    'ear': [0xcc, ['unsigned char']],
    'dirty_page': [0xd0, ['long']],
    'pi': [0xd8, ['pointer', ['FlashPartInfo']]],
}],
  '__uninitialized_copy<true': [ 0x1, {
}],
  'q_obj_SPICE_INITIALIZED_arg': [ 0x10, {
    'server': [0x0, ['pointer', ['SpiceServerInfo']]],
    'client': [0x8, ['pointer', ['SpiceChannel']]],
}],
  'QObjectInputVisitor': [ 0xb8, {
    'visitor': [0x0, ['Visitor']],
    'root': [0xa0, ['pointer', ['QObject']]],
    'stack': [0xa8, ['__unnamed_0xdba']],
    'strict': [0xb0, ['unsigned char']],
}],
  '__unnamed_0x3e5e': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['USBHostIsoRing']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['USBHostIsoRing']]]],
}],
  'BlockAIOCB': [ 0x28, {
    'aiocb_info': [0x0, ['pointer', ['AIOCBInfo']]],
    'bs': [0x8, ['pointer', ['BlockDriverState']]],
    'cb': [0x10, ['pointer', ['void']]],
    'opaque': [0x18, ['pointer', ['void']]],
    'refcnt': [0x20, ['int']],
}],
  'q_obj_add_fd_arg': [ 0x20, {
    'has_fdset_id': [0x0, ['unsigned char']],
    'fdset_id': [0x8, ['long']],
    'has_opaque': [0x10, ['unsigned char']],
    'opaque': [0x18, ['pointer', ['char']]],
}],
  'RockerSwitch': [ 0x18, {
    'name': [0x0, ['pointer', ['char']]],
    'id': [0x8, ['unsigned long']],
    'ports': [0x10, ['unsigned int']],
}],
  'QemuSeqLock': [ 0x4, {
    'sequence': [0x0, ['unsigned int']],
}],
  '_GThreadPool': [ 0x18, {
    'func': [0x0, ['pointer', ['void']]],
    'user_data': [0x8, ['pointer', ['void']]],
    'exclusive': [0x10, ['int']],
}],
  'ChardevVC': [ 0x50, {
    'has_logfile': [0x0, ['unsigned char']],
    'logfile': [0x8, ['pointer', ['char']]],
    'has_logappend': [0x10, ['unsigned char']],
    'logappend': [0x11, ['unsigned char']],
    'has_width': [0x12, ['unsigned char']],
    'width': [0x18, ['long']],
    'has_height': [0x20, ['unsigned char']],
    'height': [0x28, ['long']],
    'has_cols': [0x30, ['unsigned char']],
    'cols': [0x38, ['long']],
    'has_rows': [0x40, ['unsigned char']],
    'rows': [0x48, ['long']],
}],
  'RTL8139TallyCounters': [ 0x40, {
    'TxOk': [0x0, ['unsigned long']],
    'RxOk': [0x8, ['unsigned long']],
    'TxERR': [0x10, ['unsigned long']],
    'RxERR': [0x18, ['unsigned int']],
    'MissPkt': [0x1c, ['unsigned short']],
    'FAE': [0x1e, ['unsigned short']],
    'Tx1Col': [0x20, ['unsigned int']],
    'TxMCol': [0x24, ['unsigned int']],
    'RxOkPhy': [0x28, ['unsigned long']],
    'RxOkBrd': [0x30, ['unsigned long']],
    'RxOkMul': [0x38, ['unsigned int']],
    'TxAbt': [0x3c, ['unsigned short']],
    'TxUndrn': [0x3e, ['unsigned short']],
}],
  'TAPState': [ 0x11628, {
    'nc': [0x0, ['NetClientState']],
    'fd': [0x170, ['int']],
    'down_script': [0x174, ['array', 1024, ['char']]],
    'down_script_arg': [0x574, ['array', 128, ['char']]],
    'buf': [0x5f4, ['array', 69632, ['unsigned char']]],
    'read_poll': [0x115f4, ['unsigned char']],
    'write_poll': [0x115f5, ['unsigned char']],
    'using_vnet_hdr': [0x115f6, ['unsigned char']],
    'has_ufo': [0x115f7, ['unsigned char']],
    'enabled': [0x115f8, ['unsigned char']],
    'vhost_net': [0x11600, ['pointer', ['vhost_net']]],
    'host_vnet_hdr_len': [0x11608, ['unsigned int']],
    'exit': [0x11610, ['Notifier']],
}],
  'SpiceKbdInstance': [ 0x10, {
    'base': [0x0, ['SpiceBaseInstance']],
    'st': [0x8, ['pointer', ['SpiceKbdState']]],
}],
  'QIOChannel': [ 0x38, {
    'parent': [0x0, ['Object']],
    'features': [0x28, ['unsigned int']],
    'name': [0x30, ['pointer', ['char']]],
}],
  'USBDescOther': [ 0x10, {
    'length': [0x0, ['unsigned char']],
    'data': [0x8, ['pointer', ['unsigned char']]],
}],
  'strList': [ 0x10, {
    'next': [0x0, ['pointer', ['strList']]],
    'value': [0x8, ['pointer', ['char']]],
}],
  'RngEgd': [ 0x78, {
    'parent': [0x0, ['RngBackend']],
    'chr': [0x40, ['CharBackend']],
    'chr_name': [0x70, ['pointer', ['char']]],
}],
  'BlockStats': [ 0x48, {
    'has_device': [0x0, ['unsigned char']],
    'device': [0x8, ['pointer', ['char']]],
    'has_node_name': [0x10, ['unsigned char']],
    'node_name': [0x18, ['pointer', ['char']]],
    'stats': [0x20, ['pointer', ['BlockDeviceStats']]],
    'has_parent': [0x28, ['unsigned char']],
    'parent': [0x30, ['pointer', ['BlockStats']]],
    'has_backing': [0x38, ['unsigned char']],
    'backing': [0x40, ['pointer', ['BlockStats']]],
}],
  'blkif_x86_32_back_ring': [ 0x18, {
    'rsp_prod_pvt': [0x0, ['unsigned int']],
    'req_cons': [0x4, ['unsigned int']],
    'nr_ents': [0x8, ['unsigned int']],
    'sring': [0x10, ['pointer', ['blkif_x86_32_sring']]],
}],
  'XilinxSPIPS': [ 0x660, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'mmlqspi': [0x400, ['MemoryRegion']],
    'irq': [0x500, ['pointer', ['IRQState']]],
    'irqline': [0x508, ['int']],
    'num_cs': [0x50c, ['unsigned char']],
    'num_busses': [0x50d, ['unsigned char']],
    'snoop_state': [0x50e, ['unsigned char']],
    'cs_lines': [0x510, ['pointer', ['pointer', ['IRQState']]]],
    'spi': [0x518, ['pointer', ['pointer', ['SSIBus']]]],
    'rx_fifo': [0x520, ['__unnamed_0x20ed']],
    'tx_fifo': [0x538, ['__unnamed_0x20ed']],
    'num_txrx_bytes': [0x550, ['unsigned char']],
    'regs': [0x554, ['array', 64, ['unsigned int']]],
}],
  'MonFdsetFd': [ 0x20, {
    'fd': [0x0, ['int']],
    'removed': [0x4, ['unsigned char']],
    'opaque': [0x8, ['pointer', ['char']]],
    'next': [0x10, ['__unnamed_0x8b9f']],
}],
  'omap_target_agent_s': [ 0x130, {
    'iomem': [0x0, ['MemoryRegion']],
    'bus': [0x100, ['pointer', ['omap_l4_s']]],
    'regions': [0x108, ['int']],
    'start': [0x110, ['pointer', ['omap_l4_region_s']]],
    'base': [0x118, ['unsigned long']],
    'component': [0x120, ['unsigned int']],
    'control': [0x124, ['unsigned int']],
    'status': [0x128, ['unsigned int']],
}],
  '_Vector_impl': [ 0x18, {
    '_M_start': [0x0, ['pointer', ['long']]],
    '_M_finish': [0x8, ['pointer', ['long']]],
    '_M_end_of_storage': [0x10, ['pointer', ['long']]],
}],
  'smbios_30_entry_point': [ 0x18, {
    'anchor_string': [0x0, ['array', 5, ['unsigned char']]],
    'checksum': [0x5, ['unsigned char']],
    'length': [0x6, ['unsigned char']],
    'smbios_major_version': [0x7, ['unsigned char']],
    'smbios_minor_version': [0x8, ['unsigned char']],
    'smbios_doc_rev': [0x9, ['unsigned char']],
    'entry_point_revision': [0xa, ['unsigned char']],
    'reserved': [0xb, ['unsigned char']],
    'structure_table_max_size': [0xc, ['unsigned int']],
    'structure_table_address': [0x10, ['unsigned long']],
}],
  'VncInfo2List': [ 0x10, {
    'next': [0x0, ['pointer', ['VncInfo2List']]],
    'value': [0x8, ['pointer', ['VncInfo2']]],
}],
  'QXLDrawable': [ 0xbf, {
    'release_info': [0x0, ['QXLReleaseInfo']],
    'surface_id': [0x8, ['unsigned int']],
    'effect': [0xc, ['unsigned char']],
    'type': [0xd, ['unsigned char']],
    'self_bitmap': [0xe, ['unsigned char']],
    'self_bitmap_area': [0xf, ['QXLRect']],
    'bbox': [0x1f, ['QXLRect']],
    'clip': [0x2f, ['QXLClip']],
    'mm_time': [0x3b, ['unsigned int']],
    'surfaces_dest': [0x3f, ['array', 3, ['int']]],
    'surfaces_rects': [0x4b, ['array', 3, ['QXLRect']]],
    'u': [0x7b, ['__unnamed_0x1bff']],
}],
  'virtio_gpu_set_scanout': [ 0x30, {
    'hdr': [0x0, ['virtio_gpu_ctrl_hdr']],
    'r': [0x18, ['virtio_gpu_rect']],
    'scanout_id': [0x28, ['unsigned int']],
    'resource_id': [0x2c, ['unsigned int']],
}],
  'BDRVQcow2State': [ 0x190, {
    'cluster_bits': [0x0, ['int']],
    'cluster_size': [0x4, ['int']],
    'cluster_sectors': [0x8, ['int']],
    'l2_bits': [0xc, ['int']],
    'l2_size': [0x10, ['int']],
    'l1_size': [0x14, ['int']],
    'l1_vm_state_index': [0x18, ['int']],
    'refcount_block_bits': [0x1c, ['int']],
    'refcount_block_size': [0x20, ['int']],
    'csize_shift': [0x24, ['int']],
    'csize_mask': [0x28, ['int']],
    'cluster_offset_mask': [0x30, ['unsigned long']],
    'l1_table_offset': [0x38, ['unsigned long']],
    'l1_table': [0x40, ['pointer', ['unsigned long']]],
    'l2_table_cache': [0x48, ['pointer', ['Qcow2Cache']]],
    'refcount_block_cache': [0x50, ['pointer', ['Qcow2Cache']]],
    'cache_clean_timer': [0x58, ['pointer', ['QEMUTimer']]],
    'cache_clean_interval': [0x60, ['unsigned int']],
    'cluster_cache': [0x68, ['pointer', ['unsigned char']]],
    'cluster_data': [0x70, ['pointer', ['unsigned char']]],
    'cluster_cache_offset': [0x78, ['unsigned long']],
    'cluster_allocs': [0x80, ['QCowClusterAlloc']],
    'refcount_table': [0x88, ['pointer', ['unsigned long']]],
    'refcount_table_offset': [0x90, ['unsigned long']],
    'refcount_table_size': [0x98, ['unsigned int']],
    'free_cluster_index': [0xa0, ['unsigned long']],
    'free_byte_offset': [0xa8, ['unsigned long']],
    'lock': [0xb0, ['CoMutex']],
    'cipher': [0xd0, ['pointer', ['QCryptoCipher']]],
    'crypt_method_header': [0xd8, ['unsigned int']],
    'snapshots_offset': [0xe0, ['unsigned long']],
    'snapshots_size': [0xe8, ['int']],
    'nb_snapshots': [0xec, ['unsigned int']],
    'snapshots': [0xf0, ['pointer', ['QCowSnapshot']]],
    'flags': [0xf8, ['int']],
    'qcow_version': [0xfc, ['int']],
    'use_lazy_refcounts': [0x100, ['unsigned char']],
    'refcount_order': [0x104, ['int']],
    'refcount_bits': [0x108, ['int']],
    'refcount_max': [0x110, ['unsigned long']],
    'get_refcount': [0x118, ['pointer', ['void']]],
    'set_refcount': [0x120, ['pointer', ['void']]],
    'discard_passthrough': [0x128, ['array', 5, ['unsigned char']]],
    'overlap_check': [0x130, ['int']],
    'signaled_corruption': [0x134, ['unsigned char']],
    'incompatible_features': [0x138, ['unsigned long']],
    'compatible_features': [0x140, ['unsigned long']],
    'autoclear_features': [0x148, ['unsigned long']],
    'unknown_header_fields_size': [0x150, ['unsigned long']],
    'unknown_header_fields': [0x158, ['pointer', ['void']]],
    'unknown_header_ext': [0x160, ['__unnamed_0x3a34']],
    'discards': [0x168, ['__unnamed_0x3a4b']],
    'cache_discards': [0x178, ['unsigned char']],
    'image_backing_file': [0x180, ['pointer', ['char']]],
    'image_backing_format': [0x188, ['pointer', ['char']]],
}],
  'PageDescriptor': [ 0x18, {
    'offset': [0x0, ['unsigned long']],
    'size': [0x8, ['unsigned int']],
    'flags': [0xc, ['unsigned int']],
    'page_flags': [0x10, ['unsigned long']],
}],
  'audio_callback': [ 0x10, {
    'opaque': [0x0, ['pointer', ['void']]],
    'fn': [0x8, ['pointer', ['void']]],
}],
  'prefixinfo': [ 0x1e, {
    'prefix_length': [0x0, ['unsigned char']],
    'A': [0x1, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'L': [0x1, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'reserved1': [0x1, ['BitField', {'end_bit': 6, 'start_bit': 0}]],
    'valid_lt': [0x2, ['unsigned int']],
    'pref_lt': [0x6, ['unsigned int']],
    'reserved2': [0xa, ['unsigned int']],
    'prefix': [0xe, ['in6_addr']],
}],
  'UnmapCBData': [ 0x18, {
    'r': [0x0, ['pointer', ['SCSIDiskReq']]],
    'inbuf': [0x8, ['pointer', ['unsigned char']]],
    'count': [0x10, ['int']],
}],
  'SmallVectorStorage<llvm::sys::MemoryBlock, 16u': [ 0xf0, {
    'InlineElts': [0x0, ['array', 15, ['AlignedCharArrayUnion<llvm::sys::MemoryBlock, char, char, char, char, char, char']]],
}],
  '__unnamed_0xb50': [ 0x8, {
    'sqe_next': [0x0, ['pointer', ['Coroutine']]],
}],
  'CCID_Header': [ 0x7, {
    'bMessageType': [0x0, ['unsigned char']],
    'dwLength': [0x1, ['unsigned int']],
    'bSlot': [0x5, ['unsigned char']],
    'bSeq': [0x6, ['unsigned char']],
}],
  '__is_normal_iterator<llvm::Type**': [ 0x1, {
}],
  'iterator<std::bidirectional_iterator_tag, const llvm::Argument, long int, const llvm::Argument*, const llvm::Argument&': [ 0x1, {
}],
  'vfio_iommu_type1_dma_unmap': [ 0x18, {
    'argsz': [0x0, ['unsigned int']],
    'flags': [0x4, ['unsigned int']],
    'iova': [0x8, ['unsigned long long']],
    'size': [0x10, ['unsigned long long']],
}],
  'HDGeometry': [ 0xc, {
    'heads': [0x0, ['unsigned int']],
    'sectors': [0x4, ['unsigned int']],
    'cylinders': [0x8, ['unsigned int']],
}],
  'IsaDma': [ 0x28, {
    'parent': [0x0, ['Object']],
}],
  'VFIOPlatformDevice': [ 0x3b8, {
    'sbdev': [0x0, ['SysBusDevice']],
    'vbasedev': [0x300, ['VFIODevice']],
    'regions': [0x350, ['pointer', ['pointer', ['VFIORegion']]]],
    'intp_list': [0x358, ['__unnamed_0x2c03']],
    'pending_intp_queue': [0x360, ['pending_intp_queue']],
    'compat': [0x370, ['pointer', ['char']]],
    'mmap_timeout': [0x378, ['unsigned int']],
    'mmap_timer': [0x380, ['pointer', ['QEMUTimer']]],
    'intp_mutex': [0x388, ['QemuMutex']],
    'irqfd_allowed': [0x3b0, ['unsigned char']],
}],
  'new_allocator<llvm::SourceMgr::SrcBuffer': [ 0x1, {
}],
  'isa_impl_cl<llvm::Instruction, const llvm::Value*': [ 0x1, {
}],
  'virtio_crypto_config': [ 0x38, {
    'status': [0x0, ['unsigned int']],
    'max_dataqueues': [0x4, ['unsigned int']],
    'crypto_services': [0x8, ['unsigned int']],
    'cipher_algo_l': [0xc, ['unsigned int']],
    'cipher_algo_h': [0x10, ['unsigned int']],
    'hash_algo': [0x14, ['unsigned int']],
    'mac_algo_l': [0x18, ['unsigned int']],
    'mac_algo_h': [0x1c, ['unsigned int']],
    'aead_algo': [0x20, ['unsigned int']],
    'max_cipher_key_len': [0x24, ['unsigned int']],
    'max_auth_key_len': [0x28, ['unsigned int']],
    'reserve': [0x2c, ['unsigned int']],
    'max_size': [0x30, ['unsigned long']],
}],
  '__unnamed_0x18c8': [ 0x8, {
    'qcow2': [0x0, ['q_obj_ImageInfoSpecificQCow2_wrapper']],
    'vmdk': [0x0, ['q_obj_ImageInfoSpecificVmdk_wrapper']],
    'luks': [0x0, ['q_obj_QCryptoBlockInfoLUKS_wrapper']],
}],
  'eth_ip6_hdr_info_st': [ 0x60, {
    'l4proto': [0x0, ['unsigned char']],
    'full_hdr_len': [0x8, ['unsigned long']],
    'ip6_hdr': [0x10, ['ip6_header']],
    'has_ext_hdrs': [0x38, ['unsigned char']],
    'rss_ex_src_valid': [0x39, ['unsigned char']],
    'rss_ex_src': [0x3a, ['in6_address']],
    'rss_ex_dst_valid': [0x4a, ['unsigned char']],
    'rss_ex_dst': [0x4b, ['in6_address']],
    'fragment': [0x5b, ['unsigned char']],
}],
  '__unnamed_0x77a': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['qemu_acl_entry']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['qemu_acl_entry']]]],
}],
  'ImageCheck': [ 0xa8, {
    'filename': [0x0, ['pointer', ['char']]],
    'format': [0x8, ['pointer', ['char']]],
    'check_errors': [0x10, ['long']],
    'has_image_end_offset': [0x18, ['unsigned char']],
    'image_end_offset': [0x20, ['long']],
    'has_corruptions': [0x28, ['unsigned char']],
    'corruptions': [0x30, ['long']],
    'has_leaks': [0x38, ['unsigned char']],
    'leaks': [0x40, ['long']],
    'has_corruptions_fixed': [0x48, ['unsigned char']],
    'corruptions_fixed': [0x50, ['long']],
    'has_leaks_fixed': [0x58, ['unsigned char']],
    'leaks_fixed': [0x60, ['long']],
    'has_total_clusters': [0x68, ['unsigned char']],
    'total_clusters': [0x70, ['long']],
    'has_allocated_clusters': [0x78, ['unsigned char']],
    'allocated_clusters': [0x80, ['long']],
    'has_fragmented_clusters': [0x88, ['unsigned char']],
    'fragmented_clusters': [0x90, ['long']],
    'has_compressed_clusters': [0x98, ['unsigned char']],
    'compressed_clusters': [0xa0, ['long']],
}],
  'TpmTypeList': [ 0x10, {
    'next': [0x0, ['pointer', ['TpmTypeList']]],
    'value': [0x8, ['Enumeration', {'target': 'int', 'choices': {0: 'TPM_TYPE_PASSTHROUGH', 1: 'TPM_TYPE__MAX'}}]],
}],
  'virtio_crypto_aead_create_session_req': [ 0x38, {
    'para': [0x0, ['virtio_crypto_aead_session_para']],
    'padding': [0x18, ['array', 32, ['unsigned char']]],
}],
  'NBDServerData': [ 0x18, {
    'listen_ioc': [0x0, ['pointer', ['QIOChannelSocket']]],
    'watch': [0x8, ['int']],
    'tlscreds': [0x10, ['pointer', ['QCryptoTLSCreds']]],
}],
  'q_obj_Abort_wrapper': [ 0x8, {
    'data': [0x0, ['pointer', ['Abort']]],
}],
  'CubieBoardState': [ 0x110, {
    'a10': [0x0, ['pointer', ['AwA10State']]],
    'sdram': [0x10, ['MemoryRegion']],
}],
  'RockerOfDpaFlowKey': [ 0x50, {
    'priority': [0x0, ['unsigned int']],
    'tbl_id': [0x4, ['unsigned int']],
    'has_in_pport': [0x8, ['unsigned char']],
    'in_pport': [0xc, ['unsigned int']],
    'has_tunnel_id': [0x10, ['unsigned char']],
    'tunnel_id': [0x14, ['unsigned int']],
    'has_vlan_id': [0x18, ['unsigned char']],
    'vlan_id': [0x1a, ['unsigned short']],
    'has_eth_type': [0x1c, ['unsigned char']],
    'eth_type': [0x1e, ['unsigned short']],
    'has_eth_src': [0x20, ['unsigned char']],
    'eth_src': [0x28, ['pointer', ['char']]],
    'has_eth_dst': [0x30, ['unsigned char']],
    'eth_dst': [0x38, ['pointer', ['char']]],
    'has_ip_proto': [0x40, ['unsigned char']],
    'ip_proto': [0x41, ['unsigned char']],
    'has_ip_tos': [0x42, ['unsigned char']],
    'ip_tos': [0x43, ['unsigned char']],
    'has_ip_dst': [0x44, ['unsigned char']],
    'ip_dst': [0x48, ['pointer', ['char']]],
}],
  'TrimAIOCB': [ 0x58, {
    'common': [0x0, ['BlockAIOCB']],
    'blk': [0x28, ['pointer', ['BlockBackend']]],
    'bh': [0x30, ['pointer', ['QEMUBH']]],
    'ret': [0x38, ['int']],
    'qiov': [0x40, ['pointer', ['QEMUIOVector']]],
    'aiocb': [0x48, ['pointer', ['BlockAIOCB']]],
    'i': [0x50, ['int']],
    'j': [0x54, ['int']],
}],
  '__unnamed_0x569e': [ 0x10, {
    'le_next': [0x0, ['pointer', ['numa_addr_range']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['numa_addr_range']]]],
}],
  'vhost_msg': [ 0x48, {
    'type': [0x0, ['int']],
    '__unnamed_0xeff': [0x8, ['__unnamed_0xeb8']],
}],
  'out_req_list': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['NvmeRequest']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['NvmeRequest']]]],
}],
  'oss_params': [ 0x14, {
    'freq': [0x0, ['int']],
    'fmt': [0x4, ['Enumeration', {'target': 'int', 'choices': {0: 'AUD_FMT_U8', 1: 'AUD_FMT_S8', 2: 'AUD_FMT_U16', 3: 'AUD_FMT_S16', 4: 'AUD_FMT_U32', 5: 'AUD_FMT_S32'}}]],
    'nchannels': [0x8, ['int']],
    'nfrags': [0xc, ['int']],
    'fragsize': [0x10, ['int']],
}],
  'q_obj_netdev_del_arg': [ 0x8, {
    'id': [0x0, ['pointer', ['char']]],
}],
  '__unnamed_0x1a3': [ 0x80, {
    '__val': [0x0, ['array', 16, ['unsigned long']]],
}],
  'virtio_crypto_mac_para': [ 0x8, {
    'hash': [0x0, ['virtio_crypto_hash_para']],
}],
  'AcpiMadtGenericRedistributor': [ 0x10, {
    'type': [0x0, ['unsigned char']],
    'length': [0x1, ['unsigned char']],
    'reserved': [0x2, ['unsigned short']],
    'base_address': [0x4, ['unsigned long']],
    'range_length': [0xc, ['unsigned int']],
}],
  'virtio_crypto_alg_chain_data_req': [ 0x28, {
    'para': [0x0, ['virtio_crypto_alg_chain_data_para']],
}],
  '__unnamed_0x4764': [ 0x4, {
    'tapif_user': [0x0, ['__unnamed_0x474f']],
    'netif': [0x0, ['__unnamed_0x473a']],
    'pvt_pad': [0x0, ['array', 4, ['unsigned char']]],
}],
  '_Alloc_hider': [ 0x8, {
    '_M_p': [0x0, ['pointer', ['char']]],
}],
  'VncSurface': [ 0x45820, {
    'last_freq_check': [0x0, ['timeval']],
    'dirty': [0x10, ['array', 3, ['array', 2048, ['unsigned long']]]],
    'stats': [0xc010, ['array', 40, ['array', 32, ['VncRectStat']]]],
    'fb': [0x45810, ['pointer', ['pixman_image']]],
    'format': [0x45818, ['Enumeration', {'target': 'int', 'choices': {67371008: 'PIXMAN_c4', 134545408: 'PIXMAN_g8', 537004714: 'PIXMAN_x2r10g10b10', 537495688: 'PIXMAN_r8g8b8a8', 67190784: 'PIXMAN_a4', 268567909: 'PIXMAN_r5g6b5', 402851976: 'PIXMAN_b8g8r8', 537462920: 'PIXMAN_r8g8b8x8', 17104896: 'PIXMAN_g1', 67244305: 'PIXMAN_a1r1g1b1', 537069704: 'PIXMAN_x8b8g8r8', 268633156: 'PIXMAN_x4b4g4r4', 134479872: 'PIXMAN_c8', 268649540: 'PIXMAN_a4b4g4r4', 67240225: 'PIXMAN_r1g2b1', 134357538: 'PIXMAN_a2r2g2b2', 537397384: 'PIXMAN_b8g8r8x8', 268571989: 'PIXMAN_a1r5g5b5', 268828672: 'PIXMAN_yuy2', 537078442: 'PIXMAN_a2b10g10r10', 537561224: 'PIXMAN_a8r8g8b8_sRGB', 134415154: 'PIXMAN_b2g3r3', 402786440: 'PIXMAN_r8g8b8', 134349618: 'PIXMAN_r3g3b2', 537430152: 'PIXMAN_b8g8r8a8', 537004168: 'PIXMAN_x8r8g8b8', 268567893: 'PIXMAN_x1r5g5b5', 268567620: 'PIXMAN_x4r4g4b4', 537036936: 'PIXMAN_a8r8g8b8', 67305761: 'PIXMAN_b1g2r1', 134423074: 'PIXMAN_a2b2g2r2', 537102472: 'PIXMAN_a8b8g8r8', 268633429: 'PIXMAN_x1b5g5r5', 67436544: 'PIXMAN_g4', 16846848: 'PIXMAN_a1', 268633445: 'PIXMAN_b5g6r5', 537003622: 'PIXMAN_x14r6g6b6', 67309841: 'PIXMAN_a1b1g1r1', 201785344: 'PIXMAN_yv12', 537012906: 'PIXMAN_a2r10g10b10', 134299648: 'PIXMAN_x4a4', 268584004: 'PIXMAN_a4r4g4b4', 134316032: 'PIXMAN_a8', 537070250: 'PIXMAN_x2b10g10r10', 268637525: 'PIXMAN_a1b5g5r5'}}]],
}],
  'QXLPoint': [ 0x8, {
    'x': [0x0, ['int']],
    'y': [0x4, ['int']],
}],
  'OptsFromQDictState': [ 0x10, {
    'opts': [0x0, ['pointer', ['QemuOpts']]],
    'errp': [0x8, ['pointer', ['pointer', ['Error']]]],
}],
  'BlkMigBlock': [ 0x60, {
    'buf': [0x0, ['pointer', ['unsigned char']]],
    'bmds': [0x8, ['pointer', ['BlkMigDevState']]],
    'sector': [0x10, ['long']],
    'nr_sectors': [0x18, ['int']],
    'iov': [0x20, ['iovec']],
    'qiov': [0x30, ['QEMUIOVector']],
    'aiocb': [0x48, ['pointer', ['BlockAIOCB']]],
    'ret': [0x50, ['int']],
    'entry': [0x58, ['__unnamed_0x35f6']],
}],
  'slirp_config_str': [ 0x410, {
    'next': [0x0, ['pointer', ['slirp_config_str']]],
    'flags': [0x8, ['int']],
    'str': [0xc, ['array', 1024, ['char']]],
    'legacy_format': [0x40c, ['int']],
}],
  '__unnamed_0x142b': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['BusState']]],
}],
  'Exynos4210MCTState': [ 0x590, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'reg_mct_cfg': [0x400, ['unsigned int']],
    'l_timer': [0x408, ['array', 2, ['__unnamed_0x2a5b']]],
    'g_timer': [0x4f8, ['__unnamed_0x2917']],
    'freq': [0x580, ['unsigned int']],
}],
  'QuorumCo': [ 0x10, {
    'acb': [0x0, ['pointer', ['QuorumAIOCB']]],
    'idx': [0x8, ['int']],
}],
  'USBBus': [ 0xb0, {
    'qbus': [0x0, ['BusState']],
    'ops': [0x68, ['pointer', ['USBBusOps']]],
    'busnr': [0x70, ['int']],
    'nfree': [0x74, ['int']],
    'nused': [0x78, ['int']],
    'free': [0x80, ['Enumeration', {'target': 'int', 'choices': {0: 'IOMMU_NONE', 1: 'IOMMU_RO', 2: 'IOMMU_WO', 3: 'IOMMU_RW'}}]],
    'used': [0x90, ['__unnamed_0x1441']],
    'next': [0xa0, ['__unnamed_0x1465']],
}],
  'less<std::__cxx11::basic_string<char, std::char_traits<char': [ 0x1, {
}],
  '__unnamed_0xafca': [ 0x8, {
    'bridge': [0x0, ['q_obj_NetdevBridgeOptions_wrapper']],
    'none': [0x0, ['q_obj_NetdevNoneOptions_wrapper']],
    'tap': [0x0, ['q_obj_NetdevTapOptions_wrapper']],
    'socket': [0x0, ['q_obj_NetdevSocketOptions_wrapper']],
    'dump': [0x0, ['q_obj_NetdevDumpOptions_wrapper']],
    'vhost_user': [0x0, ['q_obj_NetdevVhostUserOptions_wrapper']],
    'nic': [0x0, ['q_obj_NetLegacyNicOptions_wrapper']],
    'netmap': [0x0, ['q_obj_NetdevNetmapOptions_wrapper']],
    'vde': [0x0, ['q_obj_NetdevVdeOptions_wrapper']],
    'user': [0x0, ['q_obj_NetdevUserOptions_wrapper']],
    'l2tpv3': [0x0, ['q_obj_NetdevL2TPv3Options_wrapper']],
}],
  'VirtIOInputPCI': [ 0x8540, {
    'parent_obj': [0x0, ['VirtIOPCIProxy']],
    'vdev': [0x8410, ['VirtIOInput']],
}],
  '__unnamed_0x36e8': [ 0x12, {
    'fat16': [0x0, ['__unnamed_0x362b']],
    'fat32': [0x0, ['__unnamed_0x367f']],
}],
  '__unnamed_0xc89': [ 0x8, {
    'sle_next': [0x0, ['pointer', ['QStackEntry']]],
}],
  'mmsghdr': [ 0x40, {
    'msg_hdr': [0x0, ['msghdr']],
    'msg_len': [0x38, ['unsigned int']],
}],
  'q_obj_cpu_add_arg': [ 0x8, {
    'id': [0x0, ['long']],
}],
  'XenDevOps': [ 0x60, {
    'size': [0x0, ['unsigned long']],
    'flags': [0x8, ['unsigned int']],
    'alloc': [0x10, ['pointer', ['void']]],
    'init': [0x18, ['pointer', ['void']]],
    'initialise': [0x20, ['pointer', ['void']]],
    'connected': [0x28, ['pointer', ['void']]],
    'event': [0x30, ['pointer', ['void']]],
    'disconnect': [0x38, ['pointer', ['void']]],
    'free': [0x40, ['pointer', ['void']]],
    'backend_changed': [0x48, ['pointer', ['void']]],
    'frontend_changed': [0x50, ['pointer', ['void']]],
    'backend_register': [0x58, ['pointer', ['void']]],
}],
  '__unnamed_0x36eb': [ 0x4, {
    'fields': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'IOMMU_NOTIFIER_NONE', 1: 'IOMMU_NOTIFIER_UNMAP', 2: 'IOMMU_NOTIFIER_MAP'}}]],
    'data': [0x0, ['unsigned int']],
}],
  'libusb_control_setup': [ 0x8, {
    'bmRequestType': [0x0, ['unsigned char']],
    'bRequest': [0x1, ['unsigned char']],
    'wValue': [0x2, ['unsigned short']],
    'wIndex': [0x4, ['unsigned short']],
    'wLength': [0x6, ['unsigned short']],
}],
  'CryptoDevBackendSymOpInfo': [ 0x58, {
    'session_id': [0x0, ['unsigned long']],
    'aad_len': [0x8, ['unsigned int']],
    'iv_len': [0xc, ['unsigned int']],
    'src_len': [0x10, ['unsigned int']],
    'dst_len': [0x14, ['unsigned int']],
    'digest_result_len': [0x18, ['unsigned int']],
    'hash_start_src_offset': [0x1c, ['unsigned int']],
    'cipher_start_src_offset': [0x20, ['unsigned int']],
    'len_to_hash': [0x24, ['unsigned int']],
    'len_to_cipher': [0x28, ['unsigned int']],
    'op_type': [0x2c, ['unsigned char']],
    'iv': [0x30, ['pointer', ['unsigned char']]],
    'src': [0x38, ['pointer', ['unsigned char']]],
    'dst': [0x40, ['pointer', ['unsigned char']]],
    'aad_data': [0x48, ['pointer', ['unsigned char']]],
    'digest_result': [0x50, ['pointer', ['unsigned char']]],
    'data': [0x58, ['array', 0, ['unsigned char']]],
}],
  'VncServerInfo': [ 0x20, {
    'host': [0x0, ['pointer', ['char']]],
    'service': [0x8, ['pointer', ['char']]],
    'family': [0x10, ['Enumeration', {'target': 'int', 'choices': {0: 'NETWORK_ADDRESS_FAMILY_IPV4', 1: 'NETWORK_ADDRESS_FAMILY_IPV6', 2: 'NETWORK_ADDRESS_FAMILY_UNIX', 3: 'NETWORK_ADDRESS_FAMILY_VSOCK', 4: 'NETWORK_ADDRESS_FAMILY_UNKNOWN', 5: 'NETWORK_ADDRESS_FAMILY__MAX'}}]],
    'websocket': [0x14, ['unsigned char']],
    'has_auth': [0x15, ['unsigned char']],
    'auth': [0x18, ['pointer', ['char']]],
}],
  '__unnamed_0xe57': [ 0xc, {
    'ih_src': [0x0, ['in_addr']],
    'ih_dst': [0x4, ['in_addr']],
    'ih_x1': [0x8, ['unsigned char']],
    'ih_pr': [0x9, ['unsigned char']],
}],
  'q_obj_unload_plugin_arg': [ 0x8, {
    'index': [0x0, ['long']],
}],
  'virtio_crypto_mac_session_para': [ 0x10, {
    'algo': [0x0, ['unsigned int']],
    'hash_result_len': [0x4, ['unsigned int']],
    'auth_key_len': [0x8, ['unsigned int']],
    'padding': [0xc, ['unsigned int']],
}],
  '__unnamed_0x1736': [ 0x10, {
    'color': [0x0, ['unsigned int']],
    'pattern': [0x0, ['QXLPattern']],
}],
  'XenDevice': [ 0x510, {
    'qdev': [0x0, ['DeviceState']],
    'type': [0x70, ['pointer', ['char']]],
    'dom': [0x78, ['int']],
    'dev': [0x7c, ['int']],
    'name': [0x80, ['array', 64, ['char']]],
    'debug': [0xc0, ['int']],
    'be_state': [0xc4, ['Enumeration', {'target': 'int', 'choices': {0: 'XenbusStateUnknown', 1: 'XenbusStateInitialising', 2: 'XenbusStateInitWait', 3: 'XenbusStateInitialised', 4: 'XenbusStateConnected', 5: 'XenbusStateClosing', 6: 'XenbusStateClosed', 7: 'XenbusStateReconfiguring', 8: 'XenbusStateReconfigured'}}]],
    'fe_state': [0xc8, ['Enumeration', {'target': 'int', 'choices': {0: 'XenbusStateUnknown', 1: 'XenbusStateInitialising', 2: 'XenbusStateInitWait', 3: 'XenbusStateInitialised', 4: 'XenbusStateConnected', 5: 'XenbusStateClosing', 6: 'XenbusStateClosed', 7: 'XenbusStateReconfiguring', 8: 'XenbusStateReconfigured'}}]],
    'online': [0xcc, ['int']],
    'be': [0xd0, ['array', 1024, ['char']]],
    'fe': [0x4d0, ['pointer', ['char']]],
    'protocol': [0x4d8, ['pointer', ['char']]],
    'remote_port': [0x4e0, ['int']],
    'local_port': [0x4e4, ['int']],
    'evtchndev': [0x4e8, ['pointer', ['xc_interface_core']]],
    'gnttabdev': [0x4f0, ['pointer', ['xc_interface_core']]],
    'ops': [0x4f8, ['pointer', ['XenDevOps']]],
    'next': [0x500, ['__unnamed_0x231b']],
}],
  '_XkbClientMapRec': [ 0x30, {
    'size_types': [0x0, ['unsigned char']],
    'num_types': [0x1, ['unsigned char']],
    'types': [0x8, ['pointer', ['_XkbKeyType']]],
    'size_syms': [0x10, ['unsigned short']],
    'num_syms': [0x12, ['unsigned short']],
    'syms': [0x18, ['pointer', ['unsigned long']]],
    'key_sym_map': [0x20, ['pointer', ['_XkbSymMapRec']]],
    'modmap': [0x28, ['pointer', ['unsigned char']]],
}],
  '_XkbCompatMapRec': [ 0x20, {
    'sym_interpret': [0x0, ['pointer', ['_XkbSymInterpretRec']]],
    'groups': [0x8, ['array', 4, ['_XkbMods']]],
    'num_si': [0x18, ['unsigned short']],
    'size_si': [0x1a, ['unsigned short']],
}],
  '__unnamed_0x1423': [ 0x10, {
    'le_next': [0x0, ['pointer', ['DisplayChangeListener']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['DisplayChangeListener']]]],
}],
  'BMDMAState': [ 0x290, {
    'dma': [0x0, ['IDEDMA']],
    'cmd': [0x38, ['unsigned char']],
    'status': [0x39, ['unsigned char']],
    'addr': [0x3c, ['unsigned int']],
    'bus': [0x40, ['pointer', ['IDEBus']]],
    'cur_addr': [0x48, ['unsigned int']],
    'cur_prd_last': [0x4c, ['unsigned int']],
    'cur_prd_addr': [0x50, ['unsigned int']],
    'cur_prd_len': [0x54, ['unsigned int']],
    'dma_cb': [0x58, ['pointer', ['void']]],
    'addr_ioport': [0x60, ['MemoryRegion']],
    'extra_io': [0x160, ['MemoryRegion']],
    'irq': [0x260, ['pointer', ['IRQState']]],
    'migration_compat_status': [0x268, ['unsigned char']],
    'migration_retry_unit': [0x269, ['unsigned char']],
    'migration_retry_sector_num': [0x270, ['long']],
    'migration_retry_nsector': [0x278, ['unsigned int']],
    'pci_dev': [0x280, ['pointer', ['PCIIDEState']]],
}],
  'ifreq': [ 0x28, {
    'ifr_ifrn': [0x0, ['__unnamed_0x928']],
    'ifr_ifru': [0x10, ['__unnamed_0x94c']],
}],
  'q_obj_ChardevCommon_wrapper': [ 0x8, {
    'data': [0x0, ['pointer', ['ChardevCommon']]],
}],
  'mfi_ld_progress': [ 0x24, {
    'active': [0x0, ['unsigned int']],
    'cc': [0x4, ['mfi_progress']],
    'bgi': [0x8, ['mfi_progress']],
    'fgi': [0xc, ['mfi_progress']],
    'recon': [0x10, ['mfi_progress']],
    'reserved': [0x14, ['array', 4, ['mfi_progress']]],
}],
  'NotifierThreadData': [ 0x8, {
    'list': [0x0, ['NotifierList']],
    'ptr': [0x0, ['pointer', ['void']]],
}],
  'SaveVMHandlers': [ 0x50, {
    'set_params': [0x0, ['pointer', ['void']]],
    'save_state': [0x8, ['pointer', ['void']]],
    'cleanup': [0x10, ['pointer', ['void']]],
    'save_live_complete_postcopy': [0x18, ['pointer', ['void']]],
    'save_live_complete_precopy': [0x20, ['pointer', ['void']]],
    'is_active': [0x28, ['pointer', ['void']]],
    'save_live_iterate': [0x30, ['pointer', ['void']]],
    'save_live_setup': [0x38, ['pointer', ['void']]],
    'save_live_pending': [0x40, ['pointer', ['void']]],
    'load_state': [0x48, ['pointer', ['void']]],
}],
  'VDAgentMonConfig': [ 0x14, {
    'height': [0x0, ['unsigned int']],
    'width': [0x4, ['unsigned int']],
    'depth': [0x8, ['unsigned int']],
    'x': [0xc, ['int']],
    'y': [0x10, ['int']],
}],
  'msghdr': [ 0x38, {
    'msg_name': [0x0, ['pointer', ['void']]],
    'msg_namelen': [0x8, ['unsigned int']],
    'msg_iov': [0x10, ['pointer', ['iovec']]],
    'msg_iovlen': [0x18, ['unsigned long']],
    'msg_control': [0x20, ['pointer', ['void']]],
    'msg_controllen': [0x28, ['unsigned long']],
    'msg_flags': [0x30, ['int']],
}],
  'requests': [ 0x10, {
    'sqh_first': [0x0, ['pointer', ['RngRequest']]],
    'sqh_last': [0x8, ['pointer', ['pointer', ['RngRequest']]]],
}],
  '__unnamed_0x2421': [ 0x10, {
    'le_next': [0x0, ['pointer', ['BusState']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['BusState']]]],
}],
  'usb_redir_iso_stream_status_header': [ 0x2, {
    'status': [0x0, ['unsigned char']],
    'endpoint': [0x1, ['unsigned char']],
}],
  'AcpiFadtDescriptorRev5_1': [ 0x10c, {
    'signature': [0x0, ['unsigned int']],
    'length': [0x4, ['unsigned int']],
    'revision': [0x8, ['unsigned char']],
    'checksum': [0x9, ['unsigned char']],
    'oem_id': [0xa, ['array', 6, ['unsigned char']]],
    'oem_table_id': [0x10, ['array', 8, ['unsigned char']]],
    'oem_revision': [0x18, ['unsigned int']],
    'asl_compiler_id': [0x1c, ['array', 4, ['unsigned char']]],
    'asl_compiler_revision': [0x20, ['unsigned int']],
    'firmware_ctrl': [0x24, ['unsigned int']],
    'dsdt': [0x28, ['unsigned int']],
    'model': [0x2c, ['unsigned char']],
    'reserved1': [0x2d, ['unsigned char']],
    'sci_int': [0x2e, ['unsigned short']],
    'smi_cmd': [0x30, ['unsigned int']],
    'acpi_enable': [0x34, ['unsigned char']],
    'acpi_disable': [0x35, ['unsigned char']],
    'S4bios_req': [0x36, ['unsigned char']],
    'reserved2': [0x37, ['unsigned char']],
    'pm1a_evt_blk': [0x38, ['unsigned int']],
    'pm1b_evt_blk': [0x3c, ['unsigned int']],
    'pm1a_cnt_blk': [0x40, ['unsigned int']],
    'pm1b_cnt_blk': [0x44, ['unsigned int']],
    'pm2_cnt_blk': [0x48, ['unsigned int']],
    'pm_tmr_blk': [0x4c, ['unsigned int']],
    'gpe0_blk': [0x50, ['unsigned int']],
    'gpe1_blk': [0x54, ['unsigned int']],
    'pm1_evt_len': [0x58, ['unsigned char']],
    'pm1_cnt_len': [0x59, ['unsigned char']],
    'pm2_cnt_len': [0x5a, ['unsigned char']],
    'pm_tmr_len': [0x5b, ['unsigned char']],
    'gpe0_blk_len': [0x5c, ['unsigned char']],
    'gpe1_blk_len': [0x5d, ['unsigned char']],
    'gpe1_base': [0x5e, ['unsigned char']],
    'reserved3': [0x5f, ['unsigned char']],
    'plvl2_lat': [0x60, ['unsigned short']],
    'plvl3_lat': [0x62, ['unsigned short']],
    'flush_size': [0x64, ['unsigned short']],
    'flush_stride': [0x66, ['unsigned short']],
    'duty_offset': [0x68, ['unsigned char']],
    'duty_width': [0x69, ['unsigned char']],
    'day_alrm': [0x6a, ['unsigned char']],
    'mon_alrm': [0x6b, ['unsigned char']],
    'century': [0x6c, ['unsigned char']],
    'boot_flags': [0x6d, ['unsigned short']],
    'reserved': [0x6f, ['unsigned char']],
    'flags': [0x70, ['unsigned int']],
    'reset_register': [0x74, ['AcpiGenericAddress']],
    'reset_value': [0x80, ['unsigned char']],
    'arm_boot_flags': [0x81, ['unsigned short']],
    'minor_revision': [0x83, ['unsigned char']],
    'Xfacs': [0x84, ['unsigned long']],
    'Xdsdt': [0x8c, ['unsigned long']],
    'xpm1a_event_block': [0x94, ['AcpiGenericAddress']],
    'xpm1b_event_block': [0xa0, ['AcpiGenericAddress']],
    'xpm1a_control_block': [0xac, ['AcpiGenericAddress']],
    'xpm1b_control_block': [0xb8, ['AcpiGenericAddress']],
    'xpm2_control_block': [0xc4, ['AcpiGenericAddress']],
    'xpm_timer_block': [0xd0, ['AcpiGenericAddress']],
    'xgpe0_block': [0xdc, ['AcpiGenericAddress']],
    'xgpe1_block': [0xe8, ['AcpiGenericAddress']],
    'sleep_control': [0xf4, ['AcpiGenericAddress']],
    'sleep_status': [0x100, ['AcpiGenericAddress']],
}],
  'VMStateField': [ 0x60, {
    'name': [0x0, ['pointer', ['char']]],
    'offset': [0x8, ['unsigned long']],
    'size': [0x10, ['unsigned long']],
    'start': [0x18, ['unsigned long']],
    'num': [0x20, ['int']],
    'num_offset': [0x28, ['unsigned long']],
    'size_offset': [0x30, ['unsigned long']],
    'info': [0x38, ['pointer', ['VMStateInfo']]],
    'flags': [0x40, ['Enumeration', {'target': 'int', 'choices': {2048: 'VMS_VARRAY_UINT32', 16384: 'VMS_MULTIPLY_ELEMENTS', 2: 'VMS_POINTER', 4096: 'VMS_MUST_EXIST', 8192: 'VMS_ALLOC', 1024: 'VMS_VARRAY_UINT8', 32: 'VMS_BUFFER', 8: 'VMS_STRUCT', 64: 'VMS_ARRAY_OF_POINTER', 256: 'VMS_VBUFFER', 16: 'VMS_VARRAY_INT32', 296: 'VMS_VARRAY_UINT16', 1: 'VMS_SINGLE', 512: 'VMS_MULTIPLY', 4: 'VMS_ARRAY'}}]],
    'vmsd': [0x48, ['pointer', ['VMStateDescription']]],
    'version_id': [0x50, ['int']],
    'field_exists': [0x58, ['pointer', ['void']]],
}],
  'GPEXRootState': [ 0x8f0, {
    'parent_obj': [0x0, ['PCIDevice']],
}],
  '__unnamed_0x9e5a': [ 0x348, {
    'parent': [0x0, ['VirtIODevice']],
    'conf': [0xe8, ['__unnamed_0x9e2e']],
    'vhost_vqs': [0xf8, ['array', 2, ['vhost_virtqueue']]],
    'vhost_dev': [0x1c8, ['vhost_dev']],
    'event_vq': [0x338, ['pointer', ['VirtQueue']]],
    'post_load_timer': [0x340, ['pointer', ['QEMUTimer']]],
}],
  '_XkbIndicatorMapRec': [ 0xc, {
    'flags': [0x0, ['unsigned char']],
    'which_groups': [0x1, ['unsigned char']],
    'groups': [0x2, ['unsigned char']],
    'which_mods': [0x3, ['unsigned char']],
    'mods': [0x4, ['_XkbMods']],
    'ctrls': [0x8, ['unsigned int']],
}],
  'ilist<llvm::NamedMDNode': [ 0x18, {
}],
  'ilist_default_traits<llvm::BasicBlock': [ 0x1, {
}],
  '__unnamed_0x277c': [ 0x48, {
    'type': [0x0, ['int']],
    'serial': [0x8, ['unsigned long']],
    'send_event': [0x10, ['int']],
    'display': [0x18, ['pointer', ['_XDisplay']]],
    'requestor': [0x20, ['unsigned long']],
    'selection': [0x28, ['unsigned long']],
    'target': [0x30, ['unsigned long']],
    'property': [0x38, ['unsigned long']],
    'time': [0x40, ['unsigned long']],
}],
  'virtio_crypto_ctrl_header': [ 0x10, {
    'opcode': [0x0, ['unsigned int']],
    'algo': [0x4, ['unsigned int']],
    'flag': [0x8, ['unsigned int']],
    'queue_id': [0xc, ['unsigned int']],
}],
  '__unnamed_0x299c': [ 0x20, {
    '_unused_csselr0': [0x0, ['unsigned long']],
    'csselr_ns': [0x8, ['unsigned long']],
    '_unused_csselr1': [0x10, ['unsigned long']],
    'csselr_s': [0x18, ['unsigned long']],
}],
  'node_info': [ 0x28, {
    'node_mem': [0x0, ['unsigned long']],
    'node_cpu': [0x8, ['pointer', ['unsigned long']]],
    'node_memdev': [0x10, ['pointer', ['HostMemoryBackend']]],
    'present': [0x18, ['unsigned char']],
    'addr': [0x20, ['__unnamed_0x56fc']],
}],
  'ParallelsHeader': [ 0x40, {
    'magic': [0x0, ['array', 16, ['char']]],
    'version': [0x10, ['unsigned int']],
    'heads': [0x14, ['unsigned int']],
    'cylinders': [0x18, ['unsigned int']],
    'tracks': [0x1c, ['unsigned int']],
    'bat_entries': [0x20, ['unsigned int']],
    'nb_sectors': [0x24, ['unsigned long']],
    'inuse': [0x2c, ['unsigned int']],
    'data_off': [0x30, ['unsigned int']],
    'padding': [0x34, ['array', 12, ['char']]],
}],
  'V9fsSynthNode': [ 0x150, {
    'child': [0x0, ['__unnamed_0x15b9']],
    'sibling': [0x8, ['__unnamed_0x15d4']],
    'name': [0x18, ['array', 255, ['char']]],
    'attr': [0x118, ['pointer', ['V9fsSynthNodeAttr']]],
    'actual_attr': [0x120, ['V9fsSynthNodeAttr']],
    'private': [0x140, ['pointer', ['void']]],
    'open_count': [0x148, ['int']],
}],
  'NvmeNamespace': [ 0x1000, {
    'id_ns': [0x0, ['NvmeIdNs']],
}],
  'uint8List': [ 0x10, {
    'next': [0x0, ['pointer', ['uint8List']]],
    'value': [0x8, ['unsigned char']],
}],
  'PhysPageEntry': [ 0x4, {
    'skip': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 0}]],
    'ptr': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 6}]],
}],
  '_Panda__TaintedBranch': [ 0x30, {
    'base': [0x0, ['ProtobufCMessage']],
    'call_stack': [0x18, ['pointer', ['_Panda__CallStack']]],
    'n_taint_query': [0x20, ['unsigned long']],
    'taint_query': [0x28, ['pointer', ['pointer', ['_Panda__TaintQuery']]]],
}],
  'BlockDirtyBitmap': [ 0x10, {
    'node': [0x0, ['pointer', ['char']]],
    'name': [0x8, ['pointer', ['char']]],
}],
  '__unnamed_0x2056': [ 0x10, {
    'le_next': [0x0, ['pointer', ['SWVoiceCap']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['SWVoiceCap']]]],
}],
  'PXASSPDef': [ 0x10, {
    'io_base': [0x0, ['unsigned long']],
    'irqn': [0x8, ['int']],
}],
  'RR_MapList': [ 0x30, {
    'ptr': [0x0, ['pointer', ['void']]],
    'addr': [0x8, ['unsigned long']],
    'len': [0x10, ['unsigned long']],
    'crc': [0x18, ['unsigned int']],
    'link': [0x20, ['__unnamed_0x56d2']],
}],
  '__unnamed_0x26e4': [ 0x50, {
    'type': [0x0, ['int']],
    'serial': [0x8, ['unsigned long']],
    'send_event': [0x10, ['int']],
    'display': [0x18, ['pointer', ['_XDisplay']]],
    'owner': [0x20, ['unsigned long']],
    'requestor': [0x28, ['unsigned long']],
    'selection': [0x30, ['unsigned long']],
    'target': [0x38, ['unsigned long']],
    'property': [0x40, ['unsigned long']],
    'time': [0x48, ['unsigned long']],
}],
  'FsDriverEntry_head': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['FsDriverListEntry']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['FsDriverListEntry']]]],
}],
  'q_obj_ringbuf_read_arg': [ 0x18, {
    'device': [0x0, ['pointer', ['char']]],
    'size': [0x8, ['long']],
    'has_format': [0x10, ['unsigned char']],
    'format': [0x14, ['Enumeration', {'target': 'int', 'choices': {0: 'DATA_FORMAT_UTF8', 1: 'DATA_FORMAT_BASE64', 2: 'DATA_FORMAT__MAX'}}]],
}],
  'mfi_pd_address': [ 0x18, {
    'device_id': [0x0, ['unsigned short']],
    'encl_device_id': [0x2, ['unsigned short']],
    'encl_index': [0x4, ['unsigned char']],
    'slot_number': [0x5, ['unsigned char']],
    'scsi_dev_type': [0x6, ['unsigned char']],
    'connect_port_bitmap': [0x7, ['unsigned char']],
    'sas_addr': [0x8, ['array', 2, ['unsigned long']]],
}],
  'Qcow2Feature': [ 0x30, {
    'type': [0x0, ['unsigned char']],
    'bit': [0x1, ['unsigned char']],
    'name': [0x2, ['array', 46, ['char']]],
}],
  'q_obj_begin_record_from_arg': [ 0x10, {
    'snapshot': [0x0, ['pointer', ['char']]],
    'file_name': [0x8, ['pointer', ['char']]],
}],
  'rebind<std::_Rb_tree_node<std::pair<const llvm::Function* const, long int': [ 0x1, {
}],
  'SDL_ExposeEvent': [ 0x1, {
    'type': [0x0, ['unsigned char']],
}],
  '__unnamed_0x2513': [ 0x38, {
    'type': [0x0, ['int']],
    'serial': [0x8, ['unsigned long']],
    'send_event': [0x10, ['int']],
    'display': [0x18, ['pointer', ['_XDisplay']]],
    'event': [0x20, ['unsigned long']],
    'window': [0x28, ['unsigned long']],
    'place': [0x30, ['int']],
}],
  'pointer_traits<char const*': [ 0x1, {
}],
  'PciMemoryRegion': [ 0x28, {
    'bar': [0x0, ['long']],
    'type': [0x8, ['pointer', ['char']]],
    'address': [0x10, ['long']],
    'size': [0x18, ['long']],
    'has_prefetch': [0x20, ['unsigned char']],
    'prefetch': [0x21, ['unsigned char']],
    'has_mem_type_64': [0x22, ['unsigned char']],
    'mem_type_64': [0x23, ['unsigned char']],
}],
  'AspeedTimerCtrlState': [ 0x6d0, {
    'parent': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'ctrl': [0x400, ['unsigned int']],
    'ctrl2': [0x404, ['unsigned int']],
    'timers': [0x408, ['array', 8, ['AspeedTimer']]],
}],
  'BDRVBochsState': [ 0x40, {
    'lock': [0x0, ['CoMutex']],
    'catalog_bitmap': [0x20, ['pointer', ['unsigned int']]],
    'catalog_size': [0x28, ['unsigned int']],
    'data_offset': [0x2c, ['unsigned int']],
    'bitmap_blocks': [0x30, ['unsigned int']],
    'extent_blocks': [0x34, ['unsigned int']],
    'extent_size': [0x38, ['unsigned int']],
}],
  'omap_pwl_s': [ 0x110, {
    'iomem': [0x0, ['MemoryRegion']],
    'output': [0x100, ['unsigned char']],
    'level': [0x101, ['unsigned char']],
    'enable': [0x102, ['unsigned char']],
    'clk': [0x104, ['int']],
}],
  'SDL_PixelFormat': [ 0x30, {
    'palette': [0x0, ['pointer', ['SDL_Palette']]],
    'BitsPerPixel': [0x8, ['unsigned char']],
    'BytesPerPixel': [0x9, ['unsigned char']],
    'Rloss': [0xa, ['unsigned char']],
    'Gloss': [0xb, ['unsigned char']],
    'Bloss': [0xc, ['unsigned char']],
    'Aloss': [0xd, ['unsigned char']],
    'Rshift': [0xe, ['unsigned char']],
    'Gshift': [0xf, ['unsigned char']],
    'Bshift': [0x10, ['unsigned char']],
    'Ashift': [0x11, ['unsigned char']],
    'Rmask': [0x14, ['unsigned int']],
    'Gmask': [0x18, ['unsigned int']],
    'Bmask': [0x1c, ['unsigned int']],
    'Amask': [0x20, ['unsigned int']],
    'colorkey': [0x24, ['unsigned int']],
    'alpha': [0x28, ['unsigned char']],
}],
  'PCIHostState': [ 0x620, {
    'busdev': [0x0, ['SysBusDevice']],
    'conf_mem': [0x300, ['MemoryRegion']],
    'data_mem': [0x400, ['MemoryRegion']],
    'mmcfg': [0x500, ['MemoryRegion']],
    'config_reg': [0x600, ['unsigned int']],
    'bus': [0x608, ['pointer', ['PCIBus']]],
    'next': [0x610, ['Enumeration', {'target': 'int', 'choices': {0: 'IOMMU_NOTIFIER_NONE', 1: 'IOMMU_NOTIFIER_UNMAP', 2: 'IOMMU_NOTIFIER_MAP'}}]],
}],
  'q_obj_x_blockdev_insert_medium_arg': [ 0x28, {
    'has_device': [0x0, ['unsigned char']],
    'device': [0x8, ['pointer', ['char']]],
    'has_id': [0x10, ['unsigned char']],
    'id': [0x18, ['pointer', ['char']]],
    'node_name': [0x20, ['pointer', ['char']]],
}],
  'ilist_nextprev_traits<llvm::Instruction': [ 0x1, {
}],
  'q_obj_client_migrate_info_arg': [ 0x40, {
    'protocol': [0x0, ['pointer', ['char']]],
    'hostname': [0x8, ['pointer', ['char']]],
    'has_port': [0x10, ['unsigned char']],
    'port': [0x18, ['long']],
    'has_tls_port': [0x20, ['unsigned char']],
    'tls_port': [0x28, ['long']],
    'has_cert_subject': [0x30, ['unsigned char']],
    'cert_subject': [0x38, ['pointer', ['char']]],
}],
  '__unnamed_0x1959': [ 0x60, {
    'type': [0x0, ['int']],
    'serial': [0x8, ['unsigned long']],
    'send_event': [0x10, ['int']],
    'display': [0x18, ['pointer', ['_XDisplay']]],
    'window': [0x20, ['unsigned long']],
    'root': [0x28, ['unsigned long']],
    'subwindow': [0x30, ['unsigned long']],
    'time': [0x38, ['unsigned long']],
    'x': [0x40, ['int']],
    'y': [0x44, ['int']],
    'x_root': [0x48, ['int']],
    'y_root': [0x4c, ['int']],
    'state': [0x50, ['unsigned int']],
    'keycode': [0x54, ['unsigned int']],
    'same_screen': [0x58, ['int']],
}],
  'BDRVVmdkState': [ 0x50, {
    'lock': [0x0, ['CoMutex']],
    'desc_offset': [0x20, ['unsigned long']],
    'cid_updated': [0x28, ['unsigned char']],
    'cid_checked': [0x29, ['unsigned char']],
    'cid': [0x2c, ['unsigned int']],
    'parent_cid': [0x30, ['unsigned int']],
    'num_extents': [0x34, ['int']],
    'extents': [0x38, ['pointer', ['VmdkExtent']]],
    'migration_blocker': [0x40, ['pointer', ['Error']]],
    'create_type': [0x48, ['pointer', ['char']]],
}],
  'q_obj_BLOCK_JOB_READY_arg': [ 0x28, {
    'type': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'BLOCK_JOB_TYPE_COMMIT', 1: 'BLOCK_JOB_TYPE_STREAM', 2: 'BLOCK_JOB_TYPE_MIRROR', 3: 'BLOCK_JOB_TYPE_BACKUP', 4: 'BLOCK_JOB_TYPE__MAX'}}]],
    'device': [0x8, ['pointer', ['char']]],
    'len': [0x10, ['long']],
    'offset': [0x18, ['long']],
    'speed': [0x20, ['long']],
}],
  'conditional<false, const std::pair<unsigned int, llvm::PointerAlignElem': [ 0x1, {
}],
  'mfi_sgl': [ 0x10, {
    'sg_skinny': [0x0, ['array', 1, ['mfi_sg_skinny']]],
    'sg64': [0x0, ['array', 1, ['mfi_sg64']]],
    'sg32': [0x0, ['array', 1, ['mfi_sg32']]],
}],
  'QIOChannelYieldData': [ 0x10, {
    'ioc': [0x0, ['pointer', ['QIOChannel']]],
    'co': [0x8, ['pointer', ['Coroutine']]],
}],
  'TCGOpDef': [ 0x20, {
    'name': [0x0, ['pointer', ['char']]],
    'nb_oargs': [0x8, ['unsigned char']],
    'nb_iargs': [0x9, ['unsigned char']],
    'nb_cargs': [0xa, ['unsigned char']],
    'nb_args': [0xb, ['unsigned char']],
    'flags': [0xc, ['unsigned char']],
    'args_ct': [0x10, ['pointer', ['TCGArgConstraint']]],
    'sorted_args': [0x18, ['pointer', ['int']]],
}],
  '__unnamed_0xb360': [ 0x8, {
    'passthrough': [0x0, ['q_obj_TPMPassthroughOptions_wrapper']],
}],
  'virtio_crypto_hash_session_para': [ 0x10, {
    'algo': [0x0, ['unsigned int']],
    'hash_result_len': [0x4, ['unsigned int']],
    'padding': [0x8, ['array', 8, ['unsigned char']]],
}],
  'des_ctx': [ 0x80, {
    'key': [0x0, ['array', 32, ['unsigned int']]],
}],
  'key_range': [ 0x10, {
    'start': [0x0, ['int']],
    'end': [0x4, ['int']],
    'next': [0x8, ['pointer', ['key_range']]],
}],
  'SchemaInfoEvent': [ 0x8, {
    'arg_type': [0x0, ['pointer', ['char']]],
}],
  '__unnamed_0x6987': [ 0x18, {
    'sg64': [0x0, ['array', 2, ['mfi_sg64']]],
    'sg32': [0x0, ['array', 2, ['mfi_sg32']]],
}],
  'Vmxnet3_GOSInfo': [ 0x4, {
    'gosType': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 2}]],
    'gosMisc': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 22}]],
    'gosVer': [0x0, ['BitField', {'end_bit': 22, 'start_bit': 6}]],
    'gosBits': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 0}]],
}],
  '__unnamed_0x2354': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['xs_dirs']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['xs_dirs']]]],
}],
  'bt_l2cap_sdp_state_s': [ 0x18, {
    'channel': [0x0, ['pointer', ['bt_l2cap_conn_params_s']]],
    'service_list': [0x8, ['pointer', ['sdp_service_record_s']]],
    'services': [0x10, ['int']],
}],
  'PVSCSISGElement': [ 0x10, {
    'addr': [0x0, ['unsigned long']],
    'length': [0x8, ['unsigned int']],
    'flags': [0xc, ['unsigned int']],
}],
  'VncJobQueue': [ 0x78, {
    'cond': [0x0, ['QemuCond']],
    'mutex': [0x30, ['QemuMutex']],
    'thread': [0x58, ['QemuThread']],
    'exit': [0x60, ['unsigned char']],
    'jobs': [0x68, ['__unnamed_0x2660']],
}],
  'MirrorOp': [ 0x30, {
    's': [0x0, ['pointer', ['MirrorBlockJob']]],
    'qiov': [0x8, ['QEMUIOVector']],
    'sector_num': [0x20, ['long']],
    'nb_sectors': [0x28, ['int']],
}],
  'q_obj_ChardevSpicePort_wrapper': [ 0x8, {
    'data': [0x0, ['pointer', ['ChardevSpicePort']]],
}],
  'QuorumVotes': [ 0x10, {
    'vote_list': [0x0, ['__unnamed_0x345a']],
    'compare': [0x8, ['pointer', ['void']]],
}],
  'input_event': [ 0x18, {
    'time': [0x0, ['timeval']],
    'type': [0x10, ['unsigned short']],
    'code': [0x12, ['unsigned short']],
    'value': [0x14, ['int']],
}],
  'V9fsQID': [ 0x10, {
    'type': [0x0, ['signed char']],
    'version': [0x4, ['int']],
    'path': [0x8, ['long']],
}],
  'AcpiSystemResourceAffinityTable': [ 0x30, {
    'signature': [0x0, ['unsigned int']],
    'length': [0x4, ['unsigned int']],
    'revision': [0x8, ['unsigned char']],
    'checksum': [0x9, ['unsigned char']],
    'oem_id': [0xa, ['array', 6, ['unsigned char']]],
    'oem_table_id': [0x10, ['array', 8, ['unsigned char']]],
    'oem_revision': [0x18, ['unsigned int']],
    'asl_compiler_id': [0x1c, ['array', 4, ['unsigned char']]],
    'asl_compiler_revision': [0x20, ['unsigned int']],
    'reserved1': [0x24, ['unsigned int']],
    'reserved2': [0x28, ['array', 2, ['unsigned int']]],
}],
  'QEMUSoundCard': [ 0x18, {
    'name': [0x0, ['pointer', ['char']]],
    'entries': [0x8, ['__unnamed_0x21aa']],
}],
  '_Base_bitset<1ul': [ 0x8, {
    '_M_w': [0x0, ['unsigned long']],
}],
  '__unnamed_0x3200': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['BlkdebugRule']]],
}],
  'q_obj_MIGRATION_PASS_arg': [ 0x8, {
    'pass': [0x0, ['long']],
}],
  'usbredirfilter_rule': [ 0x14, {
    'device_class': [0x0, ['int']],
    'vendor_id': [0x4, ['int']],
    'product_id': [0x8, ['int']],
    'device_version_bcd': [0xc, ['int']],
    'allow': [0x10, ['int']],
}],
  'iterator<std::bidirectional_iterator_tag, llvm::NamedMDNode, long int, llvm::NamedMDNode*, llvm::NamedMDNode&': [ 0x1, {
}],
  'sg_io_hdr': [ 0x58, {
    'interface_id': [0x0, ['int']],
    'dxfer_direction': [0x4, ['int']],
    'cmd_len': [0x8, ['unsigned char']],
    'mx_sb_len': [0x9, ['unsigned char']],
    'iovec_count': [0xa, ['unsigned short']],
    'dxfer_len': [0xc, ['unsigned int']],
    'dxferp': [0x10, ['pointer', ['void']]],
    'cmdp': [0x18, ['pointer', ['unsigned char']]],
    'sbp': [0x20, ['pointer', ['unsigned char']]],
    'timeout': [0x28, ['unsigned int']],
    'flags': [0x2c, ['unsigned int']],
    'pack_id': [0x30, ['int']],
    'usr_ptr': [0x38, ['pointer', ['void']]],
    'status': [0x40, ['unsigned char']],
    'masked_status': [0x41, ['unsigned char']],
    'msg_status': [0x42, ['unsigned char']],
    'sb_len_wr': [0x43, ['unsigned char']],
    'host_status': [0x44, ['unsigned short']],
    'driver_status': [0x46, ['unsigned short']],
    'resid': [0x48, ['int']],
    'duration': [0x4c, ['unsigned int']],
    'info': [0x50, ['unsigned int']],
}],
  'ip': [ 0x14, {
    'ip_v': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 4}]],
    'ip_hl': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 0}]],
    'ip_tos': [0x1, ['unsigned char']],
    'ip_len': [0x2, ['unsigned short']],
    'ip_id': [0x4, ['unsigned short']],
    'ip_off': [0x6, ['unsigned short']],
    'ip_ttl': [0x8, ['unsigned char']],
    'ip_p': [0x9, ['unsigned char']],
    'ip_sum': [0xa, ['unsigned short']],
    'ip_src': [0xc, ['in_addr']],
    'ip_dst': [0x10, ['in_addr']],
}],
  'sockaddr_in': [ 0x10, {
    'sin_family': [0x0, ['unsigned short']],
    'sin_port': [0x2, ['unsigned short']],
    'sin_addr': [0x4, ['in_addr']],
    'sin_zero': [0x8, ['array', 8, ['unsigned char']]],
}],
  'PVSCSICmdDescAbortCmd': [ 0x10, {
    'context': [0x0, ['unsigned long']],
    'target': [0x8, ['unsigned int']],
    'pad': [0xc, ['unsigned int']],
}],
  '__unnamed_0x11b0': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['USBPacket']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['USBPacket']]]],
}],
  'omap_eac_s': [ 0x21c0, {
    'irq': [0x0, ['pointer', ['IRQState']]],
    'iomem': [0x10, ['MemoryRegion']],
    'sysconfig': [0x110, ['unsigned short']],
    'config': [0x112, ['array', 4, ['unsigned char']]],
    'control': [0x116, ['unsigned char']],
    'address': [0x117, ['unsigned char']],
    'data': [0x118, ['unsigned short']],
    'vtol': [0x11a, ['unsigned char']],
    'vtsl': [0x11b, ['unsigned char']],
    'mixer': [0x11c, ['unsigned short']],
    'gain': [0x11e, ['array', 4, ['unsigned short']]],
    'att': [0x126, ['unsigned char']],
    'max': [0x128, ['array', 7, ['unsigned short']]],
    'codec': [0x138, ['__unnamed_0x4b06']],
    'modem': [0x21b0, ['__unnamed_0x4c41']],
    'bt': [0x21b4, ['__unnamed_0x4c41']],
}],
  'RR_log_t': [ 0x90, {
    'type': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'RECORD', 1: 'REPLAY'}}]],
    'last_prog_point': [0x8, ['RR_prog_point_t']],
    'name': [0x10, ['pointer', ['char']]],
    'fp': [0x18, ['pointer', ['_IO_FILE']]],
    'size': [0x20, ['unsigned long long']],
    'bytes_read': [0x28, ['unsigned long']],
    'current_item': [0x30, ['rr_log_entry_t']],
    'current_item_valid': [0x80, ['unsigned char']],
    'item_number': [0x88, ['unsigned long']],
}],
  'smbios_field': [ 0x6, {
    'header': [0x0, ['smbios_header']],
    'type': [0x3, ['unsigned char']],
    'offset': [0x4, ['unsigned short']],
    'data': [0x6, ['array', 0, ['unsigned char']]],
}],
  'qht_map': [ 0x30, {
    'rcu': [0x0, ['rcu_head']],
    'buckets': [0x10, ['pointer', ['qht_bucket']]],
    'n_buckets': [0x18, ['unsigned long']],
    'n_added_buckets': [0x20, ['unsigned long']],
    'n_added_buckets_threshold': [0x28, ['unsigned long']],
}],
  'VHDXPage83Data': [ 0x10, {
    'page_83_data': [0x0, ['MSGUID']],
}],
  'ProtobufCIntRange': [ 0x8, {
    'start_value': [0x0, ['int']],
    'orig_index': [0x4, ['unsigned int']],
}],
  'ilist_node_traits<llvm::Instruction': [ 0x1, {
}],
  'TPMPassthroughOptions': [ 0x20, {
    'has_path': [0x0, ['unsigned char']],
    'path': [0x8, ['pointer', ['char']]],
    'has_cancel_path': [0x10, ['unsigned char']],
    'cancel_path': [0x18, ['pointer', ['char']]],
}],
  'sha256_ctx': [ 0x70, {
    'state': [0x0, ['array', 8, ['unsigned int']]],
    'count': [0x20, ['unsigned long']],
    'block': [0x28, ['array', 64, ['unsigned char']]],
    'index': [0x68, ['unsigned int']],
}],
  'QEMUGLParams': [ 0x8, {
    'major_ver': [0x0, ['int']],
    'minor_ver': [0x4, ['int']],
}],
  'QDict': [ 0x1018, {
    'base': [0x0, ['QObject']],
    'size': [0x10, ['unsigned long']],
    'table': [0x18, ['array', 512, ['__unnamed_0x87c']]],
}],
  'bochs_header': [ 0x200, {
    'magic': [0x0, ['array', 32, ['char']]],
    'type': [0x20, ['array', 16, ['char']]],
    'subtype': [0x30, ['array', 16, ['char']]],
    'version': [0x40, ['unsigned int']],
    'header': [0x44, ['unsigned int']],
    'catalog': [0x48, ['unsigned int']],
    'bitmap': [0x4c, ['unsigned int']],
    'extent': [0x50, ['unsigned int']],
    'extra': [0x54, ['Enumeration', {'target': 'int', 'choices': {67371008: 'PIXMAN_c4', 134545408: 'PIXMAN_g8', 537004714: 'PIXMAN_x2r10g10b10', 537495688: 'PIXMAN_r8g8b8a8', 67190784: 'PIXMAN_a4', 268567909: 'PIXMAN_r5g6b5', 402851976: 'PIXMAN_b8g8r8', 537462920: 'PIXMAN_r8g8b8x8', 17104896: 'PIXMAN_g1', 67244305: 'PIXMAN_a1r1g1b1', 537069704: 'PIXMAN_x8b8g8r8', 268633156: 'PIXMAN_x4b4g4r4', 134479872: 'PIXMAN_c8', 268649540: 'PIXMAN_a4b4g4r4', 67240225: 'PIXMAN_r1g2b1', 134357538: 'PIXMAN_a2r2g2b2', 537397384: 'PIXMAN_b8g8r8x8', 268571989: 'PIXMAN_a1r5g5b5', 268828672: 'PIXMAN_yuy2', 537078442: 'PIXMAN_a2b10g10r10', 537561224: 'PIXMAN_a8r8g8b8_sRGB', 134415154: 'PIXMAN_b2g3r3', 402786440: 'PIXMAN_r8g8b8', 134349618: 'PIXMAN_r3g3b2', 537430152: 'PIXMAN_b8g8r8a8', 537004168: 'PIXMAN_x8r8g8b8', 268567893: 'PIXMAN_x1r5g5b5', 268567620: 'PIXMAN_x4r4g4b4', 537036936: 'PIXMAN_a8r8g8b8', 67305761: 'PIXMAN_b1g2r1', 134423074: 'PIXMAN_a2b2g2r2', 537102472: 'PIXMAN_a8b8g8r8', 268633429: 'PIXMAN_x1b5g5r5', 67436544: 'PIXMAN_g4', 16846848: 'PIXMAN_a1', 268633445: 'PIXMAN_b5g6r5', 537003622: 'PIXMAN_x14r6g6b6', 67309841: 'PIXMAN_a1b1g1r1', 201785344: 'PIXMAN_yv12', 537012906: 'PIXMAN_a2r10g10b10', 134299648: 'PIXMAN_x4a4', 268584004: 'PIXMAN_a4r4g4b4', 134316032: 'PIXMAN_a8', 537070250: 'PIXMAN_x2b10g10r10', 268637525: 'PIXMAN_a1b5g5r5'}}]],
}],
  'ripemd160_ctx': [ 0x68, {
    'state': [0x0, ['array', 5, ['unsigned int']]],
    'count': [0x18, ['unsigned long']],
    'block': [0x20, ['array', 64, ['unsigned char']]],
    'index': [0x60, ['unsigned int']],
}],
  'AlignedCharArray<8ul, 8ul': [ 0x8, {
    'buffer': [0x0, ['array', 8, ['char']]],
}],
  'BlockdevSnapshotInternal': [ 0x10, {
    'device': [0x0, ['pointer', ['char']]],
    'name': [0x8, ['pointer', ['char']]],
}],
  '_IO_marker': [ 0x18, {
    '_next': [0x0, ['pointer', ['_IO_marker']]],
    '_sbuf': [0x8, ['pointer', ['_IO_FILE']]],
    '_pos': [0x10, ['int']],
}],
  'mfi_init_frame': [ 0x40, {
    'header': [0x0, ['mfi_frame_header']],
    'qinfo_new_addr_lo': [0x18, ['unsigned int']],
    'qinfo_new_addr_hi': [0x1c, ['unsigned int']],
    'qinfo_old_addr_lo': [0x20, ['unsigned int']],
    'qinfo_old_addr_hi': [0x24, ['unsigned int']],
    'reserved': [0x28, ['array', 6, ['unsigned int']]],
}],
  'HostMemoryBackendClass': [ 0x68, {
    'parent_class': [0x0, ['ObjectClass']],
    'alloc': [0x60, ['pointer', ['void']]],
}],
  'IDEBus': [ 0x8e0, {
    'qbus': [0x0, ['BusState']],
    'master': [0x68, ['pointer', ['IDEDevice']]],
    'slave': [0x70, ['pointer', ['IDEDevice']]],
    'ifs': [0x78, ['array', 2, ['IDEState']]],
    'bh': [0x818, ['pointer', ['QEMUBH']]],
    'bus_id': [0x820, ['int']],
    'max_units': [0x824, ['int']],
    'dma': [0x828, ['pointer', ['IDEDMA']]],
    'unit': [0x830, ['unsigned char']],
    'cmd': [0x831, ['unsigned char']],
    'irq': [0x838, ['pointer', ['IRQState']]],
    'error_status': [0x840, ['int']],
    'retry_unit': [0x844, ['unsigned char']],
    'retry_sector_num': [0x848, ['long']],
    'retry_nsector': [0x850, ['unsigned int']],
    'portio_list': [0x858, ['PortioList']],
    'portio2_list': [0x898, ['PortioList']],
    'vmstate': [0x8d8, ['pointer', ['vm_change_state_entry']]],
}],
  'RegisterPass<llvm::PandaCallMorphFunctionPass': [ 0x40, {
}],
  'QIOChannelFDPairSource': [ 0x80, {
    'parent': [0x0, ['_GSource']],
    'fdread': [0x60, ['_GPollFD']],
    'fdwrite': [0x68, ['_GPollFD']],
    'ioc': [0x70, ['pointer', ['QIOChannel']]],
    'condition': [0x78, ['Enumeration', {'target': 'int', 'choices': {32: 'G_IO_NVAL', 1: 'G_IO_IN', 2: 'G_IO_PRI', 4: 'G_IO_OUT', 8: 'G_IO_ERR', 16: 'G_IO_HUP'}}]],
}],
  'QEMUResetEntry': [ 0x20, {
    'entry': [0x0, ['__unnamed_0x64b']],
    'func': [0x10, ['pointer', ['void']]],
    'opaque': [0x18, ['pointer', ['void']]],
}],
  '__unnamed_0x1d3e': [ 0x48, {
    'type': [0x0, ['int']],
    'serial': [0x8, ['unsigned long']],
    'send_event': [0x10, ['int']],
    'display': [0x18, ['pointer', ['_XDisplay']]],
    'window': [0x20, ['unsigned long']],
    'key_vector': [0x28, ['array', 32, ['char']]],
}],
  '__unnamed_0x4cbc': [ 0x10, {
    'le_next': [0x0, ['pointer', ['vm_change_state_entry']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['vm_change_state_entry']]]],
}],
  'ImageInfoSpecificVmdk': [ 0x20, {
    'create_type': [0x0, ['pointer', ['char']]],
    'cid': [0x8, ['long']],
    'parent_cid': [0x10, ['long']],
    'extents': [0x18, ['pointer', ['ImageInfoList']]],
}],
  'fp_port': [ 0x2050, {
    'r': [0x0, ['pointer', ['rocker']]],
    'world': [0x8, ['pointer', ['world']]],
    'index': [0x10, ['unsigned int']],
    'name': [0x18, ['pointer', ['char']]],
    'pport': [0x20, ['unsigned int']],
    'enabled': [0x24, ['unsigned char']],
    'speed': [0x28, ['unsigned int']],
    'duplex': [0x2c, ['unsigned char']],
    'autoneg': [0x2d, ['unsigned char']],
    'learning': [0x2e, ['unsigned char']],
    'nic': [0x30, ['pointer', ['NICState']]],
    'conf': [0x38, ['NICConf']],
}],
  'QXLText': [ 0x44, {
    'str': [0x0, ['unsigned long']],
    'back_area': [0x8, ['QXLRect']],
    'fore_brush': [0x18, ['QXLBrush']],
    'back_brush': [0x2c, ['QXLBrush']],
    'fore_mode': [0x40, ['unsigned short']],
    'back_mode': [0x42, ['unsigned short']],
}],
  '__unnamed_0x2e06': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['QemuOpts']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['QemuOpts']]]],
}],
  '_Panda__LogEntry': [ 0xe8, {
    'base': [0x0, ['ProtobufCMessage']],
    'pc': [0x18, ['unsigned long']],
    'instr': [0x20, ['unsigned long']],
    'has_asid': [0x28, ['int']],
    'asid': [0x30, ['unsigned long']],
    'process_name': [0x38, ['pointer', ['char']]],
    'has_process_id': [0x40, ['int']],
    'process_id': [0x44, ['unsigned int']],
    'has_total_instr': [0x48, ['int']],
    'total_instr': [0x50, ['unsigned long']],
    'call_stack': [0x58, ['pointer', ['_Panda__CallStack']]],
    'dwarf_call': [0x60, ['pointer', ['_Panda__DwarfCall']]],
    'dwarf_ret': [0x68, ['pointer', ['_Panda__DwarfCall']]],
    'has_taint_label_virtual_addr': [0x70, ['int']],
    'taint_label_virtual_addr': [0x78, ['unsigned long']],
    'has_taint_label_physical_addr': [0x80, ['int']],
    'taint_label_physical_addr': [0x88, ['unsigned long']],
    'has_taint_label_number': [0x90, ['int']],
    'taint_label_number': [0x94, ['unsigned int']],
    'taint_query_pri': [0x98, ['pointer', ['_Panda__TaintQueryPri']]],
    'attack_point_pri': [0xa0, ['pointer', ['_Panda__AttackPointPri']]],
    'pri_trace_src_info': [0xa8, ['pointer', ['_Panda__SrcInfoPri']]],
    'taint_query_hypercall': [0xb0, ['pointer', ['_Panda__TaintQueryHypercall']]],
    'attack_point': [0xb8, ['pointer', ['_Panda__AttackPoint']]],
    'tainted_branch': [0xc0, ['pointer', ['_Panda__TaintedBranch']]],
    'tainted_branch_summary': [0xc8, ['pointer', ['_Panda__TaintedBranchSummary']]],
    'tainted_instr': [0xd0, ['pointer', ['_Panda__TaintedInstr']]],
    'tainted_instr_summary': [0xd8, ['pointer', ['_Panda__TaintedInstrSummary']]],
    'llvmentry': [0xe0, ['pointer', ['_Panda__LLVMEntry']]],
}],
  'bt_link_s': [ 0x18, {
    'slave': [0x0, ['pointer', ['bt_device_s']]],
    'host': [0x8, ['pointer', ['bt_device_s']]],
    'handle': [0x10, ['unsigned short']],
    'acl_interval': [0x12, ['unsigned short']],
    'acl_mode': [0x14, ['Enumeration', {'target': 'int', 'choices': {0: 'acl_active', 1: 'acl_hold', 2: 'acl_sniff', 3: 'acl_parked'}}]],
}],
  'audio_driver': [ 0x48, {
    'name': [0x0, ['pointer', ['char']]],
    'descr': [0x8, ['pointer', ['char']]],
    'options': [0x10, ['pointer', ['audio_option']]],
    'init': [0x18, ['pointer', ['void']]],
    'fini': [0x20, ['pointer', ['void']]],
    'pcm_ops': [0x28, ['pointer', ['audio_pcm_ops']]],
    'can_be_default': [0x30, ['int']],
    'max_voices_out': [0x34, ['int']],
    'max_voices_in': [0x38, ['int']],
    'voice_size_out': [0x3c, ['int']],
    'voice_size_in': [0x40, ['int']],
    'ctl_caps': [0x44, ['int']],
}],
  '_GError': [ 0x10, {
    'domain': [0x0, ['unsigned int']],
    'code': [0x4, ['int']],
    'message': [0x8, ['pointer', ['char']]],
}],
  'CommitBlockJob': [ 0x100, {
    'common': [0x0, ['BlockJob']],
    'limit': [0xa8, ['__unnamed_0x3f75']],
    'active': [0xd0, ['pointer', ['BlockDriverState']]],
    'top': [0xd8, ['pointer', ['BlockBackend']]],
    'base': [0xe0, ['pointer', ['BlockBackend']]],
    'on_error': [0xe8, ['Enumeration', {'target': 'int', 'choices': {0: 'BLOCKDEV_ON_ERROR_REPORT', 1: 'BLOCKDEV_ON_ERROR_IGNORE', 2: 'BLOCKDEV_ON_ERROR_ENOSPC', 3: 'BLOCKDEV_ON_ERROR_STOP', 4: 'BLOCKDEV_ON_ERROR_AUTO', 5: 'BLOCKDEV_ON_ERROR__MAX'}}]],
    'base_flags': [0xec, ['int']],
    'orig_overlay_flags': [0xf0, ['int']],
    'backing_file_str': [0xf8, ['pointer', ['char']]],
}],
  'q_obj_object_add_arg': [ 0x20, {
    'qom_type': [0x0, ['pointer', ['char']]],
    'id': [0x8, ['pointer', ['char']]],
    'has_props': [0x10, ['unsigned char']],
    'props': [0x18, ['pointer', ['QObject']]],
}],
  'V9fsDir': [ 0x30, {
    'stream': [0x0, ['pointer', ['__dirstream']]],
    'readdir_mutex': [0x8, ['QemuMutex']],
}],
  'QOMCompositionState': [ 0x10, {
    'mon': [0x0, ['pointer', ['Monitor']]],
    'indent': [0x8, ['int']],
}],
  'TPMBackendThread': [ 0x8, {
    'pool': [0x0, ['pointer', ['_GThreadPool']]],
}],
  '_Panda__TaintQuery': [ 0x30, {
    'base': [0x0, ['ProtobufCMessage']],
    'ptr': [0x18, ['unsigned long']],
    'tcn': [0x20, ['unsigned int']],
    'offset': [0x24, ['unsigned int']],
    'unique_label_set': [0x28, ['pointer', ['_Panda__TaintQueryUniqueLabelSet']]],
}],
  '__unnamed_0x7873': [ 0x10, {
    'ld': [0x0, ['mfi_ld_ref']],
    'state': [0x4, ['unsigned char']],
    'reserved2': [0x5, ['array', 3, ['unsigned char']]],
    'size': [0x8, ['unsigned long']],
}],
  'NICInfo': [ 0x38, {
    'macaddr': [0x0, ['MACAddr']],
    'model': [0x8, ['pointer', ['char']]],
    'name': [0x10, ['pointer', ['char']]],
    'devaddr': [0x18, ['pointer', ['char']]],
    'netdev': [0x20, ['pointer', ['NetClientState']]],
    'used': [0x28, ['int']],
    'instantiated': [0x2c, ['int']],
    'nvectors': [0x30, ['int']],
}],
  '__unnamed_0x2972': [ 0x10, {
    'le_next': [0x0, ['pointer', ['VFIOHostDMAWindow']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['VFIOHostDMAWindow']]]],
}],
  'gregs': [ 0x50, {
    'cnt': [0x0, ['unsigned long']],
    'cnt_wstat': [0x8, ['unsigned int']],
    'tcon': [0xc, ['unsigned int']],
    'int_cstat': [0x10, ['unsigned int']],
    'int_enb': [0x14, ['unsigned int']],
    'wstat': [0x18, ['unsigned int']],
    'comp': [0x20, ['array', 4, ['unsigned long']]],
    'comp_add_incr': [0x40, ['array', 4, ['unsigned int']]],
}],
  'FWBootEntry': [ 0x28, {
    'link': [0x0, ['__unnamed_0xd6d']],
    'bootindex': [0x10, ['int']],
    'dev': [0x18, ['pointer', ['DeviceState']]],
    'suffix': [0x20, ['pointer', ['char']]],
}],
  'CCID_T0ProtocolDataStructure': [ 0x5, {
    'bmFindexDindex': [0x0, ['unsigned char']],
    'bmTCCKST0': [0x1, ['unsigned char']],
    'bGuardTimeT0': [0x2, ['unsigned char']],
    'bWaitingIntegerT0': [0x3, ['unsigned char']],
    'bClockStop': [0x4, ['unsigned char']],
}],
  'QCowL2Meta': [ 0x60, {
    'offset': [0x0, ['unsigned long']],
    'alloc_offset': [0x8, ['unsigned long']],
    'nb_clusters': [0x10, ['int']],
    'dependent_requests': [0x18, ['CoQueue']],
    'cow_start': [0x28, ['Qcow2COWRegion']],
    'cow_end': [0x38, ['Qcow2COWRegion']],
    'next': [0x48, ['pointer', ['QCowL2Meta']]],
    'next_in_flight': [0x50, ['__unnamed_0x3dba']],
}],
  'MPIMsgSCSIIOReply': [ 0x24, {
    'TargetID': [0x0, ['unsigned char']],
    'Bus': [0x1, ['unsigned char']],
    'MsgLength': [0x2, ['unsigned char']],
    'Function': [0x3, ['unsigned char']],
    'CDBLength': [0x4, ['unsigned char']],
    'SenseBufferLength': [0x5, ['unsigned char']],
    'Reserved': [0x6, ['unsigned char']],
    'MsgFlags': [0x7, ['unsigned char']],
    'MsgContext': [0x8, ['unsigned int']],
    'SCSIStatus': [0xc, ['unsigned char']],
    'SCSIState': [0xd, ['unsigned char']],
    'IOCStatus': [0xe, ['unsigned short']],
    'IOCLogInfo': [0x10, ['unsigned int']],
    'TransferCount': [0x14, ['unsigned int']],
    'SenseCount': [0x18, ['unsigned int']],
    'ResponseInfo': [0x1c, ['unsigned int']],
    'TaskTag': [0x20, ['unsigned short']],
    'Reserved1': [0x22, ['unsigned short']],
}],
  'q_obj_block_job_resume_arg': [ 0x8, {
    'device': [0x0, ['pointer', ['char']]],
}],
  '__unnamed_0x3952': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['NBDClient']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['NBDClient']]]],
}],
  'MACAddr': [ 0x6, {
    'a': [0x0, ['array', 6, ['unsigned char']]],
}],
  'ReadLineState': [ 0x2b60, {
    'cmd_buf': [0x0, ['array', 4096, ['char']]],
    'cmd_buf_index': [0x1000, ['int']],
    'cmd_buf_size': [0x1004, ['int']],
    'last_cmd_buf': [0x1008, ['array', 4096, ['char']]],
    'last_cmd_buf_index': [0x2008, ['int']],
    'last_cmd_buf_size': [0x200c, ['int']],
    'esc_state': [0x2010, ['int']],
    'esc_param': [0x2014, ['int']],
    'history': [0x2018, ['array', 64, ['pointer', ['char']]]],
    'hist_entry': [0x2218, ['int']],
    'completion_finder': [0x2220, ['pointer', ['void']]],
    'completions': [0x2228, ['array', 256, ['pointer', ['char']]]],
    'nb_completions': [0x2a28, ['int']],
    'completion_index': [0x2a2c, ['int']],
    'readline_func': [0x2a30, ['pointer', ['void']]],
    'readline_opaque': [0x2a38, ['pointer', ['void']]],
    'read_password': [0x2a40, ['int']],
    'prompt': [0x2a44, ['array', 256, ['char']]],
    'printf_func': [0x2b48, ['pointer', ['void']]],
    'flush_func': [0x2b50, ['pointer', ['void']]],
    'opaque': [0x2b58, ['pointer', ['void']]],
}],
  'elf32_shdr': [ 0x28, {
    'sh_name': [0x0, ['unsigned int']],
    'sh_type': [0x4, ['unsigned int']],
    'sh_flags': [0x8, ['unsigned int']],
    'sh_addr': [0xc, ['unsigned int']],
    'sh_offset': [0x10, ['unsigned int']],
    'sh_size': [0x14, ['unsigned int']],
    'sh_link': [0x18, ['unsigned int']],
    'sh_info': [0x1c, ['unsigned int']],
    'sh_addralign': [0x20, ['unsigned int']],
    'sh_entsize': [0x24, ['unsigned int']],
}],
  '__unnamed_0x2a85': [ 0x50, {
    'i': [0x0, ['array', 8, ['int']]],
    's': [0x0, ['array', 80, ['char']]],
}],
  '__ptrtr_not_void<char, char': [ 0x1, {
}],
  'AspeedSMCClass': [ 0x308, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'ctrl': [0x300, ['pointer', ['AspeedSMCController']]],
}],
  'less<std::pair<long int, llvm::Type*': [ 0x1, {
}],
  'HDACodecDevice': [ 0x78, {
    'qdev': [0x0, ['DeviceState']],
    'cad': [0x70, ['unsigned int']],
}],
  '__unnamed_0x7477': [ 0x4, {
    'device_id': [0x0, ['unsigned short']],
    'seq_num': [0x2, ['unsigned short']],
}],
  'rr_map_list': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['RR_MapList']]],
}],
  'SpiceMigrateInterface': [ 0x28, {
    'base': [0x0, ['SpiceBaseInterface']],
    'migrate_connect_complete': [0x18, ['pointer', ['void']]],
    'migrate_end_complete': [0x20, ['pointer', ['void']]],
}],
  '__unnamed_0x22ba': [ 0x40, {
    'altset': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'ALTSET_OFF', 1: 'ALTSET_ON'}}]],
    'as': [0x4, ['audsettings']],
    'voice': [0x18, ['pointer', ['SWVoiceOut']]],
    'mute': [0x20, ['unsigned char']],
    'vol': [0x21, ['array', 2, ['unsigned char']]],
    'buf': [0x28, ['streambuf']],
}],
  'iterator<std::bidirectional_iterator_tag, llvm::GlobalAlias, long int, llvm::GlobalAlias*, llvm::GlobalAlias&': [ 0x1, {
}],
  'QueryParams': [ 0x10, {
    'n': [0x0, ['int']],
    'alloc': [0x4, ['int']],
    'p': [0x8, ['pointer', ['QueryParam']]],
}],
  'IOThreadInfo': [ 0x10, {
    'id': [0x0, ['pointer', ['char']]],
    'thread_id': [0x8, ['long']],
}],
  '__unnamed_0x382c': [ 0x8, {
    'status_error': [0x0, ['unsigned int']],
    'length': [0x4, ['unsigned short']],
    'vlan': [0x6, ['unsigned short']],
}],
  '__unnamed_0x167d': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['MemoryRegion']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['MemoryRegion']]]],
}],
  '__unnamed_0x1ccd': [ 0x30, {
    'type': [0x0, ['int']],
    'serial': [0x8, ['unsigned long']],
    'send_event': [0x10, ['int']],
    'display': [0x18, ['pointer', ['_XDisplay']]],
    'window': [0x20, ['unsigned long']],
    'mode': [0x28, ['int']],
    'detail': [0x2c, ['int']],
}],
  'PL031State': [ 0x430, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'timer': [0x400, ['pointer', ['QEMUTimer']]],
    'irq': [0x408, ['pointer', ['IRQState']]],
    'tick_offset_vmstate': [0x410, ['unsigned int']],
    'tick_offset': [0x414, ['unsigned int']],
    'mr': [0x418, ['unsigned int']],
    'lr': [0x41c, ['unsigned int']],
    'cr': [0x420, ['unsigned int']],
    'im': [0x424, ['unsigned int']],
    'is': [0x428, ['unsigned int']],
}],
  '__unnamed_0x2a5f': [ 0x4, {
    'bMaxBurst': [0x0, ['unsigned char']],
    'bmAttributes': [0x1, ['unsigned char']],
    'wBytesPerInterval_lo': [0x2, ['unsigned char']],
    'wBytesPerInterval_hi': [0x3, ['unsigned char']],
}],
  '__unnamed_0x2b2f': [ 0x10, {
    'fields': [0x0, ['__unnamed_0x2ace']],
    'data': [0x0, ['array', 16, ['unsigned char']]],
}],
  '__unnamed_0x2b5b': [ 0x7, {
    'super': [0x0, ['__unnamed_0x2afe']],
    'usb2_ext': [0x0, ['__unnamed_0x2ac5']],
}],
  'dpll_ctl_s': [ 0x110, {
    'iomem': [0x0, ['MemoryRegion']],
    'mode': [0x100, ['unsigned short']],
    'dpll': [0x108, ['pointer', ['clk']]],
}],
  'MPIMsgConfig': [ 0x28, {
    'Action': [0x0, ['unsigned char']],
    'Reserved': [0x1, ['unsigned char']],
    'ChainOffset': [0x2, ['unsigned char']],
    'Function': [0x3, ['unsigned char']],
    'ExtPageLength': [0x4, ['unsigned short']],
    'ExtPageType': [0x6, ['unsigned char']],
    'MsgFlags': [0x7, ['unsigned char']],
    'MsgContext': [0x8, ['unsigned int']],
    'Reserved2': [0xc, ['array', 8, ['unsigned char']]],
    'PageVersion': [0x14, ['unsigned char']],
    'PageLength': [0x15, ['unsigned char']],
    'PageNumber': [0x16, ['unsigned char']],
    'PageType': [0x17, ['unsigned char']],
    'PageAddress': [0x18, ['unsigned int']],
    'PageBufferSGE': [0x1c, ['MPISGEntry']],
}],
  'q_obj_QUORUM_REPORT_BAD_arg': [ 0x28, {
    'type': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'QUORUM_OP_TYPE_READ', 1: 'QUORUM_OP_TYPE_WRITE', 2: 'QUORUM_OP_TYPE_FLUSH', 3: 'QUORUM_OP_TYPE__MAX'}}]],
    'has_error': [0x4, ['unsigned char']],
    'error': [0x8, ['pointer', ['char']]],
    'node_name': [0x10, ['pointer', ['char']]],
    'sector_num': [0x18, ['long']],
    'sectors_count': [0x20, ['long']],
}],
  'vfio_irq_info': [ 0x10, {
    'argsz': [0x0, ['unsigned int']],
    'flags': [0x4, ['unsigned int']],
    'index': [0x8, ['unsigned int']],
    'count': [0xc, ['unsigned int']],
}],
  '__unnamed_0x2908': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['PCIBus']]],
}],
  'BlockdevOptionsLUKS': [ 0x18, {
    'file': [0x0, ['pointer', ['BlockdevRef']]],
    'has_key_secret': [0x8, ['unsigned char']],
    'key_secret': [0x10, ['pointer', ['char']]],
}],
  'CpuInfo': [ 0x38, {
    'CPU': [0x0, ['long']],
    'current': [0x8, ['unsigned char']],
    'halted': [0x9, ['unsigned char']],
    'qom_path': [0x10, ['pointer', ['char']]],
    'thread_id': [0x18, ['long']],
    'arch': [0x20, ['Enumeration', {'target': 'int', 'choices': {0: 'CPU_INFO_ARCH_X86', 1: 'CPU_INFO_ARCH_SPARC', 2: 'CPU_INFO_ARCH_PPC', 3: 'CPU_INFO_ARCH_MIPS', 4: 'CPU_INFO_ARCH_TRICORE', 5: 'CPU_INFO_ARCH_OTHER', 6: 'CPU_INFO_ARCH__MAX'}}]],
    'u': [0x28, ['__unnamed_0xad54']],
}],
  'simplify_type<llvm::Value*': [ 0x1, {
}],
  'ipasfrag': [ 0x24, {
    'ipf_link': [0x0, ['qlink']],
    'ipf_ip': [0x10, ['ip']],
}],
  'omap_32khz_timer_s': [ 0x250, {
    'timer': [0x0, ['omap_mpu_timer_s']],
    'iomem': [0x150, ['MemoryRegion']],
}],
  'xs_dirs': [ 0x18, {
    'xs_dir': [0x0, ['pointer', ['char']]],
    'list': [0x8, ['__unnamed_0x2354']],
}],
  'NetSocketState': [ 0x111b8, {
    'nc': [0x0, ['NetClientState']],
    'listen_fd': [0x170, ['int']],
    'fd': [0x174, ['int']],
    'rs': [0x178, ['SocketReadState']],
    'send_index': [0x11190, ['unsigned int']],
    'dgram_dst': [0x11194, ['sockaddr_in']],
    'send_fn': [0x111a8, ['pointer', ['void']]],
    'read_poll': [0x111b0, ['unsigned char']],
    'write_poll': [0x111b1, ['unsigned char']],
}],
  'QXLCursor': [ 0x2a, {
    'header': [0x0, ['QXLCursorHeader']],
    'data_size': [0x12, ['unsigned int']],
    'chunk': [0x16, ['QXLDataChunk']],
}],
  'AwA10PICState': [ 0x460, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'parent_fiq': [0x400, ['pointer', ['IRQState']]],
    'parent_irq': [0x408, ['pointer', ['IRQState']]],
    'vector': [0x410, ['unsigned int']],
    'base_addr': [0x414, ['unsigned int']],
    'protect': [0x418, ['unsigned int']],
    'nmi': [0x41c, ['unsigned int']],
    'irq_pending': [0x420, ['array', 3, ['unsigned int']]],
    'fiq_pending': [0x42c, ['array', 3, ['unsigned int']]],
    'select': [0x438, ['array', 3, ['unsigned int']]],
    'enable': [0x444, ['array', 3, ['unsigned int']]],
    'mask': [0x450, ['array', 3, ['unsigned int']]],
}],
  '_GOnce': [ 0x10, {
    'status': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'G_ONCE_STATUS_NOTCALLED', 1: 'G_ONCE_STATUS_PROGRESS', 2: 'G_ONCE_STATUS_READY'}}]],
    'retval': [0x8, ['pointer', ['void']]],
}],
  'mfi_ld_ref': [ 0x4, {
    'ref': [0x0, ['unsigned int']],
    'v': [0x0, ['__unnamed_0x781e']],
}],
  'q_obj_block_job_complete_arg': [ 0x8, {
    'device': [0x0, ['pointer', ['char']]],
}],
  'omap_mpu_state_s': [ 0x1470, {
    'mpu_model': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'omap310', 1: 'omap1510', 2: 'omap1610', 3: 'omap1710', 4: 'omap2410', 5: 'omap2420', 6: 'omap2422', 7: 'omap2423', 8: 'omap2430', 9: 'omap3430', 10: 'omap3630'}}]],
    'cpu': [0x8, ['pointer', ['ARMCPU']]],
    'drq': [0x10, ['pointer', ['pointer', ['IRQState']]]],
    'wakeup': [0x18, ['pointer', ['IRQState']]],
    'ulpd_pm_iomem': [0x20, ['MemoryRegion']],
    'pin_cfg_iomem': [0x120, ['MemoryRegion']],
    'id_iomem': [0x220, ['MemoryRegion']],
    'id_iomem_e18': [0x320, ['MemoryRegion']],
    'id_iomem_ed4': [0x420, ['MemoryRegion']],
    'id_iomem_e20': [0x520, ['MemoryRegion']],
    'mpui_iomem': [0x620, ['MemoryRegion']],
    'tcmi_iomem': [0x720, ['MemoryRegion']],
    'clkm_iomem': [0x820, ['MemoryRegion']],
    'clkdsp_iomem': [0x920, ['MemoryRegion']],
    'mpui_io_iomem': [0xa20, ['MemoryRegion']],
    'tap_iomem': [0xb20, ['MemoryRegion']],
    'imif_ram': [0xc20, ['MemoryRegion']],
    'emiff_ram': [0xd20, ['MemoryRegion']],
    'sdram': [0xe20, ['MemoryRegion']],
    'sram': [0xf20, ['MemoryRegion']],
    'port': [0x1020, ['array', 6, ['omap_dma_port_if_s']]],
    'sdram_size': [0x1170, ['unsigned long']],
    'sram_size': [0x1178, ['unsigned long']],
    'uart': [0x1180, ['array', 3, ['pointer', ['omap_uart_s']]]],
    'gpio': [0x1198, ['pointer', ['DeviceState']]],
    'mcbsp1': [0x11a0, ['pointer', ['omap_mcbsp_s']]],
    'mcbsp3': [0x11a8, ['pointer', ['omap_mcbsp_s']]],
    'os_timer': [0x11b0, ['pointer', ['omap_32khz_timer_s']]],
    'mmc': [0x11b8, ['pointer', ['omap_mmc_s']]],
    'mpuio': [0x11c0, ['pointer', ['omap_mpuio_s']]],
    'microwire': [0x11c8, ['pointer', ['omap_uwire_s']]],
    'pwl': [0x11d0, ['pointer', ['omap_pwl_s']]],
    'pwt': [0x11d8, ['pointer', ['omap_pwt_s']]],
    'i2c': [0x11e0, ['array', 2, ['pointer', ['DeviceState']]]],
    'rtc': [0x11f0, ['pointer', ['omap_rtc_s']]],
    'mcbsp2': [0x11f8, ['pointer', ['omap_mcbsp_s']]],
    'led': [0x1200, ['array', 2, ['pointer', ['omap_lpg_s']]]],
    'ih': [0x1210, ['array', 2, ['pointer', ['DeviceState']]]],
    'dma': [0x1220, ['pointer', ['soc_dma_s']]],
    'timer': [0x1228, ['array', 3, ['pointer', ['omap_mpu_timer_s']]]],
    'wdt': [0x1240, ['pointer', ['omap_watchdog_timer_s']]],
    'lcd': [0x1248, ['pointer', ['omap_lcd_panel_s']]],
    'ulpd_pm_regs': [0x1250, ['array', 21, ['unsigned int']]],
    'ulpd_gauge_start': [0x12a8, ['long']],
    'func_mux_ctrl': [0x12b0, ['array', 14, ['unsigned int']]],
    'comp_mode_ctrl': [0x12e8, ['array', 1, ['unsigned int']]],
    'pull_dwn_ctrl': [0x12ec, ['array', 4, ['unsigned int']]],
    'gate_inh_ctrl': [0x12fc, ['array', 1, ['unsigned int']]],
    'voltage_ctrl': [0x1300, ['array', 1, ['unsigned int']]],
    'test_dbg_ctrl': [0x1304, ['array', 1, ['unsigned int']]],
    'mod_conf_ctrl': [0x1308, ['array', 1, ['unsigned int']]],
    'compat1509': [0x130c, ['int']],
    'mpui_ctrl': [0x1310, ['unsigned int']],
    'private_tipb': [0x1318, ['pointer', ['omap_tipb_bridge_s']]],
    'public_tipb': [0x1320, ['pointer', ['omap_tipb_bridge_s']]],
    'tcmi_regs': [0x1328, ['array', 17, ['unsigned int']]],
    'dpll': [0x1370, ['array', 3, ['pointer', ['dpll_ctl_s']]]],
    'clks': [0x1388, ['pointer', ['clk']]],
    'clkm': [0x1390, ['__unnamed_0x4170']],
    'l4': [0x13b8, ['pointer', ['omap_l4_s']]],
    'gptimer': [0x13c0, ['array', 12, ['pointer', ['omap_gp_timer_s']]]],
    'synctimer': [0x1420, ['pointer', ['omap_synctimer_s']]],
    'prcm': [0x1428, ['pointer', ['omap_prcm_s']]],
    'sdrc': [0x1430, ['pointer', ['omap_sdrc_s']]],
    'gpmc': [0x1438, ['pointer', ['omap_gpmc_s']]],
    'sysc': [0x1440, ['pointer', ['omap_sysctl_s']]],
    'mcspi': [0x1448, ['array', 2, ['pointer', ['omap_mcspi_s']]]],
    'dss': [0x1458, ['pointer', ['omap_dss_s']]],
    'eac': [0x1460, ['pointer', ['omap_eac_s']]],
}],
  'bpl': [ 0x10, {
    'addr': [0x0, ['unsigned long']],
    'len': [0x8, ['unsigned int']],
    'flags': [0xc, ['unsigned int']],
}],
  'omap_sdrc_s': [ 0x110, {
    'iomem': [0x0, ['MemoryRegion']],
    'config': [0x100, ['unsigned char']],
}],
  'cast_retty_wrap<llvm::Function, llvm::Value*, llvm::Value*': [ 0x1, {
}],
  '__unnamed_0x758b': [ 0x28, {
    'count': [0x0, ['unsigned char']],
    'is_path_broken': [0x1, ['unsigned char']],
    'reserved': [0x2, ['array', 6, ['unsigned char']]],
    'sas_addr': [0x8, ['array', 4, ['unsigned long']]],
}],
  'enable_if_c<true, llvm::Instruction*': [ 0x1, {
}],
  '__unnamed_0x1cc9': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['ThreadPoolElement']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['ThreadPoolElement']]]],
}],
  '__unnamed_0x2b90': [ 0x18, {
    'addr_read': [0x0, ['unsigned int']],
    'addr_write': [0x4, ['unsigned int']],
    'addr_code': [0x8, ['unsigned int']],
    'addend': [0x10, ['unsigned long']],
}],
  'pair<llvm::StringRef, llvm::StringRef': [ 0x20, {
    'first': [0x0, ['void']],
    'second': [0x10, ['void']],
}],
  'VirtIOFeature': [ 0x10, {
    'flags': [0x0, ['unsigned int']],
    'end': [0x8, ['unsigned long']],
}],
  'bidirectional_iterator_tag': [ 0x1, {
}],
  'SDL_VideoInfo': [ 0x18, {
    'UnusedBits1': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 2}]],
    'blit_sw_CC': [0x0, ['BitField', {'end_bit': 14, 'start_bit': 13}]],
    'UnusedBits3': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 16}]],
    'UnusedBits2': [0x0, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'blit_fill': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 15}]],
    'hw_available': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'blit_hw': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'blit_sw': [0x0, ['BitField', {'end_bit': 13, 'start_bit': 12}]],
    'wm_available': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'blit_hw_CC': [0x0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'blit_hw_A': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'blit_sw_A': [0x0, ['BitField', {'end_bit': 15, 'start_bit': 14}]],
    'video_mem': [0x4, ['unsigned int']],
    'vfmt': [0x8, ['pointer', ['SDL_PixelFormat']]],
    'current_w': [0x10, ['int']],
    'current_h': [0x14, ['int']],
}],
  '__unnamed_0x2b99': [ 0x10, {
    'endpoint': [0x0, ['Enumeration', {'target': 'int', 'choices': {1: 'BDRV_FIX_LEAKS', 2: 'BDRV_FIX_ERRORS'}}]],
    'super_endpoint': [0x0, ['__unnamed_0x2a5f']],
    'bos': [0x0, ['__unnamed_0x2a98']],
    'interface': [0x0, ['__unnamed_0x29a5']],
    'device_qualifier': [0x0, ['__unnamed_0x28df']],
    'device': [0x0, ['__unnamed_0x2816']],
    'cap': [0x0, ['__unnamed_0x2b7a']],
    'config': [0x0, ['__unnamed_0x2948']],
}],
  'pandalog_header_struct': [ 0x18, {
    'version': [0x0, ['unsigned int']],
    'dir_pos': [0x8, ['unsigned long']],
    'chunk_size': [0x10, ['unsigned int']],
}],
  'XHCITransfer': [ 0xf0, {
    'epctx': [0x0, ['pointer', ['XHCIEPContext']]],
    'packet': [0x8, ['USBPacket']],
    'sgl': [0x80, ['QEMUSGList']],
    'running_async': [0xa8, ['unsigned char']],
    'running_retry': [0xa9, ['unsigned char']],
    'complete': [0xaa, ['unsigned char']],
    'int_req': [0xab, ['unsigned char']],
    'iso_pkts': [0xac, ['unsigned int']],
    'streamid': [0xb0, ['unsigned int']],
    'in_xfer': [0xb4, ['unsigned char']],
    'iso_xfer': [0xb5, ['unsigned char']],
    'timed_xfer': [0xb6, ['unsigned char']],
    'trb_count': [0xb8, ['unsigned int']],
    'trbs': [0xc0, ['pointer', ['XHCITRB']]],
    'status': [0xc8, ['Enumeration', {'target': 'int', 'choices': {0: 'CC_INVALID', 1: 'CC_SUCCESS', 2: 'CC_DATA_BUFFER_ERROR', 3: 'CC_BABBLE_DETECTED', 4: 'CC_USB_TRANSACTION_ERROR', 5: 'CC_TRB_ERROR', 6: 'CC_STALL_ERROR', 7: 'CC_RESOURCE_ERROR', 8: 'CC_BANDWIDTH_ERROR', 9: 'CC_NO_SLOTS_ERROR', 10: 'CC_INVALID_STREAM_TYPE_ERROR', 11: 'CC_SLOT_NOT_ENABLED_ERROR', 12: 'CC_EP_NOT_ENABLED_ERROR', 13: 'CC_SHORT_PACKET', 14: 'CC_RING_UNDERRUN', 15: 'CC_RING_OVERRUN', 16: 'CC_VF_ER_FULL', 17: 'CC_PARAMETER_ERROR', 18: 'CC_BANDWIDTH_OVERRUN', 19: 'CC_CONTEXT_STATE_ERROR', 20: 'CC_NO_PING_RESPONSE_ERROR', 21: 'CC_EVENT_RING_FULL_ERROR', 22: 'CC_INCOMPATIBLE_DEVICE_ERROR', 23: 'CC_MISSED_SERVICE_ERROR', 24: 'CC_COMMAND_RING_STOPPED', 25: 'CC_COMMAND_ABORTED', 26: 'CC_STOPPED', 27: 'CC_STOPPED_LENGTH_INVALID', 29: 'CC_MAX_EXIT_LATENCY_TOO_LARGE_ERROR', 31: 'CC_ISOCH_BUFFER_OVERRUN', 32: 'CC_EVENT_LOST_ERROR', 33: 'CC_UNDEFINED_ERROR', 34: 'CC_INVALID_STREAM_ID_ERROR', 35: 'CC_SECONDARY_BANDWIDTH_ERROR', 36: 'CC_SPLIT_TRANSACTION_ERROR'}}]],
    'pkts': [0xcc, ['unsigned int']],
    'pktsize': [0xd0, ['unsigned int']],
    'cur_pkt': [0xd4, ['unsigned int']],
    'mfindex_kick': [0xd8, ['unsigned long']],
    'next': [0xe0, ['__unnamed_0x3fe8']],
}],
  'DisplaySurface': [ 0x18, {
    'format': [0x0, ['Enumeration', {'target': 'int', 'choices': {67371008: 'PIXMAN_c4', 134545408: 'PIXMAN_g8', 537004714: 'PIXMAN_x2r10g10b10', 537495688: 'PIXMAN_r8g8b8a8', 67190784: 'PIXMAN_a4', 268567909: 'PIXMAN_r5g6b5', 402851976: 'PIXMAN_b8g8r8', 537462920: 'PIXMAN_r8g8b8x8', 17104896: 'PIXMAN_g1', 67244305: 'PIXMAN_a1r1g1b1', 537069704: 'PIXMAN_x8b8g8r8', 268633156: 'PIXMAN_x4b4g4r4', 134479872: 'PIXMAN_c8', 268649540: 'PIXMAN_a4b4g4r4', 67240225: 'PIXMAN_r1g2b1', 134357538: 'PIXMAN_a2r2g2b2', 537397384: 'PIXMAN_b8g8r8x8', 268571989: 'PIXMAN_a1r5g5b5', 268828672: 'PIXMAN_yuy2', 537078442: 'PIXMAN_a2b10g10r10', 537561224: 'PIXMAN_a8r8g8b8_sRGB', 134415154: 'PIXMAN_b2g3r3', 402786440: 'PIXMAN_r8g8b8', 134349618: 'PIXMAN_r3g3b2', 537430152: 'PIXMAN_b8g8r8a8', 537004168: 'PIXMAN_x8r8g8b8', 268567893: 'PIXMAN_x1r5g5b5', 268567620: 'PIXMAN_x4r4g4b4', 537036936: 'PIXMAN_a8r8g8b8', 67305761: 'PIXMAN_b1g2r1', 134423074: 'PIXMAN_a2b2g2r2', 537102472: 'PIXMAN_a8b8g8r8', 268633429: 'PIXMAN_x1b5g5r5', 67436544: 'PIXMAN_g4', 16846848: 'PIXMAN_a1', 268633445: 'PIXMAN_b5g6r5', 537003622: 'PIXMAN_x14r6g6b6', 67309841: 'PIXMAN_a1b1g1r1', 201785344: 'PIXMAN_yv12', 537012906: 'PIXMAN_a2r10g10b10', 134299648: 'PIXMAN_x4a4', 268584004: 'PIXMAN_a4r4g4b4', 134316032: 'PIXMAN_a8', 537070250: 'PIXMAN_x2b10g10r10', 268637525: 'PIXMAN_a1b5g5r5'}}]],
    'image': [0x8, ['pointer', ['pixman_image']]],
    'flags': [0x10, ['unsigned char']],
}],
  'FlushCo': [ 0x10, {
    'bs': [0x0, ['pointer', ['BlockDriverState']]],
    'ret': [0x8, ['int']],
}],
  'q_obj_NetdevNoneOptions_wrapper': [ 0x8, {
    'data': [0x0, ['pointer', ['NetdevNoneOptions']]],
}],
  '__unnamed_0x30f6': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['BdrvDirtyBitmap']]],
}],
  'smbios_type_4': [ 0x2a, {
    'header': [0x0, ['smbios_structure_header']],
    'socket_designation_str': [0x4, ['unsigned char']],
    'processor_type': [0x5, ['unsigned char']],
    'processor_family': [0x6, ['unsigned char']],
    'processor_manufacturer_str': [0x7, ['unsigned char']],
    'processor_id': [0x8, ['array', 2, ['unsigned int']]],
    'processor_version_str': [0x10, ['unsigned char']],
    'voltage': [0x11, ['unsigned char']],
    'external_clock': [0x12, ['unsigned short']],
    'max_speed': [0x14, ['unsigned short']],
    'current_speed': [0x16, ['unsigned short']],
    'status': [0x18, ['unsigned char']],
    'processor_upgrade': [0x19, ['unsigned char']],
    'l1_cache_handle': [0x1a, ['unsigned short']],
    'l2_cache_handle': [0x1c, ['unsigned short']],
    'l3_cache_handle': [0x1e, ['unsigned short']],
    'serial_number_str': [0x20, ['unsigned char']],
    'asset_tag_number_str': [0x21, ['unsigned char']],
    'part_number_str': [0x22, ['unsigned char']],
    'core_count': [0x23, ['unsigned char']],
    'core_enabled': [0x24, ['unsigned char']],
    'thread_count': [0x25, ['unsigned char']],
    'processor_characteristics': [0x26, ['unsigned short']],
    'processor_family2': [0x28, ['unsigned short']],
}],
  'ObjectPropertyIterator': [ 0x30, {
    'nextclass': [0x0, ['pointer', ['ObjectClass']]],
    'iter': [0x8, ['_GHashTableIter']],
}],
  'smbios_type_0': [ 0x18, {
    'header': [0x0, ['smbios_structure_header']],
    'vendor_str': [0x4, ['unsigned char']],
    'bios_version_str': [0x5, ['unsigned char']],
    'bios_starting_address_segment': [0x6, ['unsigned short']],
    'bios_release_date_str': [0x8, ['unsigned char']],
    'bios_rom_size': [0x9, ['unsigned char']],
    'bios_characteristics': [0xa, ['unsigned long']],
    'bios_characteristics_extension_bytes': [0x12, ['array', 2, ['unsigned char']]],
    'system_bios_major_release': [0x14, ['unsigned char']],
    'system_bios_minor_release': [0x15, ['unsigned char']],
    'embedded_controller_major_release': [0x16, ['unsigned char']],
    'embedded_controller_minor_release': [0x17, ['unsigned char']],
}],
  'smbios_type_1': [ 0x1b, {
    'header': [0x0, ['smbios_structure_header']],
    'manufacturer_str': [0x4, ['unsigned char']],
    'product_name_str': [0x5, ['unsigned char']],
    'version_str': [0x6, ['unsigned char']],
    'serial_number_str': [0x7, ['unsigned char']],
    'uuid': [0x8, ['smbios_uuid']],
    'wake_up_type': [0x18, ['unsigned char']],
    'sku_number_str': [0x19, ['unsigned char']],
    'family_str': [0x1a, ['unsigned char']],
}],
  'smbios_type_2': [ 0xf, {
    'header': [0x0, ['smbios_structure_header']],
    'manufacturer_str': [0x4, ['unsigned char']],
    'product_str': [0x5, ['unsigned char']],
    'version_str': [0x6, ['unsigned char']],
    'serial_number_str': [0x7, ['unsigned char']],
    'asset_tag_number_str': [0x8, ['unsigned char']],
    'feature_flags': [0x9, ['unsigned char']],
    'location_str': [0xa, ['unsigned char']],
    'chassis_handle': [0xb, ['unsigned short']],
    'board_type': [0xd, ['unsigned char']],
    'contained_element_count': [0xe, ['unsigned char']],
}],
  'smbios_type_3': [ 0x15, {
    'header': [0x0, ['smbios_structure_header']],
    'manufacturer_str': [0x4, ['unsigned char']],
    'type': [0x5, ['unsigned char']],
    'version_str': [0x6, ['unsigned char']],
    'serial_number_str': [0x7, ['unsigned char']],
    'asset_tag_number_str': [0x8, ['unsigned char']],
    'boot_up_state': [0x9, ['unsigned char']],
    'power_supply_state': [0xa, ['unsigned char']],
    'thermal_state': [0xb, ['unsigned char']],
    'security_status': [0xc, ['unsigned char']],
    'oem_defined': [0xd, ['unsigned int']],
    'height': [0x11, ['unsigned char']],
    'number_of_power_cords': [0x12, ['unsigned char']],
    'contained_element_count': [0x13, ['unsigned char']],
    'sku_number_str': [0x14, ['unsigned char']],
}],
  'ARMLinuxBootIf': [ 0x28, {
    'parent_obj': [0x0, ['Object']],
}],
  'elf64_phdr': [ 0x38, {
    'p_type': [0x0, ['unsigned int']],
    'p_flags': [0x4, ['unsigned int']],
    'p_offset': [0x8, ['unsigned long']],
    'p_vaddr': [0x10, ['unsigned long']],
    'p_paddr': [0x18, ['unsigned long']],
    'p_filesz': [0x20, ['unsigned long']],
    'p_memsz': [0x28, ['unsigned long']],
    'p_align': [0x30, ['unsigned long']],
}],
  '__unnamed_0x2bb6': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['DeviceListener']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['DeviceListener']]]],
}],
  '__unnamed_0xc7c': [ 0x10, {
    'le_next': [0x0, ['pointer', ['QEMUTimerList']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['QEMUTimerList']]]],
}],
  'qcrypto_nettle_hmac_alg': [ 0x20, {
    'setkey': [0x0, ['pointer', ['void']]],
    'update': [0x8, ['pointer', ['void']]],
    'digest': [0x10, ['pointer', ['void']]],
    'len': [0x18, ['unsigned long']],
}],
  '__unnamed_0xae6a': [ 0x8, {
    'qcow2': [0x0, ['q_obj_ImageInfoSpecificQCow2_wrapper']],
    'vmdk': [0x0, ['q_obj_ImageInfoSpecificVmdk_wrapper']],
    'luks': [0x0, ['q_obj_QCryptoBlockInfoLUKS_wrapper']],
}],
  'NetClientState': [ 0x170, {
    'info': [0x0, ['pointer', ['NetClientInfo']]],
    'link_down': [0x8, ['int']],
    'next': [0x10, ['__unnamed_0x1031']],
    'peer': [0x20, ['pointer', ['NetClientState']]],
    'incoming_queue': [0x28, ['pointer', ['NetQueue']]],
    'model': [0x30, ['pointer', ['char']]],
    'name': [0x38, ['pointer', ['char']]],
    'info_str': [0x40, ['array', 256, ['char']]],
    'receive_disabled': [0x140, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'destructor': [0x148, ['pointer', ['void']]],
    'queue_index': [0x150, ['unsigned int']],
    'rxfilter_notify_enabled': [0x154, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'vring_enable': [0x158, ['int']],
    'filters': [0x160, ['NetFilterHead']],
}],
  '__unnamed_0x813': [ 0x10, {
    'le_next': [0x0, ['pointer', ['QDictEntry']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['QDictEntry']]]],
}],
  'BalloonInfo': [ 0x8, {
    'actual': [0x0, ['long']],
}],
  '_Panda__DwarfCall': [ 0x40, {
    'base': [0x0, ['ProtobufCMessage']],
    'file_callee': [0x18, ['pointer', ['char']]],
    'function_name_callee': [0x20, ['pointer', ['char']]],
    'line_number_callee': [0x28, ['unsigned long']],
    'file_caller': [0x30, ['pointer', ['char']]],
    'line_number_caller': [0x38, ['unsigned long']],
}],
  'vhost_vring_addr': [ 0x28, {
    'index': [0x0, ['unsigned int']],
    'flags': [0x4, ['unsigned int']],
    'desc_user_addr': [0x8, ['unsigned long long']],
    'used_user_addr': [0x10, ['unsigned long long']],
    'avail_user_addr': [0x18, ['unsigned long long']],
    'log_guest_addr': [0x20, ['unsigned long long']],
}],
  'QEDRequest': [ 0x8, {
    'l2_table': [0x0, ['pointer', ['CachedL2Table']]],
}],
  'SCC2698Channel': [ 0x48, {
    'ipoctal': [0x0, ['pointer', ['IPOctalState']]],
    'dev': [0x8, ['CharBackend']],
    'rx_enabled': [0x38, ['unsigned char']],
    'mr': [0x39, ['array', 2, ['unsigned char']]],
    'mr_idx': [0x3b, ['unsigned char']],
    'sr': [0x3c, ['unsigned char']],
    'rhr': [0x3d, ['array', 3, ['unsigned char']]],
    'rhr_idx': [0x40, ['unsigned char']],
    'rx_pending': [0x41, ['unsigned char']],
}],
  'M25P80Class': [ 0xf0, {
    'parent_class': [0x0, ['SSISlaveClass']],
    'pi': [0xe8, ['pointer', ['FlashPartInfo']]],
}],
  'SrcBuffer': [ 0x10, {
    'Buffer': [0x0, ['pointer', ['void']]],
    'IncludeLoc': [0x8, ['void']],
}],
  'TraceEventInfo': [ 0x10, {
    'name': [0x0, ['pointer', ['char']]],
    'state': [0x8, ['Enumeration', {'target': 'int', 'choices': {0: 'TRACE_EVENT_STATE_UNAVAILABLE', 1: 'TRACE_EVENT_STATE_DISABLED', 2: 'TRACE_EVENT_STATE_ENABLED', 3: 'TRACE_EVENT_STATE__MAX'}}]],
    'vcpu': [0xc, ['unsigned char']],
}],
  '_XkbISOAction': [ 0x8, {
    'type': [0x0, ['unsigned char']],
    'flags': [0x1, ['unsigned char']],
    'mask': [0x2, ['unsigned char']],
    'real_mods': [0x3, ['unsigned char']],
    'group_XXX': [0x4, ['char']],
    'affect': [0x5, ['unsigned char']],
    'vmods1': [0x6, ['unsigned char']],
    'vmods2': [0x7, ['unsigned char']],
}],
  'VncClientInfo': [ 0x30, {
    'host': [0x0, ['pointer', ['char']]],
    'service': [0x8, ['pointer', ['char']]],
    'family': [0x10, ['Enumeration', {'target': 'int', 'choices': {0: 'NETWORK_ADDRESS_FAMILY_IPV4', 1: 'NETWORK_ADDRESS_FAMILY_IPV6', 2: 'NETWORK_ADDRESS_FAMILY_UNIX', 3: 'NETWORK_ADDRESS_FAMILY_VSOCK', 4: 'NETWORK_ADDRESS_FAMILY_UNKNOWN', 5: 'NETWORK_ADDRESS_FAMILY__MAX'}}]],
    'websocket': [0x14, ['unsigned char']],
    'has_x509_dname': [0x15, ['unsigned char']],
    'x509_dname': [0x18, ['pointer', ['char']]],
    'has_sasl_username': [0x20, ['unsigned char']],
    'sasl_username': [0x28, ['pointer', ['char']]],
}],
  'USBDescMSOS': [ 0x18, {
    'CompatibleID': [0x0, ['pointer', ['char']]],
    'Label': [0x8, ['pointer', ['int']]],
    'SelectiveSuspendEnabled': [0x10, ['unsigned char']],
}],
  'Property': [ 0x40, {
    'name': [0x0, ['pointer', ['char']]],
    'info': [0x8, ['pointer', ['PropertyInfo']]],
    'offset': [0x10, ['long']],
    'bitnr': [0x18, ['unsigned char']],
    'qtype': [0x1c, ['Enumeration', {'target': 'int', 'choices': {0: 'QTYPE_NONE', 1: 'QTYPE_QNULL', 2: 'QTYPE_QINT', 3: 'QTYPE_QSTRING', 4: 'QTYPE_QDICT', 5: 'QTYPE_QLIST', 6: 'QTYPE_QFLOAT', 7: 'QTYPE_QBOOL', 8: 'QTYPE__MAX'}}]],
    'defval': [0x20, ['long']],
    'arrayoffset': [0x28, ['int']],
    'arrayinfo': [0x30, ['pointer', ['PropertyInfo']]],
    'arrayfieldsize': [0x38, ['int']],
}],
  'cast_retty<llvm::FunctionType, llvm::Type*': [ 0x1, {
}],
  'VirtIOCryptoPCI': [ 0x8560, {
    'parent_obj': [0x0, ['VirtIOPCIProxy']],
    'vdev': [0x8410, ['VirtIOCrypto']],
}],
  'QXLInterface': [ 0x90, {
    'base': [0x0, ['SpiceBaseInterface']],
    'attache_worker': [0x18, ['pointer', ['void']]],
    'set_compression_level': [0x20, ['pointer', ['void']]],
    'set_mm_time': [0x28, ['pointer', ['void']]],
    'get_init_info': [0x30, ['pointer', ['void']]],
    'get_command': [0x38, ['pointer', ['void']]],
    'req_cmd_notification': [0x40, ['pointer', ['void']]],
    'release_resource': [0x48, ['pointer', ['void']]],
    'get_cursor_command': [0x50, ['pointer', ['void']]],
    'req_cursor_notification': [0x58, ['pointer', ['void']]],
    'notify_update': [0x60, ['pointer', ['void']]],
    'flush_resources': [0x68, ['pointer', ['void']]],
    'async_complete': [0x70, ['pointer', ['void']]],
    'update_area_complete': [0x78, ['pointer', ['void']]],
    'set_client_capabilities': [0x80, ['pointer', ['void']]],
    'client_monitors_config': [0x88, ['pointer', ['void']]],
}],
  'pair<std::_Rb_tree_iterator<std::pair<const llvm::Function* const, long int': [ 0x10, {
    'first': [0x0, ['_Rb_tree_iterator<std::pair<const llvm::Function* const, long int']],
    'second': [0x8, ['_Rb_tree_iterator<std::pair<const llvm::Function* const, long int']],
}],
  'BlockDeviceTimedStatsList': [ 0x10, {
    'next': [0x0, ['pointer', ['BlockDeviceTimedStatsList']]],
    'value': [0x8, ['pointer', ['BlockDeviceTimedStats']]],
}],
  '__unnamed_0xc71': [ 0x8, {
    's': [0x0, ['long']],
    'u': [0x0, ['unsigned long']],
}],
  'rdnss': [ 0x16, {
    'reserved': [0x0, ['unsigned short']],
    'lifetime': [0x2, ['unsigned int']],
    'addr': [0x6, ['in6_addr']],
}],
  'virtio_crypto_hash_para': [ 0x8, {
    'src_data_len': [0x0, ['unsigned int']],
    'hash_result_len': [0x4, ['unsigned int']],
}],
  'VHDXMetadataEntries': [ 0xc2, {
    'file_parameters_entry': [0x0, ['VHDXMetadataTableEntry']],
    'virtual_disk_size_entry': [0x20, ['VHDXMetadataTableEntry']],
    'page83_data_entry': [0x40, ['VHDXMetadataTableEntry']],
    'logical_sector_size_entry': [0x60, ['VHDXMetadataTableEntry']],
    'phys_sector_size_entry': [0x80, ['VHDXMetadataTableEntry']],
    'parent_locator_entry': [0xa0, ['VHDXMetadataTableEntry']],
    'present': [0xc0, ['unsigned short']],
}],
  '__unnamed_0xc78': [ 0x24, {
    'ti_i6': [0x0, ['__unnamed_0xc3f']],
    'ti_i4': [0x0, ['__unnamed_0xc06']],
}],
  '__unnamed_0x894': [ 0x10, {
    'le_next': [0x0, ['pointer', ['rcu_reader_data']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['rcu_reader_data']]]],
}],
  'scsi_readcapacity10': [ 0x8, {
    'lba': [0x0, ['unsigned int']],
    'block_size': [0x4, ['unsigned int']],
}],
  'pflash_t': [ 0x5c0, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'blk': [0x300, ['pointer', ['BlockBackend']]],
    'sector_len': [0x308, ['unsigned int']],
    'nb_blocs': [0x30c, ['unsigned int']],
    'chip_len': [0x310, ['unsigned int']],
    'mappings': [0x314, ['unsigned char']],
    'width': [0x315, ['unsigned char']],
    'be': [0x316, ['unsigned char']],
    'wcycle': [0x318, ['int']],
    'bypass': [0x31c, ['int']],
    'ro': [0x320, ['int']],
    'cmd': [0x324, ['unsigned char']],
    'status': [0x325, ['unsigned char']],
    'ident0': [0x326, ['unsigned short']],
    'ident1': [0x328, ['unsigned short']],
    'ident2': [0x32a, ['unsigned short']],
    'ident3': [0x32c, ['unsigned short']],
    'unlock_addr0': [0x32e, ['unsigned short']],
    'unlock_addr1': [0x330, ['unsigned short']],
    'cfi_len': [0x332, ['unsigned char']],
    'cfi_table': [0x333, ['array', 82, ['unsigned char']]],
    'timer': [0x388, ['pointer', ['QEMUTimer']]],
    'mem': [0x390, ['MemoryRegion']],
    'mem_mappings': [0x490, ['pointer', ['MemoryRegion']]],
    'orig_mem': [0x4a0, ['MemoryRegion']],
    'rom_mode': [0x5a0, ['int']],
    'read_counter': [0x5a4, ['int']],
    'name': [0x5a8, ['pointer', ['char']]],
    'storage': [0x5b0, ['pointer', ['void']]],
}],
  'StreamBlockJob': [ 0xf0, {
    'common': [0x0, ['BlockJob']],
    'limit': [0xa8, ['__unnamed_0x3f6f']],
    'base': [0xd0, ['pointer', ['BlockDriverState']]],
    'on_error': [0xd8, ['Enumeration', {'target': 'int', 'choices': {0: 'BLOCKDEV_ON_ERROR_REPORT', 1: 'BLOCKDEV_ON_ERROR_IGNORE', 2: 'BLOCKDEV_ON_ERROR_ENOSPC', 3: 'BLOCKDEV_ON_ERROR_STOP', 4: 'BLOCKDEV_ON_ERROR_AUTO', 5: 'BLOCKDEV_ON_ERROR__MAX'}}]],
    'backing_file_str': [0xe0, ['pointer', ['char']]],
    'bs_flags': [0xe8, ['int']],
}],
  'scsi_readcapacity16': [ 0x18, {
    'returned_lba': [0x0, ['unsigned long']],
    'block_length': [0x8, ['unsigned int']],
    'p_type': [0xc, ['unsigned char']],
    'prot_en': [0xd, ['unsigned char']],
    'p_i_exp': [0xe, ['unsigned char']],
    'lbppbe': [0xf, ['unsigned char']],
    'lbpme': [0x10, ['unsigned char']],
    'lbprz': [0x11, ['unsigned char']],
    'lalba': [0x12, ['unsigned short']],
}],
  'CPUAddressSpace': [ 0xb8, {
    'cpu': [0x0, ['pointer', ['CPUState']]],
    'as': [0x8, ['pointer', ['AddressSpace']]],
    'memory_dispatch': [0x10, ['pointer', ['AddressSpaceDispatch']]],
    'tcg_as_listener': [0x18, ['MemoryListener']],
}],
  'rcu_reader_data': [ 0x20, {
    'ctr': [0x0, ['unsigned long']],
    'waiting': [0x8, ['unsigned char']],
    'depth': [0xc, ['unsigned int']],
    'node': [0x10, ['__unnamed_0x894']],
}],
  'RAMBlockNotifier': [ 0x20, {
    'ram_block_added': [0x0, ['pointer', ['void']]],
    'ram_block_removed': [0x8, ['pointer', ['void']]],
    'next': [0x10, ['__unnamed_0x2143']],
}],
  'usb_redir_configuration_status_header': [ 0x2, {
    'status': [0x0, ['unsigned char']],
    'configuration': [0x1, ['unsigned char']],
}],
  'AcpiMcfgAllocation': [ 0x10, {
    'address': [0x0, ['unsigned long']],
    'pci_segment': [0x8, ['unsigned short']],
    'start_bus_number': [0xa, ['unsigned char']],
    'end_bus_number': [0xb, ['unsigned char']],
    'reserved': [0xc, ['unsigned int']],
}],
  '_XkbSymInterpretRec': [ 0x18, {
    'sym': [0x0, ['unsigned long']],
    'flags': [0x8, ['unsigned char']],
    'match': [0x9, ['unsigned char']],
    'mods': [0xa, ['unsigned char']],
    'virtual_mod': [0xb, ['unsigned char']],
    'act': [0xc, ['_XkbAnyAction']],
}],
  'vpb_sic_state': [ 0x520, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'level': [0x400, ['unsigned int']],
    'mask': [0x404, ['unsigned int']],
    'pic_enable': [0x408, ['unsigned int']],
    'parent': [0x410, ['array', 32, ['pointer', ['IRQState']]]],
    'irq': [0x510, ['int']],
}],
  'GuestPhysListener': [ 0xa8, {
    'list': [0x0, ['pointer', ['GuestPhysBlockList']]],
    'listener': [0x8, ['MemoryListener']],
}],
  'ZynqSLCRState': [ 0x1400, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'regs': [0x400, ['array', 1024, ['unsigned int']]],
}],
  'AC97LinkState': [ 0xd10, {
    'dev': [0x0, ['PCIDevice']],
    'card': [0x8f0, ['QEMUSoundCard']],
    'use_broken_id': [0x908, ['unsigned int']],
    'glob_cnt': [0x90c, ['unsigned int']],
    'glob_sta': [0x910, ['unsigned int']],
    'cas': [0x914, ['unsigned int']],
    'last_samp': [0x918, ['unsigned int']],
    'bm_regs': [0x91c, ['array', 3, ['AC97BusMasterRegs']]],
    'mixer_data': [0x964, ['array', 256, ['unsigned char']]],
    'voice_pi': [0xa68, ['pointer', ['SWVoiceIn']]],
    'voice_po': [0xa70, ['pointer', ['SWVoiceOut']]],
    'voice_mc': [0xa78, ['pointer', ['SWVoiceIn']]],
    'invalid_freq': [0xa80, ['array', 3, ['int']]],
    'silence': [0xa8c, ['array', 128, ['unsigned char']]],
    'bup_flag': [0xb0c, ['int']],
    'io_nam': [0xb10, ['MemoryRegion']],
    'io_nabm': [0xc10, ['MemoryRegion']],
}],
  'AddfdInfo': [ 0x10, {
    'fdset_id': [0x0, ['long']],
    'fd': [0x8, ['long']],
}],
  '__unnamed_0x4c41': [ 0x4, {
    'control': [0x0, ['unsigned char']],
    'config': [0x2, ['unsigned short']],
}],
  'rndis_set_msg_type': [ 0x1c, {
    'MessageType': [0x0, ['unsigned int']],
    'MessageLength': [0x4, ['unsigned int']],
    'RequestID': [0x8, ['unsigned int']],
    'OID': [0xc, ['unsigned int']],
    'InformationBufferLength': [0x10, ['unsigned int']],
    'InformationBufferOffset': [0x14, ['unsigned int']],
    'DeviceVcHandle': [0x18, ['unsigned int']],
}],
  '__is_normal_iterator<long int*': [ 0x1, {
}],
  'q_obj_NetdevBridgeOptions_wrapper': [ 0x8, {
    'data': [0x0, ['pointer', ['NetdevBridgeOptions']]],
}],
  'q_obj_change_backing_file_arg': [ 0x18, {
    'device': [0x0, ['pointer', ['char']]],
    'image_node_name': [0x8, ['pointer', ['char']]],
    'backing_file': [0x10, ['pointer', ['char']]],
}],
  'SaveState': [ 0x30, {
    'handlers': [0x0, ['__unnamed_0x492a']],
    'global_section_id': [0x10, ['int']],
    'skip_configuration': [0x14, ['unsigned char']],
    'len': [0x18, ['unsigned int']],
    'name': [0x20, ['pointer', ['char']]],
    'target_page_bits': [0x28, ['unsigned int']],
}],
  'BlockdevOptionsReplication': [ 0x18, {
    'file': [0x0, ['pointer', ['BlockdevRef']]],
    'mode': [0x8, ['Enumeration', {'target': 'int', 'choices': {0: 'REPLICATION_MODE_PRIMARY', 1: 'REPLICATION_MODE_SECONDARY', 2: 'REPLICATION_MODE__MAX'}}]],
    'has_top_id': [0xc, ['unsigned char']],
    'top_id': [0x10, ['pointer', ['char']]],
}],
  '__unnamed_0x33b2': [ 0x18, {
    'error': [0x0, ['int']],
    'immediately': [0x4, ['int']],
    'once': [0x8, ['int']],
    'offset': [0x10, ['long']],
}],
  '__unnamed_0x2143': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['BusState']]],
}],
  'add_lvalue_reference_if_not_pointer<const llvm::Type*, void': [ 0x1, {
}],
  'RAMList': [ 0x60, {
    'mutex': [0x0, ['QemuMutex']],
    'mru_block': [0x28, ['pointer', ['RAMBlock']]],
    'blocks': [0x30, ['__unnamed_0x2091']],
    'dirty_memory': [0x38, ['array', 3, ['pointer', ['__unnamed_0x2056']]]],
    'version': [0x50, ['unsigned int']],
    'ramblock_notifiers': [0x58, ['__unnamed_0x20ac']],
}],
  'XgmacState': [ 0x3460, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'sbd_irq': [0x400, ['pointer', ['IRQState']]],
    'pmt_irq': [0x408, ['pointer', ['IRQState']]],
    'mci_irq': [0x410, ['pointer', ['IRQState']]],
    'nic': [0x418, ['pointer', ['NICState']]],
    'conf': [0x420, ['NICConf']],
    'stats': [0x2438, ['RxTxStats']],
    'regs': [0x2460, ['array', 1024, ['unsigned int']]],
}],
  'A9SCUState': [ 0x410, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'control': [0x400, ['unsigned int']],
    'status': [0x404, ['unsigned int']],
    'num_cpu': [0x408, ['unsigned int']],
}],
  'mig_cmd_args': [ 0x10, {
    'len': [0x0, ['long']],
    'name': [0x8, ['pointer', ['char']]],
}],
  'cast_retty_impl<llvm::Constant, llvm::Value*': [ 0x1, {
}],
  '_XkbIndicatorRec': [ 0x188, {
    'phys_indicators': [0x0, ['unsigned long']],
    'maps': [0x8, ['array', 32, ['_XkbIndicatorMapRec']]],
}],
  'of_dpa_flow_fill_context': [ 0x10, {
    'list': [0x0, ['pointer', ['RockerOfDpaFlowList']]],
    'tbl_id': [0x8, ['unsigned int']],
}],
  'QIOChannelSocketDGramWorkerData': [ 0x10, {
    'localAddr': [0x0, ['pointer', ['SocketAddress']]],
    'remoteAddr': [0x8, ['pointer', ['SocketAddress']]],
}],
  'StrongARMSSPState': [ 0x430, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'irq': [0x400, ['pointer', ['IRQState']]],
    'bus': [0x408, ['pointer', ['SSIBus']]],
    'sscr': [0x410, ['array', 2, ['unsigned short']]],
    'sssr': [0x414, ['unsigned short']],
    'rx_fifo': [0x416, ['array', 8, ['unsigned short']]],
    'rx_level': [0x426, ['unsigned char']],
    'rx_start': [0x427, ['unsigned char']],
}],
  '__unnamed_0x106f': [ 0x28, {
    'saddr': [0x0, ['io_iocb_sockaddr']],
    'c': [0x0, ['io_iocb_common']],
    'poll': [0x0, ['io_iocb_poll']],
    'v': [0x0, ['io_iocb_vector']],
}],
  'VirtIORngPCI': [ 0x8540, {
    'parent_obj': [0x0, ['VirtIOPCIProxy']],
    'vdev': [0x8410, ['VirtIORNG']],
}],
  'bmds_list': [ 0x10, {
    'sqh_first': [0x0, ['pointer', ['BlkMigDevState']]],
    'sqh_last': [0x8, ['pointer', ['pointer', ['BlkMigDevState']]]],
}],
  'usb_redir_alt_setting_status_header': [ 0x3, {
    'status': [0x0, ['unsigned char']],
    'interface': [0x1, ['unsigned char']],
    'alt': [0x2, ['unsigned char']],
}],
  'icmp': [ 0x1c, {
    'icmp_type': [0x0, ['unsigned char']],
    'icmp_code': [0x1, ['unsigned char']],
    'icmp_cksum': [0x2, ['unsigned short']],
    'icmp_hun': [0x4, ['__unnamed_0x1248']],
    'icmp_dun': [0x8, ['__unnamed_0x12d2']],
}],
  'STM32F2XXTimerState': [ 0x470, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'timer': [0x400, ['pointer', ['QEMUTimer']]],
    'irq': [0x408, ['pointer', ['IRQState']]],
    'tick_offset': [0x410, ['long']],
    'hit_time': [0x418, ['unsigned long']],
    'freq_hz': [0x420, ['unsigned long']],
    'tim_cr1': [0x428, ['unsigned int']],
    'tim_cr2': [0x42c, ['unsigned int']],
    'tim_smcr': [0x430, ['unsigned int']],
    'tim_dier': [0x434, ['unsigned int']],
    'tim_sr': [0x438, ['unsigned int']],
    'tim_egr': [0x43c, ['unsigned int']],
    'tim_ccmr1': [0x440, ['unsigned int']],
    'tim_ccmr2': [0x444, ['unsigned int']],
    'tim_ccer': [0x448, ['unsigned int']],
    'tim_psc': [0x44c, ['unsigned int']],
    'tim_arr': [0x450, ['unsigned int']],
    'tim_ccr1': [0x454, ['unsigned int']],
    'tim_ccr2': [0x458, ['unsigned int']],
    'tim_ccr3': [0x45c, ['unsigned int']],
    'tim_ccr4': [0x460, ['unsigned int']],
    'tim_dcr': [0x464, ['unsigned int']],
    'tim_dmar': [0x468, ['unsigned int']],
    'tim_or': [0x46c, ['unsigned int']],
}],
  'NetLegacyNicOptions': [ 0x48, {
    'has_netdev': [0x0, ['unsigned char']],
    'netdev': [0x8, ['pointer', ['char']]],
    'has_macaddr': [0x10, ['unsigned char']],
    'macaddr': [0x18, ['pointer', ['char']]],
    'has_model': [0x20, ['unsigned char']],
    'model': [0x28, ['pointer', ['char']]],
    'has_addr': [0x30, ['unsigned char']],
    'addr': [0x38, ['pointer', ['char']]],
    'has_vectors': [0x40, ['unsigned char']],
    'vectors': [0x44, ['unsigned int']],
}],
  'uint64List': [ 0x10, {
    'next': [0x0, ['pointer', ['uint64List']]],
    'value': [0x8, ['unsigned long']],
}],
  'mfi_ld_params': [ 0x20, {
    'primary_raid_level': [0x0, ['unsigned char']],
    'raid_level_qualifier': [0x1, ['unsigned char']],
    'secondary_raid_level': [0x2, ['unsigned char']],
    'stripe_size': [0x3, ['unsigned char']],
    'num_drives': [0x4, ['unsigned char']],
    'span_depth': [0x5, ['unsigned char']],
    'state': [0x6, ['unsigned char']],
    'init_state': [0x7, ['unsigned char']],
    'is_consistent': [0x8, ['unsigned char']],
    'reserved': [0x9, ['array', 23, ['unsigned char']]],
}],
  'AcpiDeviceIf': [ 0x28, {
    'Parent': [0x0, ['Object']],
}],
  'AHCICmdHdr': [ 0x20, {
    'opts': [0x0, ['unsigned short']],
    'prdtl': [0x2, ['unsigned short']],
    'status': [0x4, ['unsigned int']],
    'tbl_addr': [0x8, ['unsigned long']],
    'reserved': [0x10, ['array', 4, ['unsigned int']]],
}],
  'iterator_traits<llvm::Type* const*': [ 0x1, {
}],
  'ProtobufCMessage': [ 0x18, {
    'descriptor': [0x0, ['pointer', ['ProtobufCMessageDescriptor']]],
    'n_unknown_fields': [0x8, ['unsigned int']],
    'unknown_fields': [0x10, ['pointer', ['ProtobufCMessageUnknownField']]],
}],
  'BDRVCURLState': [ 0x1098, {
    'multi': [0x0, ['pointer', 'void']],
    'timer': [0x8, ['QEMUTimer']],
    'len': [0x38, ['unsigned long']],
    'states': [0x40, ['array', 8, ['CURLState']]],
    'url': [0x1040, ['pointer', ['char']]],
    'readahead_size': [0x1048, ['unsigned long']],
    'sslverify': [0x1050, ['unsigned char']],
    'timeout': [0x1058, ['unsigned long']],
    'cookie': [0x1060, ['pointer', ['char']]],
    'accept_range': [0x1068, ['unsigned char']],
    'aio_context': [0x1070, ['pointer', ['AioContext']]],
    'username': [0x1078, ['pointer', ['char']]],
    'password': [0x1080, ['pointer', ['char']]],
    'proxyusername': [0x1088, ['pointer', ['char']]],
    'proxypassword': [0x1090, ['pointer', ['char']]],
}],
  'elf32_phdr': [ 0x20, {
    'p_type': [0x0, ['unsigned int']],
    'p_offset': [0x4, ['unsigned int']],
    'p_vaddr': [0x8, ['unsigned int']],
    'p_paddr': [0xc, ['unsigned int']],
    'p_filesz': [0x10, ['unsigned int']],
    'p_memsz': [0x14, ['unsigned int']],
    'p_flags': [0x18, ['unsigned int']],
    'p_align': [0x1c, ['unsigned int']],
}],
  'VirtIONet': [ 0x21d0, {
    'parent_obj': [0x0, ['VirtIODevice']],
    'mac': [0xe8, ['array', 6, ['unsigned char']]],
    'status': [0xee, ['unsigned short']],
    'vqs': [0xf0, ['pointer', ['VirtIONetQueue']]],
    'ctrl_vq': [0xf8, ['pointer', ['VirtQueue']]],
    'nic': [0x100, ['pointer', ['NICState']]],
    'tx_timeout': [0x108, ['unsigned int']],
    'tx_burst': [0x10c, ['int']],
    'has_vnet_hdr': [0x110, ['unsigned int']],
    'host_hdr_len': [0x118, ['unsigned long']],
    'guest_hdr_len': [0x120, ['unsigned long']],
    'host_features': [0x128, ['unsigned int']],
    'has_ufo': [0x12c, ['unsigned char']],
    'mergeable_rx_bufs': [0x130, ['int']],
    'promisc': [0x134, ['unsigned char']],
    'allmulti': [0x135, ['unsigned char']],
    'alluni': [0x136, ['unsigned char']],
    'nomulti': [0x137, ['unsigned char']],
    'nouni': [0x138, ['unsigned char']],
    'nobcast': [0x139, ['unsigned char']],
    'vhost_started': [0x13a, ['unsigned char']],
    'mac_table': [0x140, ['__unnamed_0x6fb6']],
    'vlans': [0x158, ['pointer', ['unsigned int']]],
    'net_conf': [0x160, ['virtio_net_conf']],
    'nic_conf': [0x178, ['NICConf']],
    'qdev': [0x2190, ['pointer', ['DeviceState']]],
    'multiqueue': [0x2198, ['int']],
    'max_queues': [0x219c, ['unsigned short']],
    'curr_queues': [0x219e, ['unsigned short']],
    'config_size': [0x21a0, ['unsigned long']],
    'netclient_name': [0x21a8, ['pointer', ['char']]],
    'netclient_type': [0x21b0, ['pointer', ['char']]],
    'curr_guest_offloads': [0x21b8, ['unsigned long']],
    'announce_timer': [0x21c0, ['pointer', ['QEMUTimer']]],
    'announce_counter': [0x21c8, ['int']],
    'needs_vnet_hdr_swap': [0x21cc, ['unsigned char']],
}],
  'VncRectStat': [ 0xb8, {
    'times': [0x0, ['array', 10, ['timeval']]],
    'idx': [0xa0, ['int']],
    'freq': [0xa8, ['double']],
    'updated': [0xb0, ['unsigned char']],
}],
  '__unnamed_0x1be5': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['Chardev']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['Chardev']]]],
}],
  'q_obj_BLOCK_WRITE_THRESHOLD_arg': [ 0x18, {
    'node_name': [0x0, ['pointer', ['char']]],
    'amount_exceeded': [0x8, ['unsigned long']],
    'write_threshold': [0x10, ['unsigned long']],
}],
  'QXLCommandExt': [ 0x18, {
    'cmd': [0x0, ['QXLCommand']],
    'group_id': [0x10, ['unsigned int']],
    'flags': [0x14, ['unsigned int']],
}],
  '__unnamed_0x411f': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['DriveInfo']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['DriveInfo']]]],
}],
  'SHPCDevice': [ 0x140, {
    'cap': [0x0, ['int']],
    'nslots': [0x4, ['int']],
    'config': [0x8, ['pointer', ['unsigned char']]],
    'cmask': [0x10, ['pointer', ['unsigned char']]],
    'wmask': [0x18, ['pointer', ['unsigned char']]],
    'w1cmask': [0x20, ['pointer', ['unsigned char']]],
    'mmio': [0x30, ['MemoryRegion']],
    'sec_bus': [0x130, ['pointer', ['PCIBus']]],
    'msi_requested': [0x138, ['int']],
}],
  'VirtIOPCIProxy': [ 0x8410, {
    'pci_dev': [0x0, ['PCIDevice']],
    'bar': [0x8f0, ['MemoryRegion']],
    'common': [0x9f0, ['VirtIOPCIRegion']],
    'isr': [0xb00, ['VirtIOPCIRegion']],
    'device': [0xc10, ['VirtIOPCIRegion']],
    'notify': [0xd20, ['VirtIOPCIRegion']],
    'notify_pio': [0xe30, ['VirtIOPCIRegion']],
    'modern_bar': [0xf40, ['MemoryRegion']],
    'io_bar': [0x1040, ['MemoryRegion']],
    'modern_cfg': [0x1140, ['MemoryRegion']],
    'modern_as': [0x1240, ['AddressSpace']],
    'legacy_io_bar_idx': [0x1350, ['unsigned int']],
    'msix_bar_idx': [0x1354, ['unsigned int']],
    'modern_io_bar_idx': [0x1358, ['unsigned int']],
    'modern_mem_bar_idx': [0x135c, ['unsigned int']],
    'config_cap': [0x1360, ['int']],
    'flags': [0x1364, ['unsigned int']],
    'disable_modern': [0x1368, ['unsigned char']],
    'ignore_backend_features': [0x1369, ['unsigned char']],
    'disable_legacy': [0x136c, ['Enumeration', {'target': 'int', 'choices': {0: 'ON_OFF_AUTO_AUTO', 1: 'ON_OFF_AUTO_ON', 2: 'ON_OFF_AUTO_OFF', 3: 'ON_OFF_AUTO__MAX'}}]],
    'class_code': [0x1370, ['unsigned int']],
    'nvectors': [0x1374, ['unsigned int']],
    'dfselect': [0x1378, ['unsigned int']],
    'gfselect': [0x137c, ['unsigned int']],
    'guest_features': [0x1380, ['array', 2, ['unsigned int']]],
    'vqs': [0x1388, ['array', 1024, ['VirtIOPCIQueue']]],
    'vector_irqfd': [0x8388, ['pointer', ['__unnamed_0xa2ca']]],
    'nvqs_with_notifiers': [0x8390, ['int']],
    'bus': [0x8398, ['VirtioBusState']],
}],
  'SnapshotInfoList': [ 0x10, {
    'next': [0x0, ['pointer', ['SnapshotInfoList']]],
    'value': [0x8, ['pointer', ['SnapshotInfo']]],
}],
  'q_obj_BLOCK_JOB_COMPLETED_arg': [ 0x38, {
    'type': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'BLOCK_JOB_TYPE_COMMIT', 1: 'BLOCK_JOB_TYPE_STREAM', 2: 'BLOCK_JOB_TYPE_MIRROR', 3: 'BLOCK_JOB_TYPE_BACKUP', 4: 'BLOCK_JOB_TYPE__MAX'}}]],
    'device': [0x8, ['pointer', ['char']]],
    'len': [0x10, ['long']],
    'offset': [0x18, ['long']],
    'speed': [0x20, ['long']],
    'has_error': [0x28, ['unsigned char']],
    'error': [0x30, ['pointer', ['char']]],
}],
  'enable_if_c<true, llvm::Value*': [ 0x1, {
}],
  '__unnamed_0x201d': [ 0x84, {
    'quantval': [0x0, ['array', 64, ['unsigned short']]],
    'sent_table': [0x80, ['int']],
}],
  '__unnamed_0x1d0b': [ 0x220, {
    'inquire': [0x0, ['int']],
    'periodic': [0x4, ['int']],
    'responses_left': [0x8, ['int']],
    'responses': [0xc, ['int']],
    'inquiry_done': [0x10, ['pointer', ['QEMUTimer']]],
    'inquiry_next': [0x18, ['pointer', ['QEMUTimer']]],
    'inquiry_length': [0x20, ['int']],
    'inquiry_period': [0x24, ['int']],
    'inquiry_mode': [0x28, ['int']],
    'handle': [0x30, ['array', 16, ['bt_hci_master_link_s']]],
    'role_bmp': [0x1b0, ['unsigned int']],
    'last_handle': [0x1b4, ['int']],
    'connecting': [0x1b8, ['int']],
    'awaiting_bdaddr': [0x1bc, ['array', 16, ['__unnamed_0xa1b']]],
}],
  'PCIEAERLog': [ 0x10, {
    'log_num': [0x0, ['unsigned short']],
    'log_max': [0x2, ['unsigned short']],
    'log': [0x8, ['pointer', ['PCIEAERErr']]],
}],
  'SheepdogVdiReq': [ 0x30, {
    'proto_ver': [0x0, ['unsigned char']],
    'opcode': [0x1, ['unsigned char']],
    'flags': [0x2, ['unsigned short']],
    'epoch': [0x4, ['unsigned int']],
    'id': [0x8, ['unsigned int']],
    'data_length': [0xc, ['unsigned int']],
    'vdi_size': [0x10, ['unsigned long']],
    'base_vdi_id': [0x18, ['unsigned int']],
    'copies': [0x1c, ['unsigned char']],
    'copy_policy': [0x1d, ['unsigned char']],
    'store_policy': [0x1e, ['unsigned char']],
    'block_size_shift': [0x1f, ['unsigned char']],
    'snapid': [0x20, ['unsigned int']],
    'type': [0x24, ['unsigned int']],
    'pad': [0x28, ['array', 2, ['unsigned int']]],
}],
  'q_obj_transaction_arg': [ 0x18, {
    'actions': [0x0, ['pointer', ['TransactionActionList']]],
    'has_properties': [0x8, ['unsigned char']],
    'properties': [0x10, ['pointer', ['TransactionProperties']]],
}],
  'ip6_header': [ 0x28, {
    'ip6_ctlun': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'IF_IDE', 1: 'IF_NONE', 2: 'IF_SCSI', 3: 'IF_FLOPPY', 4: 'IF_PFLASH', 5: 'IF_MTD', 6: 'IF_SD', 7: 'IF_VIRTIO', 8: 'IF_XEN', 9: 'IF_COUNT', 18446744073709551615L: 'IF_DEFAULT'}}]],
    'ip6_src': [0x8, ['in6_address']],
    'ip6_dst': [0x18, ['in6_address']],
}],
  '_XkbMessageAction': [ 0x8, {
    'type': [0x0, ['unsigned char']],
    'flags': [0x1, ['unsigned char']],
    'message': [0x2, ['array', 6, ['unsigned char']]],
}],
  'vfio_irq_set': [ 0x14, {
    'argsz': [0x0, ['unsigned int']],
    'flags': [0x4, ['unsigned int']],
    'index': [0x8, ['unsigned int']],
    'start': [0xc, ['unsigned int']],
    'count': [0x10, ['unsigned int']],
    'data': [0x14, ['array', 0, ['unsigned char']]],
}],
  '__unnamed_0x729': [ 0x8, {
    'ru_maxrss': [0x0, ['long']],
    '__ru_maxrss_word': [0x0, ['long']],
}],
  'MegasasInfo': [ 0x48, {
    'name': [0x0, ['pointer', ['char']]],
    'desc': [0x8, ['pointer', ['char']]],
    'product_name': [0x10, ['pointer', ['char']]],
    'product_version': [0x18, ['pointer', ['char']]],
    'device_id': [0x20, ['unsigned short']],
    'subsystem_id': [0x22, ['unsigned short']],
    'ioport_bar': [0x24, ['int']],
    'mmio_bar': [0x28, ['int']],
    'is_express': [0x2c, ['unsigned char']],
    'osts': [0x30, ['int']],
    'vmsd': [0x38, ['pointer', ['VMStateDescription']]],
    'props': [0x40, ['pointer', ['Property']]],
}],
  'VncRectEntry': [ 0x20, {
    'rect': [0x0, ['VncRect']],
    'next': [0x10, ['__unnamed_0x2589']],
}],
  'timezone': [ 0x8, {
    'tz_minuteswest': [0x0, ['int']],
    'tz_dsttime': [0x4, ['int']],
}],
  'MemTxAttrs': [ 0x4, {
    'requester_id': [0x0, ['BitField', {'end_bit': 19, 'start_bit': 3}]],
    'secure': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'unspecified': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'user': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
}],
  '__unnamed_0xdb8b': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['ImageEntry']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['ImageEntry']]]],
}],
  'VirtConsole': [ 0x108, {
    'parent_obj': [0x0, ['VirtIOSerialPort']],
    'chr': [0xd0, ['CharBackend']],
    'watch': [0x100, ['unsigned int']],
}],
  '__unnamed_0x1891': [ 0x8, {
    'i': [0x0, ['unsigned long']],
    'p': [0x0, ['pointer', ['void']]],
}],
  'PXA2xxGPIOInfo': [ 0x8c0, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'iomem': [0x300, ['MemoryRegion']],
    'irq0': [0x400, ['pointer', ['IRQState']]],
    'irq1': [0x408, ['pointer', ['IRQState']]],
    'irqX': [0x410, ['pointer', ['IRQState']]],
    'lines': [0x418, ['int']],
    'ncpu': [0x41c, ['int']],
    'cpu': [0x420, ['pointer', ['ARMCPU']]],
    'ilevel': [0x428, ['array', 4, ['unsigned int']]],
    'olevel': [0x438, ['array', 4, ['unsigned int']]],
    'dir': [0x448, ['array', 4, ['unsigned int']]],
    'rising': [0x458, ['array', 4, ['unsigned int']]],
    'falling': [0x468, ['array', 4, ['unsigned int']]],
    'status': [0x478, ['array', 4, ['unsigned int']]],
    'gafr': [0x488, ['array', 8, ['unsigned int']]],
    'prev_level': [0x4a8, ['array', 4, ['unsigned int']]],
    'handler': [0x4b8, ['array', 128, ['pointer', ['IRQState']]]],
    'read_notify': [0x8b8, ['pointer', ['IRQState']]],
}],
  'q_obj_query_rocker_arg': [ 0x8, {
    'name': [0x0, ['pointer', ['char']]],
}],
  'isa_impl_cl<llvm::ReturnInst, const llvm::Instruction': [ 0x1, {
}],
  '__iterator_traits<llvm::ilist_iterator<const llvm::Instruction': [ 0x1, {
}],
  'SCSIReqOps': [ 0x40, {
    'size': [0x0, ['unsigned long']],
    'free_req': [0x8, ['pointer', ['void']]],
    'send_command': [0x10, ['pointer', ['void']]],
    'read_data': [0x18, ['pointer', ['void']]],
    'write_data': [0x20, ['pointer', ['void']]],
    'get_buf': [0x28, ['pointer', ['void']]],
    'save_request': [0x30, ['pointer', ['void']]],
    'load_request': [0x38, ['pointer', ['void']]],
}],
  '__is_move_iterator<__gnu_cxx::__normal_iterator<long int*, std::vector<long int, std::allocator<long int': [ 0x1, {
}],
  'rebind<unsigned int': [ 0x1, {
}],
  'q_obj_BlockdevBackup_wrapper': [ 0x8, {
    'data': [0x0, ['pointer', ['BlockdevBackup']]],
}],
  'GICv3ITSCommonClass': [ 0xf0, {
    'parent_class': [0x0, ['SysBusDeviceClass']],
    'send_msi': [0xd8, ['pointer', ['void']]],
    'pre_save': [0xe0, ['pointer', ['void']]],
    'post_load': [0xe8, ['pointer', ['void']]],
}],
  'q_obj_SPICE_DISCONNECTED_arg': [ 0x10, {
    'server': [0x0, ['pointer', ['SpiceBasicInfo']]],
    'client': [0x8, ['pointer', ['SpiceBasicInfo']]],
}],
  'RngRequest': [ 0x30, {
    'receive_entropy': [0x0, ['pointer', ['void']]],
    'data': [0x8, ['pointer', ['unsigned char']]],
    'opaque': [0x10, ['pointer', ['void']]],
    'offset': [0x18, ['unsigned long']],
    'size': [0x20, ['unsigned long']],
    'next': [0x28, ['__unnamed_0x84df']],
}],
  '__unnamed_0x316a': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['BdrvChild']]],
}],
  'boolList': [ 0x10, {
    'next': [0x0, ['pointer', ['boolList']]],
    'value': [0x8, ['unsigned char']],
}],
  'CPUIOTLBEntry': [ 0x10, {
    'addr': [0x0, ['unsigned long']],
    'attrs': [0x8, ['MemTxAttrs']],
}],
  'dirent': [ 0x118, {
    'd_ino': [0x0, ['unsigned long']],
    'd_off': [0x8, ['long']],
    'd_reclen': [0x10, ['unsigned short']],
    'd_type': [0x12, ['unsigned char']],
    'd_name': [0x13, ['array', 256, ['char']]],
}],
  'UHCIInfo': [ 0x20, {
    'name': [0x0, ['pointer', ['char']]],
    'vendor_id': [0x8, ['unsigned short']],
    'device_id': [0xa, ['unsigned short']],
    'revision': [0xc, ['unsigned char']],
    'irq_pin': [0xd, ['unsigned char']],
    'realize': [0x10, ['pointer', ['void']]],
    'unplug': [0x18, ['unsigned char']],
}],
  'ARMGICv3CommonClass': [ 0xe8, {
    'parent_class': [0x0, ['SysBusDeviceClass']],
    'pre_save': [0xd8, ['pointer', ['void']]],
    'post_load': [0xe0, ['pointer', ['void']]],
}],
  'BlockJobInfo': [ 0x38, {
    'type': [0x0, ['pointer', ['char']]],
    'device': [0x8, ['pointer', ['char']]],
    'len': [0x10, ['long']],
    'offset': [0x18, ['long']],
    'busy': [0x20, ['unsigned char']],
    'paused': [0x21, ['unsigned char']],
    'speed': [0x28, ['long']],
    'io_status': [0x30, ['Enumeration', {'target': 'int', 'choices': {0: 'BLOCK_DEVICE_IO_STATUS_OK', 1: 'BLOCK_DEVICE_IO_STATUS_FAILED', 2: 'BLOCK_DEVICE_IO_STATUS_NOSPACE', 3: 'BLOCK_DEVICE_IO_STATUS__MAX'}}]],
    'ready': [0x34, ['unsigned char']],
}],
  '__unnamed_0x3d97': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['MTPObject']]],
}],
  'USBDescID': [ 0xa, {
    'idVendor': [0x0, ['unsigned short']],
    'idProduct': [0x2, ['unsigned short']],
    'bcdDevice': [0x4, ['unsigned short']],
    'iManufacturer': [0x6, ['unsigned char']],
    'iProduct': [0x7, ['unsigned char']],
    'iSerialNumber': [0x8, ['unsigned char']],
}],
  '__unnamed_0x2fa4': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['AddressSpace']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['AddressSpace']]]],
}],
  'q_obj_qom_set_arg': [ 0x18, {
    'path': [0x0, ['pointer', ['char']]],
    'property': [0x8, ['pointer', ['char']]],
    'value': [0x10, ['pointer', ['QObject']]],
}],
  'mbuf_ptr': [ 0x8, {
    'mptr': [0x0, ['pointer', ['mbuf']]],
}],
  '__unnamed_0x1a58': [ 0x8, {
    'out': [0x0, ['pointer', ['SWVoiceOut']]],
    'in': [0x0, ['pointer', ['SWVoiceIn']]],
}],
  'omap_synctimer_s': [ 0x110, {
    'iomem': [0x0, ['MemoryRegion']],
    'val': [0x100, ['unsigned int']],
    'readh': [0x104, ['unsigned short']],
}],
  'QEMUClock': [ 0x20, {
    'timerlists': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'MODULE_INIT_BLOCK', 1: 'MODULE_INIT_OPTS', 2: 'MODULE_INIT_QAPI', 3: 'MODULE_INIT_QOM', 4: 'MODULE_INIT_TRACE', 5: 'MODULE_INIT_MAX'}}]],
    'reset_notifiers': [0x8, ['NotifierList']],
    'last': [0x10, ['long']],
    'type': [0x18, ['Enumeration', {'target': 'int', 'choices': {0: 'QEMU_CLOCK_REALTIME', 1: 'QEMU_CLOCK_VIRTUAL', 2: 'QEMU_CLOCK_HOST', 3: 'QEMU_CLOCK_VIRTUAL_RT', 4: 'QEMU_CLOCK_MAX'}}]],
    'enabled': [0x1c, ['unsigned char']],
}],
  'tcpiphdr_2': [ 0x48, {
    'dummy': [0x0, ['tcpiphdr']],
    'first_char': [0x44, ['char']],
}],
  'SCC2698Block': [ 0x2, {
    'imr': [0x0, ['unsigned char']],
    'isr': [0x1, ['unsigned char']],
}],
  '__unnamed_0xb17b': [ 0x48, {
    'qcow': [0x0, ['QCryptoBlockOptionsQCow']],
    'luks': [0x0, ['QCryptoBlockCreateOptionsLUKS']],
}],
  'cast_retty_wrap<llvm::Function, const llvm::Use, llvm::Value*': [ 0x1, {
}],
  '__unnamed_0x31db': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['BdrvChild']]],
}],
  '__unnamed_0x3545': [ 0x2c, {
    'other_sp': [0x0, ['unsigned int']],
    'vecbase': [0x4, ['unsigned int']],
    'basepri': [0x8, ['unsigned int']],
    'control': [0xc, ['unsigned int']],
    'ccr': [0x10, ['unsigned int']],
    'cfsr': [0x14, ['unsigned int']],
    'hfsr': [0x18, ['unsigned int']],
    'dfsr': [0x1c, ['unsigned int']],
    'mmfar': [0x20, ['unsigned int']],
    'bfar': [0x24, ['unsigned int']],
    'exception': [0x28, ['int']],
}],
  'rusage': [ 0x90, {
    'ru_utime': [0x0, ['timeval']],
    'ru_stime': [0x10, ['timeval']],
    '__unnamed_0x90b': [0x20, ['__unnamed_0x729']],
    '__unnamed_0x911': [0x28, ['__unnamed_0x748']],
    '__unnamed_0x917': [0x30, ['__unnamed_0x767']],
    '__unnamed_0x91d': [0x38, ['__unnamed_0x786']],
    '__unnamed_0x923': [0x40, ['__unnamed_0x7a5']],
    '__unnamed_0x929': [0x48, ['__unnamed_0x7c4']],
    '__unnamed_0x92f': [0x50, ['__unnamed_0x7e3']],
    '__unnamed_0x935': [0x58, ['__unnamed_0x802']],
    '__unnamed_0x93b': [0x60, ['__unnamed_0x821']],
    '__unnamed_0x941': [0x68, ['__unnamed_0x840']],
    '__unnamed_0x947': [0x70, ['__unnamed_0x85f']],
    '__unnamed_0x94d': [0x78, ['__unnamed_0x881']],
    '__unnamed_0x953': [0x80, ['__unnamed_0x8a3']],
    '__unnamed_0x959': [0x88, ['__unnamed_0x8c5']],
}],
  '__unnamed_0x3014': [ 0x10, {
    'le_next': [0x0, ['pointer', ['BdrvChild']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['BdrvChild']]]],
}],
  'VFIOrtl8168Quirk': [ 0x18, {
    'vdev': [0x0, ['pointer', ['VFIOPCIDevice']]],
    'addr': [0x8, ['unsigned int']],
    'data': [0xc, ['unsigned int']],
    'enabled': [0x10, ['unsigned char']],
}],
  'IMXGPTState': [ 0x460, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'timer': [0x300, ['pointer', ['ptimer_state']]],
    'iomem': [0x310, ['MemoryRegion']],
    'ccm': [0x410, ['pointer', ['IMXCCMState']]],
    'cr': [0x418, ['unsigned int']],
    'pr': [0x41c, ['unsigned int']],
    'sr': [0x420, ['unsigned int']],
    'ir': [0x424, ['unsigned int']],
    'ocr1': [0x428, ['unsigned int']],
    'ocr2': [0x42c, ['unsigned int']],
    'ocr3': [0x430, ['unsigned int']],
    'icr1': [0x434, ['unsigned int']],
    'icr2': [0x438, ['unsigned int']],
    'cnt': [0x43c, ['unsigned int']],
    'next_timeout': [0x440, ['unsigned int']],
    'next_int': [0x444, ['unsigned int']],
    'freq': [0x448, ['unsigned int']],
    'irq': [0x450, ['pointer', ['IRQState']]],
    'clocks': [0x458, ['pointer', ['Enumeration', {'target': 'int', 'choices': {0: 'CLK_NONE', 1: 'CLK_IPG', 2: 'CLK_IPG_HIGH', 3: 'CLK_32k', 4: 'CLK_EXT', 5: 'CLK_HIGH_DIV', 6: 'CLK_HIGH'}}]]],
}],
  'WatchdogTimerModel': [ 0x20, {
    'entry': [0x0, ['__unnamed_0x126c']],
    'wdt_name': [0x10, ['pointer', ['char']]],
    'wdt_description': [0x18, ['pointer', ['char']]],
}],
  'NvmeRequest': [ 0x78, {
    'sq': [0x0, ['pointer', ['NvmeSQueue']]],
    'aiocb': [0x8, ['pointer', ['BlockAIOCB']]],
    'status': [0x10, ['unsigned short']],
    'has_sg': [0x12, ['unsigned char']],
    'cqe': [0x14, ['NvmeCqe']],
    'acct': [0x28, ['BlockAcctCookie']],
    'qsg': [0x40, ['QEMUSGList']],
    'entry': [0x68, ['__unnamed_0x5f24']],
}],
  '__alloc_traits<std::allocator<std::pair<const std::__cxx11::basic_string<char, std::char_traits<char': [ 0x1, {
}],
  'packets': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['NetPacket']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['NetPacket']]]],
}],
  'virtio_gpu_resource_unref': [ 0x20, {
    'hdr': [0x0, ['virtio_gpu_ctrl_hdr']],
    'resource_id': [0x18, ['unsigned int']],
    'padding': [0x1c, ['unsigned int']],
}],
  'PCIESPState': [ 0xb50, {
    'parent_obj': [0x0, ['PCIDevice']],
    'io': [0x8f0, ['MemoryRegion']],
    'dma_regs': [0x9f0, ['array', 8, ['unsigned int']]],
    'sbac': [0xa10, ['unsigned int']],
    'esp': [0xa18, ['ESPState']],
}],
  'remove_reference<long int&': [ 0x1, {
}],
  'I2CSlaveClass': [ 0xe0, {
    'parent_class': [0x0, ['DeviceClass']],
    'init': [0xc0, ['pointer', ['void']]],
    'send': [0xc8, ['pointer', ['void']]],
    'recv': [0xd0, ['pointer', ['void']]],
    'event': [0xd8, ['pointer', ['void']]],
}],
  '__unnamed_0x189b': [ 0xc18, {
    'keysym2keycode': [0x0, ['array', 512, ['unsigned short']]],
    'keysym2keycode_extra': [0x400, ['array', 256, ['__unnamed_0x187a']]],
    'extra_count': [0xc00, ['int']],
    'keypad_range': [0xc08, ['pointer', ['key_range']]],
    'numlock_range': [0xc10, ['pointer', ['key_range']]],
}],
  'BlockDirtyBitmapState': [ 0x50, {
    'common': [0x0, ['BlkActionState']],
    'bitmap': [0x28, ['pointer', ['BdrvDirtyBitmap']]],
    'bs': [0x30, ['pointer', ['BlockDriverState']]],
    'aio_context': [0x38, ['pointer', ['AioContext']]],
    'backup': [0x40, ['pointer', ['HBitmap']]],
    'prepared': [0x48, ['unsigned char']],
}],
  '_Iter_base<const llvm::LayoutAlignElem*, false': [ 0x1, {
}],
  'QemuOptDesc': [ 0x20, {
    'name': [0x0, ['pointer', ['char']]],
    'type': [0x8, ['Enumeration', {'target': 'int', 'choices': {0: 'QEMU_OPT_STRING', 1: 'QEMU_OPT_BOOL', 2: 'QEMU_OPT_NUMBER', 3: 'QEMU_OPT_SIZE'}}]],
    'help': [0x10, ['pointer', ['char']]],
    'def_value_str': [0x18, ['pointer', ['char']]],
}],
  'isa_impl_wrap<llvm::Constant, const llvm::Value*, const llvm::Value*': [ 0x1, {
}],
  'QXLBlackness': [ 0x11, {
    'mask': [0x0, ['QXLQMask']],
}],
  'SheepdogAIOCB': [ 0x58, {
    's': [0x0, ['pointer', ['BDRVSheepdogState']]],
    'qiov': [0x8, ['pointer', ['QEMUIOVector']]],
    'sector_num': [0x10, ['long']],
    'nb_sectors': [0x18, ['int']],
    'ret': [0x1c, ['int']],
    'aiocb_type': [0x20, ['Enumeration', {'target': 'int', 'choices': {0: 'AIOCB_WRITE_UDATA', 1: 'AIOCB_READ_UDATA', 2: 'AIOCB_FLUSH_CACHE', 3: 'AIOCB_DISCARD_OBJ'}}]],
    'coroutine': [0x28, ['pointer', ['Coroutine']]],
    'nr_pending': [0x30, ['int']],
    'min_affect_data_idx': [0x34, ['unsigned int']],
    'max_affect_data_idx': [0x38, ['unsigned int']],
    'min_dirty_data_idx': [0x3c, ['unsigned int']],
    'max_dirty_data_idx': [0x40, ['unsigned int']],
    'aiocb_siblings': [0x48, ['__unnamed_0x3af1']],
}],
  '__unnamed_0x2f0b': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['EHCIPacket']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['EHCIPacket']]]],
}],
  'isa_impl_wrap<llvm::Function, llvm::Value*, llvm::Value*': [ 0x1, {
}],
  'QIODNSResolver': [ 0x28, {
    'parent': [0x0, ['Object']],
}],
  'ChardevSocket': [ 0x48, {
    'has_logfile': [0x0, ['unsigned char']],
    'logfile': [0x8, ['pointer', ['char']]],
    'has_logappend': [0x10, ['unsigned char']],
    'logappend': [0x11, ['unsigned char']],
    'addr': [0x18, ['pointer', ['SocketAddress']]],
    'has_tls_creds': [0x20, ['unsigned char']],
    'tls_creds': [0x28, ['pointer', ['char']]],
    'has_server': [0x30, ['unsigned char']],
    'server': [0x31, ['unsigned char']],
    'has_wait': [0x32, ['unsigned char']],
    'wait': [0x33, ['unsigned char']],
    'has_nodelay': [0x34, ['unsigned char']],
    'nodelay': [0x35, ['unsigned char']],
    'has_telnet': [0x36, ['unsigned char']],
    'telnet': [0x37, ['unsigned char']],
    'has_reconnect': [0x38, ['unsigned char']],
    'reconnect': [0x40, ['long']],
}],
  'TimedAverageWindow': [ 0x28, {
    'min': [0x0, ['unsigned long']],
    'max': [0x8, ['unsigned long']],
    'sum': [0x10, ['unsigned long']],
    'count': [0x18, ['unsigned long']],
    'expiration': [0x20, ['long']],
}],
  '__unnamed_0x2b52': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['QemuInputHandlerState']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['QemuInputHandlerState']]]],
}],
  'slirp_tcphdr': [ 0x14, {
    'th_sport': [0x0, ['unsigned short']],
    'th_dport': [0x2, ['unsigned short']],
    'th_seq': [0x4, ['unsigned int']],
    'th_ack': [0x8, ['unsigned int']],
    'th_x2': [0xc, ['BitField', {'end_bit': 4, 'start_bit': 0}]],
    'th_off': [0xc, ['BitField', {'end_bit': 8, 'start_bit': 4}]],
    'th_flags': [0xd, ['unsigned char']],
    'th_win': [0xe, ['unsigned short']],
    'th_sum': [0x10, ['unsigned short']],
    'th_urp': [0x12, ['unsigned short']],
}],
  'uffd_msg': [ 0x20, {
    'event': [0x0, ['unsigned char']],
    'reserved1': [0x1, ['unsigned char']],
    'reserved2': [0x2, ['unsigned short']],
    'reserved3': [0x4, ['unsigned int']],
    'arg': [0x8, ['__unnamed_0x1cae']],
}],
  'QuorumChildRequest': [ 0x38, {
    'bs': [0x0, ['pointer', ['BlockDriverState']]],
    'qiov': [0x8, ['QEMUIOVector']],
    'buf': [0x20, ['pointer', ['unsigned char']]],
    'ret': [0x28, ['int']],
    'parent': [0x30, ['pointer', ['QuorumAIOCB']]],
}],
  'xenkbd_position': [ 0x10, {
    'type': [0x0, ['unsigned char']],
    'abs_x': [0x4, ['int']],
    'abs_y': [0x8, ['int']],
    'rel_z': [0xc, ['int']],
}],
  'CryptoDevBackendPeers': [ 0x208, {
    'ccs': [0x0, ['array', 64, ['pointer', ['CryptoDevBackendClient']]]],
    'queues': [0x200, ['unsigned int']],
}],
  'ProtobufCMessageDescriptor': [ 0x78, {
    'magic': [0x0, ['unsigned int']],
    'name': [0x8, ['pointer', ['char']]],
    'short_name': [0x10, ['pointer', ['char']]],
    'c_name': [0x18, ['pointer', ['char']]],
    'package_name': [0x20, ['pointer', ['char']]],
    'sizeof_message': [0x28, ['unsigned long']],
    'n_fields': [0x30, ['unsigned int']],
    'fields': [0x38, ['pointer', ['ProtobufCFieldDescriptor']]],
    'fields_sorted_by_name': [0x40, ['pointer', ['unsigned int']]],
    'n_field_ranges': [0x48, ['unsigned int']],
    'field_ranges': [0x50, ['pointer', ['ProtobufCIntRange']]],
    'message_init': [0x58, ['pointer', ['void']]],
    'reserved1': [0x60, ['pointer', ['void']]],
    'reserved2': [0x68, ['pointer', ['void']]],
    'reserved3': [0x70, ['pointer', ['void']]],
}],
  'VCChardev': [ 0x98, {
    'parent': [0x0, ['Chardev']],
    'console': [0x90, ['pointer', ['QemuConsole']]],
}],
  '__iterator_traits<llvm::ilist_iterator<llvm::Instruction': [ 0x1, {
}],
  '__unnamed_0x3382': [ 0x28, {
    'version': [0x0, ['unsigned int']],
    'flags': [0x4, ['unsigned int']],
    'disk_sectors': [0x8, ['unsigned int']],
    'granularity': [0xc, ['unsigned int']],
    'l1dir_offset': [0x10, ['unsigned int']],
    'l1dir_size': [0x14, ['unsigned int']],
    'file_sectors': [0x18, ['unsigned int']],
    'cylinders': [0x1c, ['unsigned int']],
    'heads': [0x20, ['unsigned int']],
    'sectors_per_track': [0x24, ['unsigned int']],
}],
  'NE2000State': [ 0xe160, {
    'io': [0x0, ['MemoryRegion']],
    'cmd': [0x100, ['unsigned char']],
    'start': [0x104, ['unsigned int']],
    'stop': [0x108, ['unsigned int']],
    'boundary': [0x10c, ['unsigned char']],
    'tsr': [0x10d, ['unsigned char']],
    'tpsr': [0x10e, ['unsigned char']],
    'tcnt': [0x110, ['unsigned short']],
    'rcnt': [0x112, ['unsigned short']],
    'rsar': [0x114, ['unsigned int']],
    'rsr': [0x118, ['unsigned char']],
    'rxcr': [0x119, ['unsigned char']],
    'isr': [0x11a, ['unsigned char']],
    'dcfg': [0x11b, ['unsigned char']],
    'imr': [0x11c, ['unsigned char']],
    'phys': [0x11d, ['array', 6, ['unsigned char']]],
    'curpag': [0x123, ['unsigned char']],
    'mult': [0x124, ['array', 8, ['unsigned char']]],
    'irq': [0x130, ['pointer', ['IRQState']]],
    'nic': [0x138, ['pointer', ['NICState']]],
    'c': [0x140, ['NICConf']],
    'mem': [0x2158, ['array', 49152, ['unsigned char']]],
}],
  'QIODNSResolverLookupData': [ 0x18, {
    'addr': [0x0, ['pointer', ['SocketAddress']]],
    'addrs': [0x8, ['pointer', ['pointer', ['SocketAddress']]]],
    'naddrs': [0x10, ['unsigned long']],
}],
  'pixman_color': [ 0x8, {
    'red': [0x0, ['unsigned short']],
    'green': [0x2, ['unsigned short']],
    'blue': [0x4, ['unsigned short']],
    'alpha': [0x6, ['unsigned short']],
}],
  'SocketReadState': [ 0x11018, {
    'state': [0x0, ['int']],
    'index': [0x4, ['unsigned int']],
    'packet_len': [0x8, ['unsigned int']],
    'buf': [0xc, ['array', 69632, ['unsigned char']]],
    'finalize': [0x11010, ['pointer', ['void']]],
}],
  'mfi_evt_log_state': [ 0x14, {
    'newest_seq_num': [0x0, ['unsigned int']],
    'oldest_seq_num': [0x4, ['unsigned int']],
    'clear_seq_num': [0x8, ['unsigned int']],
    'shutdown_seq_num': [0xc, ['unsigned int']],
    'boot_seq_num': [0x10, ['unsigned int']],
}],
  '__unnamed_0x724e': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['VirtIOSerialPort']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['VirtIOSerialPort']]]],
}],
  'Peer': [ 0x10, {
    'nb_eventfds': [0x0, ['int']],
    'eventfds': [0x8, ['pointer', ['EventNotifier']]],
}],
  'usb_redir_set_configuration_header': [ 0x1, {
    'configuration': [0x0, ['unsigned char']],
}],
  'USBDeviceClass': [ 0x148, {
    'parent_class': [0x0, ['DeviceClass']],
    'realize': [0xc0, ['pointer', ['void']]],
    'unrealize': [0xc8, ['pointer', ['void']]],
    'find_device': [0xd0, ['pointer', ['void']]],
    'cancel_packet': [0xd8, ['pointer', ['void']]],
    'handle_destroy': [0xe0, ['pointer', ['void']]],
    'handle_attach': [0xe8, ['pointer', ['void']]],
    'handle_reset': [0xf0, ['pointer', ['void']]],
    'handle_control': [0xf8, ['pointer', ['void']]],
    'handle_data': [0x100, ['pointer', ['void']]],
    'set_interface': [0x108, ['pointer', ['void']]],
    'flush_ep_queue': [0x110, ['pointer', ['void']]],
    'ep_stopped': [0x118, ['pointer', ['void']]],
    'alloc_streams': [0x120, ['pointer', ['void']]],
    'free_streams': [0x128, ['pointer', ['void']]],
    'product_desc': [0x130, ['pointer', ['char']]],
    'usb_desc': [0x138, ['pointer', ['USBDesc']]],
    'attached_settable': [0x140, ['unsigned char']],
}],
  '__unnamed_0x2948': [ 0x7, {
    'wTotalLength_lo': [0x0, ['unsigned char']],
    'wTotalLength_hi': [0x1, ['unsigned char']],
    'bNumInterfaces': [0x2, ['unsigned char']],
    'bConfigurationValue': [0x3, ['unsigned char']],
    'iConfiguration': [0x4, ['unsigned char']],
    'bmAttributes': [0x5, ['unsigned char']],
    'bMaxPower': [0x6, ['unsigned char']],
}],
  'remove_reference<std::pair<std::pair<long int, llvm::Type*': [ 0x1, {
}],
  'ChardevSpiceChannel': [ 0x20, {
    'has_logfile': [0x0, ['unsigned char']],
    'logfile': [0x8, ['pointer', ['char']]],
    'has_logappend': [0x10, ['unsigned char']],
    'logappend': [0x11, ['unsigned char']],
    'type': [0x18, ['pointer', ['char']]],
}],
  '__unnamed_0x2a96': [ 0x10, {
    'le_next': [0x0, ['pointer', ['VFIOINTp']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['VFIOINTp']]]],
}],
  'CpuDefinitionInfo': [ 0x20, {
    'name': [0x0, ['pointer', ['char']]],
    'has_migration_safe': [0x8, ['unsigned char']],
    'migration_safe': [0x9, ['unsigned char']],
    'q_static': [0xa, ['unsigned char']],
    'has_unavailable_features': [0xb, ['unsigned char']],
    'unavailable_features': [0x10, ['pointer', ['strList']]],
    'q_typename': [0x18, ['pointer', ['char']]],
}],
  'FlatRange': [ 0x40, {
    'mr': [0x0, ['pointer', ['MemoryRegion']]],
    'offset_in_region': [0x8, ['unsigned long']],
    'addr': [0x10, ['AddrRange']],
    'dirty_log_mask': [0x30, ['unsigned char']],
    'romd_mode': [0x31, ['unsigned char']],
    'readonly': [0x32, ['unsigned char']],
}],
  'ObjectTypeInfo': [ 0x8, {
    'name': [0x0, ['pointer', ['char']]],
}],
  'VFIOMmap': [ 0x120, {
    'mem': [0x0, ['MemoryRegion']],
    'mmap': [0x100, ['pointer', ['void']]],
    'offset': [0x108, ['long']],
    'size': [0x110, ['unsigned long']],
}],
  'palette_cb_priv': [ 0x18, {
    'vs': [0x0, ['pointer', ['VncState']]],
    'header': [0x8, ['pointer', ['unsigned char']]],
    'png_palette': [0x10, ['pointer', ['png_color_struct']]],
}],
  '__unnamed_0x2a98': [ 0x3, {
    'wTotalLength_lo': [0x0, ['unsigned char']],
    'wTotalLength_hi': [0x1, ['unsigned char']],
    'bNumDeviceCaps': [0x2, ['unsigned char']],
}],
  'q_obj_migrate_incoming_arg': [ 0x8, {
    'uri': [0x0, ['pointer', ['char']]],
}],
  'BlkRwCo': [ 0x20, {
    'blk': [0x0, ['pointer', ['BlockBackend']]],
    'offset': [0x8, ['long']],
    'qiov': [0x10, ['pointer', ['QEMUIOVector']]],
    'ret': [0x18, ['int']],
    'flags': [0x1c, ['Enumeration', {'target': 'int', 'choices': {32: 'BDRV_REQ_WRITE_COMPRESSED', 1: 'BDRV_REQ_COPY_ON_READ', 2: 'BDRV_REQ_ZERO_WRITE', 4: 'BDRV_REQ_MAY_UNMAP', 8: 'BDRV_REQ_NO_SERIALISING', 16: 'BDRV_REQ_FUA', 63: 'BDRV_REQ_MASK'}}]],
}],
  'BlockdevOptionsBlkdebug': [ 0x48, {
    'image': [0x0, ['pointer', ['BlockdevRef']]],
    'has_config': [0x8, ['unsigned char']],
    'config': [0x10, ['pointer', ['char']]],
    'has_align': [0x18, ['unsigned char']],
    'align': [0x20, ['long']],
    'has_inject_error': [0x28, ['unsigned char']],
    'inject_error': [0x30, ['pointer', ['BlkdebugInjectErrorOptionsList']]],
    'has_set_state': [0x38, ['unsigned char']],
    'set_state': [0x40, ['pointer', ['BlkdebugSetStateOptionsList']]],
}],
  'intList': [ 0x10, {
    'next': [0x0, ['pointer', ['intList']]],
    'value': [0x8, ['long']],
}],
  'aio_ctx': [ 0x68, {
    'blk': [0x0, ['pointer', ['BlockBackend']]],
    'qiov': [0x8, ['QEMUIOVector']],
    'offset': [0x20, ['long']],
    'buf': [0x28, ['pointer', ['char']]],
    'qflag': [0x30, ['unsigned char']],
    'vflag': [0x31, ['unsigned char']],
