cpu_types = {
  'BNDReg': [ 0x10, {
    'lb': [0x0, ['unsigned long']],
    'ub': [0x8, ['unsigned long']],
}],
  'MemoryRegion': [ 0x100, {
}],
  'SegmentCache': [ 0x10, {
    'selector': [0x0, ['unsigned int']],
    'base': [0x4, ['unsigned int']],
    'limit': [0x8, ['unsigned int']],
    'flags': [0xc, ['unsigned int']],
}],
  'CPUX86State': [ 0xa020, {
    'regs': [0x0, ['array', 8, ['unsigned int']]],
    'eip': [0x20, ['unsigned int']],
    'eflags': [0x24, ['unsigned int']],
    'cc_dst': [0x28, ['unsigned int']],
    'cc_src': [0x2c, ['unsigned int']],
    'cc_src2': [0x30, ['unsigned int']],
    'cc_op': [0x34, ['unsigned int']],
    'df': [0x38, ['int']],
    'hflags': [0x3c, ['unsigned int']],
    'hflags2': [0x40, ['unsigned int']],
    'segs': [0x44, ['array', 6, ['SegmentCache']]],
    'ldt': [0xa4, ['SegmentCache']],
    'tr': [0xb4, ['SegmentCache']],
    'gdt': [0xc4, ['SegmentCache']],
    'idt': [0xd4, ['SegmentCache']],
    'cr': [0xe4, ['array', 5, ['unsigned int']]],
    'a20_mask': [0xf8, ['int']],
    'bnd_regs': [0x100, ['array', 4, ['BNDReg']]],
    'bndcs_regs': [0x140, ['BNDCSReg']],
    'msr_bndcfgs': [0x150, ['unsigned long']],
    'efer': [0x158, ['unsigned long']],
    'start_init_save': [0x160, ['idunno:0x2258']],
    'fpstt': [0x160, ['unsigned int']],
    'fpus': [0x164, ['unsigned short']],
    'fpuc': [0x166, ['unsigned short']],
    'fptags': [0x168, ['array', 8, ['unsigned char']]],
    'fpregs': [0x170, ['array', 8, ['__unnamed_0x21b2']]],
    'fpop': [0x1f0, ['unsigned short']],
    'fpip': [0x1f8, ['unsigned long']],
    'fpdp': [0x200, ['unsigned long']],
    'fp_status': [0x208, ['float_status']],
    'ft0': [0x210, ['__unnamed_0x12ca']],
    'mmx_status': [0x220, ['float_status']],
    'sse_status': [0x228, ['float_status']],
    'mxcsr': [0x230, ['unsigned int']],
    'xmm_regs': [0x238, ['array', 8, ['ZMMReg']]],
    'xmm_t0': [0x438, ['ZMMReg']],
    'mmx_t0': [0x478, ['MMXReg']],
    'opmask_regs': [0x480, ['array', 8, ['unsigned long']]],
    'sysenter_cs': [0x4c0, ['unsigned int']],
    'sysenter_esp': [0x4c4, ['unsigned int']],
    'sysenter_eip': [0x4c8, ['unsigned int']],
    'star': [0x4d0, ['unsigned long']],
    'vm_hsave': [0x4d8, ['unsigned long']],
    'tsc': [0x4e0, ['unsigned long']],
    'tsc_adjust': [0x4e8, ['unsigned long']],
    'tsc_deadline': [0x4f0, ['unsigned long']],
    'tsc_aux': [0x4f8, ['unsigned long']],
    'xcr0': [0x500, ['unsigned long']],
    'mcg_status': [0x508, ['unsigned long']],
    'msr_ia32_misc_enable': [0x510, ['unsigned long']],
    'msr_ia32_feature_control': [0x518, ['unsigned long']],
    'msr_fixed_ctr_ctrl': [0x520, ['unsigned long']],
    'msr_global_ctrl': [0x528, ['unsigned long']],
    'msr_global_status': [0x530, ['unsigned long']],
    'msr_global_ovf_ctrl': [0x538, ['unsigned long']],
    'msr_fixed_counters': [0x540, ['array', 3, ['unsigned long']]],
    'msr_gp_counters': [0x558, ['array', 18, ['unsigned long']]],
    'msr_gp_evtsel': [0x5e8, ['array', 18, ['unsigned long']]],
    'pat': [0x678, ['unsigned long']],
    'smbase': [0x680, ['unsigned int']],
    'pkru': [0x684, ['unsigned int']],
    'system_time_msr': [0x688, ['unsigned long']],
    'end_init_save': [0x688, ['idunno:0x225d']],
    'wall_clock_msr': [0x690, ['unsigned long']],
    'steal_time_msr': [0x698, ['unsigned long']],
    'async_pf_en_msr': [0x6a0, ['unsigned long']],
    'pv_eoi_en_msr': [0x6a8, ['unsigned long']],
    'msr_hv_hypercall': [0x6b0, ['unsigned long']],
    'msr_hv_guest_os_id': [0x6b8, ['unsigned long']],
    'msr_hv_vapic': [0x6c0, ['unsigned long']],
    'msr_hv_tsc': [0x6c8, ['unsigned long']],
    'msr_hv_crash_params': [0x6d0, ['idunno:0x2adc']],
    'msr_hv_runtime': [0x6f8, ['unsigned long']],
    'msr_hv_synic_control': [0x700, ['unsigned long']],
    'msr_hv_synic_version': [0x708, ['unsigned long']],
    'msr_hv_synic_evt_page': [0x710, ['unsigned long']],
    'msr_hv_synic_msg_page': [0x718, ['unsigned long']],
    'msr_hv_synic_sint': [0x720, ['idunno:0x2aec']],
    'msr_hv_stimer_config': [0x7a0, ['array', 4, ['unsigned long']]],
    'msr_hv_stimer_count': [0x7c0, ['array', 4, ['unsigned long']]],
    'error_code': [0x7e0, ['int']],
    'exception_is_int': [0x7e4, ['int']],
    'exception_next_eip': [0x7e8, ['unsigned int']],
    'dr': [0x7ec, ['array', 8, ['unsigned int']]],
    '__unnamed_0x2748': [0x810, ['idunno:0x2262']],
    'old_exception': [0x830, ['int']],
    'vm_vmcb': [0x838, ['unsigned long']],
    'tsc_offset': [0x840, ['unsigned long']],
    'intercept': [0x848, ['unsigned long']],
    'intercept_cr_read': [0x850, ['unsigned short']],
    'intercept_cr_write': [0x852, ['unsigned short']],
    'intercept_dr_read': [0x854, ['unsigned short']],
    'intercept_dr_write': [0x856, ['unsigned short']],
    'intercept_exceptions': [0x858, ['unsigned int']],
    'v_tpr': [0x85c, ['unsigned char']],
    'nmi_injected': [0x85d, ['unsigned char']],
    'nmi_pending': [0x85e, ['unsigned char']],
    'end_reset_fields': [0x85f, ['idunno:0x22a4']],
    'tlb_table': [0x860, ['idunno:0x2b0c']],
    'tlb_v_table': [0x6860, ['idunno:0x2b22']],
    'iotlb': [0x6b60, ['idunno:0x2b38']],
    'iotlb_v': [0x9b60, ['idunno:0x2b4e']],
    'tlb_flush_addr': [0x9ce0, ['unsigned int']],
    'tlb_flush_mask': [0x9ce4, ['unsigned int']],
    'vtlb_index': [0x9ce8, ['unsigned int']],
    'cpuid_min_level': [0x9cec, ['unsigned int']],
    'cpuid_min_xlevel': [0x9cf0, ['unsigned int']],
    'cpuid_min_xlevel2': [0x9cf4, ['unsigned int']],
    'cpuid_max_level': [0x9cf8, ['unsigned int']],
    'cpuid_max_xlevel': [0x9cfc, ['unsigned int']],
    'cpuid_max_xlevel2': [0x9d00, ['unsigned int']],
    'cpuid_level': [0x9d04, ['unsigned int']],
    'cpuid_xlevel': [0x9d08, ['unsigned int']],
    'cpuid_xlevel2': [0x9d0c, ['unsigned int']],
    'cpuid_vendor1': [0x9d10, ['unsigned int']],
    'cpuid_vendor2': [0x9d14, ['unsigned int']],
    'cpuid_vendor3': [0x9d18, ['unsigned int']],
    'cpuid_version': [0x9d1c, ['unsigned int']],
    'features': [0x9d20, ['idunno:0x1f5e']],
    'cpuid_model': [0x9d68, ['idunno:0x2b64']],
    'mtrr_fixed': [0x9d98, ['idunno:0x2b74']],
    'mtrr_deftype': [0x9df0, ['unsigned long']],
    'mtrr_var': [0x9df8, ['idunno:0x2b84']],
    'mp_state': [0x9e78, ['unsigned int']],
    'exception_injected': [0x9e7c, ['int']],
    'interrupt_injected': [0x9e80, ['int']],
    'soft_interrupt': [0x9e84, ['unsigned char']],
    'has_error_code': [0x9e85, ['unsigned char']],
    'sipi_vector': [0x9e88, ['unsigned int']],
    'tsc_valid': [0x9e8c, ['unsigned char']],
    'tsc_khz': [0x9e90, ['long']],
    'user_tsc_khz': [0x9e98, ['long']],
    'kvm_xsave_buf': [0x9ea0, ['pointer', ['void']]],
    'mcg_cap': [0x9ea8, ['unsigned long']],
    'mcg_ctl': [0x9eb0, ['unsigned long']],
    'mcg_ext_ctl': [0x9eb8, ['unsigned long']],
    'mce_banks': [0x9ec0, ['idunno:0x2b94']],
    'xstate_bv': [0xa000, ['unsigned long']],
    'fpus_vmstate': [0xa008, ['unsigned short']],
    'fptag_vmstate': [0xa00a, ['unsigned short']],
    'fpregs_format_vmstate': [0xa00c, ['unsigned short']],
    'xss': [0xa010, ['unsigned long']],
    'tpr_access_type': [0xa018, ['idunno:0x224c']],
}],
  'MMXReg': [ 0x8, {
    '_w_MMXReg': [0x0, ['array', 4, ['unsigned short']]],
    '_q_MMXReg': [0x0, ['array', 1, ['unsigned long']]],
    '_d_MMXReg': [0x0, ['array', 1, ['unsigned long']]],
    '_b_MMXReg': [0x0, ['array', 8, ['unsigned char']]],
    '_s_MMXReg': [0x0, ['array', 2, ['unsigned int']]],
    '_l_MMXReg': [0x0, ['array', 2, ['unsigned int']]],
}],
  'BNDCSReg': [ 0x10, {
    'cfgu': [0x0, ['unsigned long']],
    'sts': [0x8, ['unsigned long']],
}],
  '__unnamed_0x21b2': [ 0x10, {
    'd': [0x0, ['__unnamed_0x12ca']],
    'mmx': [0x0, ['MMXReg']],
}],
  '__unnamed_0x12ca': [ 0x10, {
    'low': [0x0, ['unsigned long']],
    'high': [0x8, ['unsigned short']],
}],
  'X86CPU': [ 0x12390, {
    'parent_obj': [0x0, ['CPUState']],
    'env': [0x82a0, ['CPUX86State']],
    'hyperv_vapic': [0x122c0, ['unsigned char']],
    'hyperv_relaxed_timing': [0x122c1, ['unsigned char']],
    'hyperv_spinlock_attempts': [0x122c4, ['int']],
    'hyperv_vendor_id': [0x122c8, ['pointer', ['char']]],
    'hyperv_time': [0x122d0, ['unsigned char']],
    'hyperv_crash': [0x122d1, ['unsigned char']],
    'hyperv_reset': [0x122d2, ['unsigned char']],
    'hyperv_vpindex': [0x122d3, ['unsigned char']],
    'hyperv_runtime': [0x122d4, ['unsigned char']],
    'hyperv_synic': [0x122d5, ['unsigned char']],
    'hyperv_stimer': [0x122d6, ['unsigned char']],
    'check_cpuid': [0x122d7, ['unsigned char']],
    'enforce_cpuid': [0x122d8, ['unsigned char']],
    'expose_kvm': [0x122d9, ['unsigned char']],
    'migratable': [0x122da, ['unsigned char']],
    'host_features': [0x122db, ['unsigned char']],
    'apic_id': [0x122dc, ['unsigned int']],
    'vmware_cpuid_freq': [0x122e0, ['unsigned char']],
    'cache_info_passthrough': [0x122e1, ['unsigned char']],
    'filtered_features': [0x122e4, ['idunno:0x1f6a']],
    'enable_pmu': [0x1232c, ['unsigned char']],
    'enable_lmce': [0x1232d, ['unsigned char']],
    'enable_l3_cache': [0x1232e, ['unsigned char']],
    'enable_cpuid_0xb': [0x1232f, ['unsigned char']],
    'full_cpuid_auto_level': [0x12330, ['unsigned char']],
    'fill_mtrr_mask': [0x12331, ['unsigned char']],
    'host_phys_bits': [0x12332, ['unsigned char']],
    'phys_bits': [0x12334, ['unsigned int']],
    'apic_state': [0x12338, ['idunno:0x2bb0']],
    'cpu_as_root': [0x12340, ['pointer', ['MemoryRegion']]],
    'cpu_as_mem': [0x12348, ['pointer', ['MemoryRegion']]],
    'smram': [0x12350, ['pointer', ['MemoryRegion']]],
    'machine_done': [0x12358, ['idunno:0x1af0']],
    'kvm_msr_buf': [0x12370, ['idunno:0x2bc1']],
    'socket_id': [0x12378, ['int']],
    'core_id': [0x1237c, ['int']],
    'thread_id': [0x12380, ['int']],
}],
  'ZMMReg': [ 0x40, {
    '_b_ZMMReg': [0x0, ['array', 64, ['unsigned char']]],
    '_d_ZMMReg': [0x0, ['array', 8, ['unsigned long']]],
    '_q_ZMMReg': [0x0, ['array', 8, ['unsigned long']]],
    '_w_ZMMReg': [0x0, ['array', 32, ['unsigned short']]],
    '_s_ZMMReg': [0x0, ['array', 16, ['unsigned int']]],
    '_l_ZMMReg': [0x0, ['array', 16, ['unsigned int']]],
}],
  'CPUState': [ 0x82a0, {
    'parent_obj': [0x0, ['idunno:0xddf']],
    'nr_cores': [0x70, ['int']],
    'nr_threads': [0x74, ['int']],
    'numa_node': [0x78, ['int']],
    'thread': [0x80, ['idunno:0x1a3a']],
    'thread_id': [0x88, ['int']],
    'host_tid': [0x8c, ['unsigned int']],
    'running': [0x90, ['unsigned char']],
    'has_waiter': [0x91, ['unsigned char']],
    'halt_cond': [0x98, ['idunno:0x1a40']],
    'thread_kicked': [0xa0, ['unsigned char']],
    'created': [0xa1, ['unsigned char']],
    'stop': [0xa2, ['unsigned char']],
    'stopped': [0xa3, ['unsigned char']],
    'unplug': [0xa4, ['unsigned char']],
    'crash_occurred': [0xa5, ['unsigned char']],
    'exit_request': [0xa6, ['unsigned char']],
    'interrupt_request': [0xa8, ['unsigned int']],
    'singlestep_enabled': [0xac, ['int']],
    'icount_extra': [0xb0, ['long']],
    'jmp_env': [0xb8, ['idunno:0x5b7']],
    'work_mutex': [0x180, ['idunno:0x1690']],
    'queued_work_first': [0x1a8, ['idunno:0x1a4b']],
    'queued_work_last': [0x1b0, ['idunno:0x1a4b']],
    'cpu_ases': [0x1b8, ['idunno:0x1a51']],
    'num_ases': [0x1c0, ['int']],
    'as': [0x1c8, ['idunno:0x1a57']],
    'memory': [0x1d0, ['idunno:0x1a5d']],
    'env_ptr': [0x1d8, ['pointer', ['void']]],
    'tb_jmp_cache': [0x1e0, ['idunno:0x1a63']],
    'gdb_regs': [0x81e0, ['idunno:0x1a79']],
    'gdb_num_regs': [0x81e8, ['int']],
    'gdb_num_g_regs': [0x81ec, ['int']],
    'node': [0x81f0, ['idunno:0x1998']],
    'breakpoints': [0x8200, ['idunno:0x19c8']],
    'watchpoints': [0x8210, ['idunno:0x19f0']],
    'watchpoint_hit': [0x8220, ['idunno:0x1898']],
    'opaque': [0x8228, ['pointer', ['void']]],
    'mem_io_pc': [0x8230, ['idunno:0xe2']],
    'mem_io_vaddr': [0x8238, ['idunno:0x170a']],
    'kvm_fd': [0x8240, ['int']],
    'kvm_vcpu_dirty': [0x8244, ['unsigned char']],
    'kvm_state': [0x8248, ['idunno:0x1a84']],
    'kvm_run': [0x8250, ['idunno:0x1a8f']],
    'trace_dstate': [0x8258, ['idunno:0x1a95']],
    'cpu_index': [0x8260, ['int']],
    'halted': [0x8264, ['unsigned int']],
    'icount_decr': [0x8268, ['idunno:0x1a18']],
    'can_do_io': [0x826c, ['unsigned int']],
    'exception_index': [0x8270, ['int']],
    'rr_guest_instr_count': [0x8278, ['unsigned long']],
    'panda_guest_pc': [0x8280, ['unsigned long']],
    'throttle_thread_scheduled': [0x8288, ['unsigned char']],
    'tcg_exit_req': [0x828c, ['unsigned int']],
    'hax_vcpu_dirty': [0x8290, ['unsigned char']],
    'hax_vcpu': [0x8298, ['idunno:0x1aa0']],
}],
  'float_status': [ 0x8, {
    'float_detect_tininess': [0x0, ['signed char']],
    'float_rounding_mode': [0x1, ['signed char']],
    'float_exception_flags': [0x2, ['unsigned char']],
    'floatx80_rounding_precision': [0x3, ['signed char']],
    'flush_to_zero': [0x4, ['unsigned char']],
    'flush_inputs_to_zero': [0x5, ['unsigned char']],
    'default_nan_mode': [0x6, ['unsigned char']],
    'snan_bit_is_one': [0x7, ['unsigned char']],
}],
}

cpu_name = 'X86CPU'
