cpu_types = {
  'CrsRangeSet': [ 0x18, {
    'io_ranges': [0x0, ['pointer', ['_GPtrArray']]],
    'mem_ranges': [0x8, ['pointer', ['_GPtrArray']]],
    'mem_64bit_ranges': [0x10, ['pointer', ['_GPtrArray']]],
}],
  'V9fsStat': [ 0x90, {
    'size': [0x0, ['short']],
    'type': [0x2, ['short']],
    'dev': [0x4, ['int']],
    'qid': [0x8, ['V9fsQID']],
    'mode': [0x18, ['int']],
    'atime': [0x1c, ['int']],
    'mtime': [0x20, ['int']],
    'length': [0x28, ['long']],
    'name': [0x30, ['V9fsString']],
    'uid': [0x40, ['V9fsString']],
    'gid': [0x50, ['V9fsString']],
    'muid': [0x60, ['V9fsString']],
    'extension': [0x70, ['V9fsString']],
    'n_uid': [0x80, ['int']],
    'n_gid': [0x84, ['int']],
    'n_muid': [0x88, ['int']],
}],
  '__alloc_traits<std::allocator<llvm::Type*': [ 0x1, {
}],
  'PacketIdQueueEntry': [ 0x18, {
    'id': [0x0, ['unsigned long']],
    'next': [0x8, ['__unnamed_0x3a3a']],
}],
  '__unnamed_0xd4': [ 0x8, {
    '__val': [0x0, ['array', 2, ['int']]],
}],
  'mfi_ld_props': [ 0x20, {
    'ld': [0x0, ['mfi_ld_ref']],
    'name': [0x4, ['array', 16, ['char']]],
    'default_cache_policy': [0x14, ['unsigned char']],
    'access_policy': [0x15, ['unsigned char']],
    'disk_cache_policy': [0x16, ['unsigned char']],
    'current_cache_policy': [0x17, ['unsigned char']],
    'no_bgi': [0x18, ['unsigned char']],
    'reserved': [0x19, ['array', 7, ['unsigned char']]],
}],
  'NetEvent': [ 0x18, {
    'id': [0x0, ['unsigned char']],
    'flags': [0x4, ['unsigned int']],
    'data': [0x8, ['pointer', ['unsigned char']]],
    'size': [0x10, ['unsigned long']],
}],
  'audio_capture_ops': [ 0x18, {
    'notify': [0x0, ['pointer', ['void']]],
    'capture': [0x8, ['pointer', ['void']]],
    'destroy': [0x10, ['pointer', ['void']]],
}],
  'DataCache': [ 0x28, {
    'fd': [0x0, ['int']],
    'buf': [0x8, ['pointer', ['unsigned char']]],
    'buf_size': [0x10, ['unsigned long']],
    'data_size': [0x18, ['unsigned long']],
    'offset': [0x20, ['long']],
}],
  'netif_rx_back_ring': [ 0x18, {
    'rsp_prod_pvt': [0x0, ['unsigned int']],
    'req_cons': [0x4, ['unsigned int']],
    'nr_ents': [0x8, ['unsigned int']],
    'sring': [0x10, ['pointer', ['netif_rx_sring']]],
}],
  'xenfb_page': [ 0x828, {
    'in_cons': [0x0, ['unsigned int']],
    'in_prod': [0x4, ['unsigned int']],
    'out_cons': [0x8, ['unsigned int']],
    'out_prod': [0xc, ['unsigned int']],
    'width': [0x10, ['int']],
    'height': [0x14, ['int']],
    'line_length': [0x18, ['unsigned int']],
    'mem_length': [0x1c, ['unsigned int']],
    'depth': [0x20, ['unsigned char']],
    'pd': [0x28, ['array', 256, ['unsigned long']]],
}],
  'FWCfgState': [ 0x460, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'file_slots': [0x300, ['unsigned short']],
    'entries': [0x308, ['array', 2, ['pointer', ['FWCfgEntry']]]],
    'entry_order': [0x318, ['pointer', ['int']]],
    'files': [0x320, ['pointer', ['FWCfgFiles']]],
    'cur_entry': [0x328, ['unsigned short']],
    'cur_offset': [0x32c, ['unsigned int']],
    'machine_ready': [0x330, ['Notifier']],
    'fw_cfg_order_override': [0x348, ['int']],
    'dma_enabled': [0x34c, ['unsigned char']],
    'dma_addr': [0x350, ['unsigned long']],
    'dma_as': [0x358, ['pointer', ['AddressSpace']]],
    'dma_iomem': [0x360, ['MemoryRegion']],
}],
  'q_obj_x_blockdev_change_arg': [ 0x28, {
    'parent': [0x0, ['pointer', ['char']]],
    'has_child': [0x8, ['unsigned char']],
    'child': [0x10, ['pointer', ['char']]],
    'has_node': [0x18, ['unsigned char']],
    'node': [0x20, ['pointer', ['char']]],
}],
  'virtio_gpu_update_cursor': [ 0x38, {
    'hdr': [0x0, ['virtio_gpu_ctrl_hdr']],
    'pos': [0x18, ['virtio_gpu_cursor_pos']],
    'resource_id': [0x28, ['unsigned int']],
    'hot_x': [0x2c, ['unsigned int']],
    'hot_y': [0x30, ['unsigned int']],
    'padding': [0x34, ['unsigned int']],
}],
  'CCID_XferBlock': [ 0xa, {
    'hdr': [0x0, ['CCID_Header']],
    'bBWI': [0x7, ['unsigned char']],
    'wLevelParameter': [0x8, ['unsigned short']],
    'abData': [0xa, ['array', 0, ['unsigned char']]],
}],
  '__unnamed_0x1191': [ 0x80, {
    'ss': [0x0, ['sockaddr_storage']],
    'sin6': [0x0, ['sockaddr_in6']],
    'sin': [0x0, ['sockaddr_in']],
}],
  'xencons_interface': [ 0xc10, {
    'in': [0x0, ['array', 1024, ['char']]],
    'out': [0x400, ['array', 2048, ['char']]],
    'in_cons': [0xc00, ['unsigned int']],
    'in_prod': [0xc04, ['unsigned int']],
    'out_cons': [0xc08, ['unsigned int']],
    'out_prod': [0xc0c, ['unsigned int']],
}],
  'iterator<std::bidirectional_iterator_tag, llvm::Argument, long int, llvm::Argument*, llvm::Argument&': [ 0x1, {
}],
  'FdsetInfo': [ 0x10, {
    'fdset_id': [0x0, ['long']],
    'fds': [0x8, ['pointer', ['FdsetFdInfoList']]],
}],
  '__unnamed_0xf14': [ 0x10, {
    'sqh_first': [0x0, ['pointer', ['Coroutine']]],
    'sqh_last': [0x8, ['pointer', ['pointer', ['Coroutine']]]],
}],
  'VirtIODevice': [ 0xe8, {
    'parent_obj': [0x0, ['DeviceState']],
    'name': [0x70, ['pointer', ['char']]],
    'status': [0x78, ['unsigned char']],
    'isr': [0x79, ['unsigned char']],
    'queue_sel': [0x7a, ['unsigned short']],
    'guest_features': [0x80, ['unsigned long']],
    'host_features': [0x88, ['unsigned long']],
    'config_len': [0x90, ['unsigned long']],
    'config': [0x98, ['pointer', ['void']]],
    'config_vector': [0xa0, ['unsigned short']],
    'generation': [0xa4, ['unsigned int']],
    'nvectors': [0xa8, ['int']],
    'vq': [0xb0, ['pointer', ['VirtQueue']]],
    'device_id': [0xb8, ['unsigned short']],
    'vm_running': [0xba, ['unsigned char']],
    'broken': [0xbb, ['unsigned char']],
    'vmstate': [0xc0, ['pointer', ['vm_change_state_entry']]],
    'bus_name': [0xc8, ['pointer', ['char']]],
    'device_endian': [0xd0, ['unsigned char']],
    'use_guest_notifier_mask': [0xd1, ['unsigned char']],
    'dma_as': [0xd8, ['pointer', ['AddressSpace']]],
    'vector_queues': [0xe0, ['pointer', ['__unnamed_0x2836']]],
}],
  'DeviceListener': [ 0x20, {
    'realize': [0x0, ['pointer', ['void']]],
    'unrealize': [0x8, ['pointer', ['void']]],
    'link': [0x10, ['__unnamed_0x2bb6']],
}],
  'VAPICEnableTPRReporting': [ 0x10, {
    'apic': [0x0, ['pointer', ['DeviceState']]],
    'enable': [0x8, ['unsigned char']],
}],
  'VhostUserMemoryRegion': [ 0x20, {
    'guest_phys_addr': [0x0, ['unsigned long']],
    'memory_size': [0x8, ['unsigned long']],
    'userspace_addr': [0x10, ['unsigned long']],
    'mmap_offset': [0x18, ['unsigned long']],
}],
  'CryptoDevBackendClient': [ 0x30, {
    'model': [0x0, ['pointer', ['char']]],
    'name': [0x8, ['pointer', ['char']]],
    'info_str': [0x10, ['pointer', ['char']]],
    'queue_index': [0x18, ['unsigned int']],
    'next': [0x20, ['__unnamed_0x199e']],
}],
  'kvm_cpuid2': [ 0x8, {
    'nent': [0x0, ['unsigned int']],
    'padding': [0x4, ['unsigned int']],
    'entries': [0x8, ['array', 0, ['kvm_cpuid_entry2']]],
}],
  'KVMParkedVcpu': [ 0x20, {
    'vcpu_id': [0x0, ['unsigned long']],
    'kvm_fd': [0x8, ['int']],
    'node': [0x10, ['__unnamed_0x43e5']],
}],
  'SpiceChannelEventInfo': [ 0x140, {
    'connection_id': [0x0, ['int']],
    'type': [0x4, ['int']],
    'id': [0x8, ['int']],
    'flags': [0xc, ['int']],
    'laddr': [0x10, ['sockaddr']],
    'paddr': [0x20, ['sockaddr']],
    'llen': [0x30, ['unsigned int']],
    'plen': [0x34, ['unsigned int']],
    'laddr_ext': [0x38, ['sockaddr_storage']],
    'paddr_ext': [0xb8, ['sockaddr_storage']],
    'llen_ext': [0x138, ['unsigned int']],
    'plen_ext': [0x13c, ['unsigned int']],
}],
  'PCIEAERInject': [ 0x30, {
    'dev': [0x0, ['pointer', ['PCIDevice']]],
    'aer_cap': [0x8, ['pointer', ['unsigned char']]],
    'err': [0x10, ['pointer', ['PCIEAERErr']]],
    'devctl': [0x18, ['unsigned short']],
    'devsta': [0x1a, ['unsigned short']],
    'error_status': [0x1c, ['unsigned int']],
    'unsupported_request': [0x20, ['unsigned char']],
    'log_overflow': [0x21, ['unsigned char']],
    'msg': [0x24, ['PCIEAERMsg']],
}],
  '__unnamed_0xa83': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['QemuOpt']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['QemuOpt']]]],
}],
  'elf64_hdr': [ 0x40, {
    'e_ident': [0x0, ['array', 16, ['unsigned char']]],
    'e_type': [0x10, ['unsigned short']],
    'e_machine': [0x12, ['unsigned short']],
    'e_version': [0x14, ['unsigned int']],
    'e_entry': [0x18, ['unsigned long']],
    'e_phoff': [0x20, ['unsigned long']],
    'e_shoff': [0x28, ['unsigned long']],
    'e_flags': [0x30, ['unsigned int']],
    'e_ehsize': [0x34, ['unsigned short']],
    'e_phentsize': [0x36, ['unsigned short']],
    'e_phnum': [0x38, ['unsigned short']],
    'e_shentsize': [0x3a, ['unsigned short']],
    'e_shnum': [0x3c, ['unsigned short']],
    'e_shstrndx': [0x3e, ['unsigned short']],
}],
  'ACPIOSTInfoList': [ 0x10, {
    'next': [0x0, ['pointer', ['ACPIOSTInfoList']]],
    'value': [0x8, ['pointer', ['ACPIOSTInfo']]],
}],
  '__unnamed_0x449c': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['KVMParkedVcpu']]],
}],
  'Netdev': [ 0x120, {
    'id': [0x0, ['pointer', ['char']]],
    'type': [0x8, ['Enumeration', {'target': 'int', 'choices': {0: 'NET_CLIENT_DRIVER_NONE', 1: 'NET_CLIENT_DRIVER_NIC', 2: 'NET_CLIENT_DRIVER_USER', 3: 'NET_CLIENT_DRIVER_TAP', 4: 'NET_CLIENT_DRIVER_L2TPV3', 5: 'NET_CLIENT_DRIVER_SOCKET', 6: 'NET_CLIENT_DRIVER_VDE', 7: 'NET_CLIENT_DRIVER_DUMP', 8: 'NET_CLIENT_DRIVER_BRIDGE', 9: 'NET_CLIENT_DRIVER_HUBPORT', 10: 'NET_CLIENT_DRIVER_NETMAP', 11: 'NET_CLIENT_DRIVER_VHOST_USER', 12: 'NET_CLIENT_DRIVER__MAX'}}]],
    'u': [0x10, ['__unnamed_0xb05e']],
}],
  'CpuInfoPPC': [ 0x8, {
    'nip': [0x0, ['long']],
}],
  'Vmxnet3_GOSInfo': [ 0x4, {
    'gosType': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 2}]],
    'gosMisc': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 22}]],
    'gosVer': [0x0, ['BitField', {'end_bit': 22, 'start_bit': 6}]],
    'gosBits': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 0}]],
}],
  'SpiceVoiceOut': [ 0xc8, {
    'hw': [0x0, ['HWVoiceOut']],
    'sin': [0x88, ['SpicePlaybackInstance']],
    'rate': [0x98, ['SpiceRateCtl']],
    'active': [0xa8, ['int']],
    'frame': [0xb0, ['pointer', ['unsigned int']]],
    'fpos': [0xb8, ['pointer', ['unsigned int']]],
    'fsize': [0xc0, ['unsigned int']],
}],
  'virtio_net_ctrl_hdr': [ 0x2, {
    'class': [0x0, ['unsigned char']],
    'cmd': [0x1, ['unsigned char']],
}],
  '__unnamed_0xb9a': [ 0x10, {
    'le_next': [0x0, ['pointer', ['BlockBackendPublic']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['BlockBackendPublic']]]],
}],
  'VmdkGrainMarker': [ 0xc, {
    'lba': [0x0, ['unsigned long']],
    'size': [0x8, ['unsigned int']],
    'data': [0xc, ['array', 0, ['unsigned char']]],
}],
  'TPMTISEmuState': [ 0x1160, {
    'bh': [0x0, ['pointer', ['QEMUBH']]],
    'offset': [0x8, ['unsigned int']],
    'buf': [0xc, ['array', 4096, ['unsigned char']]],
    'active_locty': [0x100c, ['unsigned char']],
    'aborting_locty': [0x100d, ['unsigned char']],
    'next_locty': [0x100e, ['unsigned char']],
    'loc': [0x1010, ['array', 5, ['TPMLocality']]],
    'irq': [0x1150, ['pointer', ['IRQState']]],
    'irq_num': [0x1158, ['unsigned int']],
}],
  'InputEventList': [ 0x10, {
    'next': [0x0, ['pointer', ['InputEventList']]],
    'value': [0x8, ['pointer', ['InputEvent']]],
}],
  '__unnamed_0x33a3': [ 0x10, {
    'le_next': [0x0, ['pointer', ['ReplicationState']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['ReplicationState']]]],
}],
  '__unnamed_0x4160': [ 0x18, {
    'surface_create': [0x0, ['QXLSurface']],
}],
  '__is_normal_iterator<llvm::Type* const*': [ 0x1, {
}],
  'HDAAudioState': [ 0x618, {
    'hda': [0x0, ['HDACodecDevice']],
    'name': [0x78, ['pointer', ['char']]],
    'card': [0x80, ['QEMUSoundCard']],
    'desc': [0x98, ['pointer', ['desc_codec']]],
    'st': [0xa0, ['array', 4, ['HDAAudioStream']]],
    'running_compat': [0x5e0, ['array', 16, ['unsigned char']]],
    'running_real': [0x5f0, ['array', 32, ['unsigned char']]],
    'debug': [0x610, ['unsigned int']],
    'mixer': [0x614, ['unsigned char']],
}],
  'PageDesc': [ 0x18, {
    'first_tb': [0x0, ['pointer', ['TranslationBlock']]],
    'code_write_count': [0x8, ['unsigned int']],
    'code_bitmap': [0x10, ['pointer', ['unsigned long']]],
}],
  'RwCo': [ 0x28, {
    'child': [0x0, ['pointer', ['BdrvChild']]],
    'offset': [0x8, ['long']],
    'qiov': [0x10, ['pointer', ['QEMUIOVector']]],
    'is_write': [0x18, ['unsigned char']],
    'ret': [0x1c, ['int']],
    'flags': [0x20, ['Enumeration', {'target': 'int', 'choices': {32: 'BDRV_REQ_WRITE_COMPRESSED', 1: 'BDRV_REQ_COPY_ON_READ', 2: 'BDRV_REQ_ZERO_WRITE', 4: 'BDRV_REQ_MAY_UNMAP', 8: 'BDRV_REQ_NO_SERIALISING', 16: 'BDRV_REQ_FUA', 63: 'BDRV_REQ_MASK'}}]],
}],
  '__unnamed_0xb1a3': [ 0x38, {
    'qcow': [0x0, ['QCryptoBlockInfoQCow']],
    'luks': [0x0, ['QCryptoBlockInfoLUKS']],
}],
  'SchemaInfoObjectVariant': [ 0x10, {
    'q_case': [0x0, ['pointer', ['char']]],
    'type': [0x8, ['pointer', ['char']]],
}],
  'GUSState': [ 0x1011a8, {
    'dev': [0x0, ['ISADevice']],
    'emu': [0x80, ['_GUSEmuState']],
    'card': [0xa8, ['QEMUSoundCard']],
    'freq': [0xc0, ['unsigned int']],
    'port': [0xc4, ['unsigned int']],
    'pos': [0xc8, ['int']],
    'left': [0xcc, ['int']],
    'shift': [0xd0, ['int']],
    'irqs': [0xd4, ['int']],
    'mixbuf': [0xd8, ['pointer', ['short']]],
    'himem': [0xe0, ['array', 1052704, ['unsigned char']]],
    'samples': [0x101100, ['int']],
    'voice': [0x101108, ['pointer', ['SWVoiceOut']]],
    'last_ticks': [0x101110, ['long']],
    'pic': [0x101118, ['pointer', ['IRQState']]],
    'isa_dma': [0x101120, ['pointer', ['IsaDma']]],
    'portio_list1': [0x101128, ['PortioList']],
    'portio_list2': [0x101168, ['PortioList']],
}],
  'MemoryListener': [ 0xa0, {
    'begin': [0x0, ['pointer', ['void']]],
    'commit': [0x8, ['pointer', ['void']]],
    'region_add': [0x10, ['pointer', ['void']]],
    'region_del': [0x18, ['pointer', ['void']]],
    'region_nop': [0x20, ['pointer', ['void']]],
    'log_start': [0x28, ['pointer', ['void']]],
    'log_stop': [0x30, ['pointer', ['void']]],
    'log_sync': [0x38, ['pointer', ['void']]],
    'log_global_start': [0x40, ['pointer', ['void']]],
    'log_global_stop': [0x48, ['pointer', ['void']]],
    'eventfd_add': [0x50, ['pointer', ['void']]],
    'eventfd_del': [0x58, ['pointer', ['void']]],
    'coalesced_mmio_add': [0x60, ['pointer', ['void']]],
    'coalesced_mmio_del': [0x68, ['pointer', ['void']]],
    'priority': [0x70, ['unsigned int']],
    'address_space': [0x78, ['pointer', ['AddressSpace']]],
    'link': [0x80, ['__unnamed_0x1f42']],
    'link_as': [0x90, ['__unnamed_0x1f72']],
}],
  'ChardevHead': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['Chardev']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['Chardev']]]],
}],
  'q_obj_NetdevUserOptions_wrapper': [ 0x8, {
    'data': [0x0, ['pointer', ['NetdevUserOptions']]],
}],
  'PortioList': [ 0x40, {
    'ports': [0x0, ['pointer', ['MemoryRegionPortio']]],
    'owner': [0x8, ['pointer', ['Object']]],
    'address_space': [0x10, ['pointer', ['MemoryRegion']]],
    'nr': [0x18, ['unsigned int']],
    'regions': [0x20, ['pointer', ['pointer', ['MemoryRegion']]]],
    'opaque': [0x28, ['pointer', ['void']]],
    'name': [0x30, ['pointer', ['char']]],
    'flush_coalesced_mmio': [0x38, ['unsigned char']],
}],
  'TBContext': [ 0x78, {
    'tbs': [0x0, ['pointer', ['TranslationBlock']]],
    'htable': [0x8, ['qht']],
    'nb_tbs': [0x40, ['int']],
    'tb_lock': [0x48, ['QemuMutex']],
    'tb_flush_count': [0x70, ['unsigned int']],
    'tb_phys_invalidate_count': [0x74, ['int']],
}],
  '_Rb_tree_iterator<std::pair<const llvm::Function* const, long int': [ 0x8, {
    '_M_node': [0x0, ['pointer', ['_Rb_tree_node_base']]],
}],
  'QXLReleaseInfoExt': [ 0x10, {
    'info': [0x0, ['pointer', ['QXLReleaseInfo']]],
    'group_id': [0x8, ['unsigned int']],
}],
  'USBBtState': [ 0xd718, {
    'dev': [0x0, ['USBDevice']],
    'hci': [0x16a8, ['pointer', ['HCIInfo']]],
    'intr': [0x16b0, ['pointer', ['USBEndpoint']]],
    'config': [0x16b8, ['int']],
    'evt': [0x16c0, ['usb_hci_in_fifo_s']],
    'acl': [0x46d8, ['usb_hci_in_fifo_s']],
    'sco': [0x76f0, ['usb_hci_in_fifo_s']],
    'outcmd': [0xa708, ['usb_hci_out_fifo_s']],
    'outacl': [0xb70c, ['usb_hci_out_fifo_s']],
    'outsco': [0xc710, ['usb_hci_out_fifo_s']],
}],
  'BlockBackendAIOCB': [ 0x38, {
    'common': [0x0, ['BlockAIOCB']],
    'blk': [0x28, ['pointer', ['BlockBackend']]],
    'ret': [0x30, ['int']],
}],
  'elf32_sym': [ 0x10, {
    'st_name': [0x0, ['unsigned int']],
    'st_value': [0x4, ['unsigned int']],
    'st_size': [0x8, ['unsigned int']],
    'st_info': [0xc, ['unsigned char']],
    'st_other': [0xd, ['unsigned char']],
    'st_shndx': [0xe, ['unsigned short']],
}],
  'QCryptoBlockInfoLUKSSlot': [ 0x28, {
    'active': [0x0, ['unsigned char']],
    'has_iters': [0x1, ['unsigned char']],
    'iters': [0x8, ['long']],
    'has_stripes': [0x10, ['unsigned char']],
    'stripes': [0x18, ['long']],
    'key_offset': [0x20, ['long']],
}],
  '_Rb_tree_node<std::__cxx11::basic_string<char, std::char_traits<char': [ 0x40, {
    '_M_storage': [0x20, ['__aligned_membuf<std::__cxx11::basic_string<char, std::char_traits<char']],
}],
  'SDL_MouseButtonEvent': [ 0x8, {
    'type': [0x0, ['unsigned char']],
    'which': [0x1, ['unsigned char']],
    'button': [0x2, ['unsigned char']],
    'state': [0x3, ['unsigned char']],
    'x': [0x4, ['unsigned short']],
    'y': [0x6, ['unsigned short']],
}],
  'isa_impl_wrap<llvm::ConstantInt, llvm::Constant* const, const llvm::Constant*': [ 0x1, {
}],
  'TCOIORegs': [ 0x130, {
    'tco': [0x0, ['__unnamed_0x3108']],
    'sw_irq_gen': [0x12, ['unsigned char']],
    'tco_timer': [0x18, ['pointer', ['QEMUTimer']]],
    'expire_time': [0x20, ['long']],
    'timeouts_no': [0x28, ['unsigned char']],
    'io': [0x30, ['MemoryRegion']],
}],
  'BlockJob': [ 0xa8, {
    'driver': [0x0, ['pointer', ['BlockJobDriver']]],
    'blk': [0x8, ['pointer', ['BlockBackend']]],
    'id': [0x10, ['pointer', ['char']]],
    'co': [0x18, ['pointer', ['Coroutine']]],
    'cancelled': [0x20, ['unsigned char']],
    'pause_count': [0x24, ['int']],
    'user_paused': [0x28, ['unsigned char']],
    'busy': [0x29, ['unsigned char']],
    'paused': [0x2a, ['unsigned char']],
    'ready': [0x2b, ['unsigned char']],
    'deferred_to_main_loop': [0x2c, ['unsigned char']],
    'job_list': [0x30, ['Enumeration', {'target': 'int', 'choices': {0: 'IOMMU_NONE', 1: 'IOMMU_RO', 2: 'IOMMU_WO', 3: 'IOMMU_RW'}}]],
    'iostatus': [0x40, ['Enumeration', {'target': 'int', 'choices': {0: 'BLOCK_DEVICE_IO_STATUS_OK', 1: 'BLOCK_DEVICE_IO_STATUS_FAILED', 2: 'BLOCK_DEVICE_IO_STATUS_NOSPACE', 3: 'BLOCK_DEVICE_IO_STATUS__MAX'}}]],
    'offset': [0x48, ['long']],
    'len': [0x50, ['long']],
    'speed': [0x58, ['long']],
    'cb': [0x60, ['pointer', ['void']]],
    'blocker': [0x68, ['pointer', ['Error']]],
    'nodes': [0x70, ['pointer', ['_GSList']]],
    'opaque': [0x78, ['pointer', ['void']]],
    'refcnt': [0x80, ['int']],
    'completed': [0x84, ['unsigned char']],
    'ret': [0x88, ['int']],
    'txn': [0x90, ['pointer', ['BlockJobTxn']]],
    'txn_list': [0x98, ['Enumeration', {'target': 'int', 'choices': {0: 'IOMMU_NOTIFIER_NONE', 1: 'IOMMU_NOTIFIER_UNMAP', 2: 'IOMMU_NOTIFIER_MAP'}}]],
}],
  'disassemble_info': [ 0xb8, {
    'fprintf_func': [0x0, ['pointer', ['void']]],
    'stream': [0x8, ['pointer', ['_IO_FILE']]],
    'application_data': [0x10, ['pointer', ['void']]],
    'flavour': [0x18, ['Enumeration', {'target': 'int', 'choices': {0: 'bfd_target_unknown_flavour', 1: 'bfd_target_aout_flavour', 2: 'bfd_target_coff_flavour', 3: 'bfd_target_ecoff_flavour', 4: 'bfd_target_elf_flavour', 5: 'bfd_target_ieee_flavour', 6: 'bfd_target_nlm_flavour', 7: 'bfd_target_oasys_flavour', 8: 'bfd_target_tekhex_flavour', 9: 'bfd_target_srec_flavour', 10: 'bfd_target_ihex_flavour', 11: 'bfd_target_som_flavour', 12: 'bfd_target_os9k_flavour', 13: 'bfd_target_versados_flavour', 14: 'bfd_target_msdos_flavour', 15: 'bfd_target_evax_flavour'}}]],
    'arch': [0x1c, ['Enumeration', {'target': 'int', 'choices': {0: 'bfd_arch_unknown', 1: 'bfd_arch_obscure', 2: 'bfd_arch_m68k', 3: 'bfd_arch_vax', 4: 'bfd_arch_i960', 5: 'bfd_arch_a29k', 6: 'bfd_arch_sparc', 7: 'bfd_arch_mips', 8: 'bfd_arch_i386', 9: 'bfd_arch_we32k', 10: 'bfd_arch_tahoe', 11: 'bfd_arch_i860', 12: 'bfd_arch_romp', 13: 'bfd_arch_alliant', 14: 'bfd_arch_convex', 15: 'bfd_arch_m88k', 16: 'bfd_arch_pyramid', 17: 'bfd_arch_h8300', 18: 'bfd_arch_powerpc', 19: 'bfd_arch_rs6000', 20: 'bfd_arch_hppa', 21: 'bfd_arch_d10v', 22: 'bfd_arch_z8k', 23: 'bfd_arch_h8500', 24: 'bfd_arch_sh', 25: 'bfd_arch_alpha', 26: 'bfd_arch_arm', 27: 'bfd_arch_ns32k', 28: 'bfd_arch_w65', 29: 'bfd_arch_tic30', 30: 'bfd_arch_v850', 31: 'bfd_arch_arc', 32: 'bfd_arch_m32r', 33: 'bfd_arch_mn10200', 34: 'bfd_arch_mn10300', 35: 'bfd_arch_cris', 36: 'bfd_arch_microblaze', 37: 'bfd_arch_moxie', 38: 'bfd_arch_ia64', 39: 'bfd_arch_nios2', 40: 'bfd_arch_lm32', 41: 'bfd_arch_last'}}]],
    'mach': [0x20, ['unsigned long']],
    'endian': [0x28, ['Enumeration', {'target': 'int', 'choices': {0: 'BFD_ENDIAN_BIG', 1: 'BFD_ENDIAN_LITTLE', 2: 'BFD_ENDIAN_UNKNOWN'}}]],
    'symbols': [0x30, ['pointer', ['pointer', ['symbol_cache_entry']]]],
    'num_symbols': [0x38, ['int']],
    'flags': [0x40, ['unsigned long']],
    'private_data': [0x48, ['pointer', ['void']]],
    'read_memory_func': [0x50, ['pointer', ['void']]],
    'memory_error_func': [0x58, ['pointer', ['void']]],
    'print_address_func': [0x60, ['pointer', ['void']]],
    'print_insn': [0x68, ['pointer', ['void']]],
    'symbol_at_address_func': [0x70, ['pointer', ['void']]],
    'buffer': [0x78, ['pointer', ['unsigned char']]],
    'buffer_vma': [0x80, ['unsigned long']],
    'buffer_length': [0x88, ['int']],
    'bytes_per_line': [0x8c, ['int']],
    'bytes_per_chunk': [0x90, ['int']],
    'display_endian': [0x94, ['Enumeration', {'target': 'int', 'choices': {0: 'BFD_ENDIAN_BIG', 1: 'BFD_ENDIAN_LITTLE', 2: 'BFD_ENDIAN_UNKNOWN'}}]],
    'insn_info_valid': [0x98, ['char']],
    'branch_delay_insns': [0x99, ['char']],
    'data_size': [0x9a, ['char']],
    'insn_type': [0x9c, ['Enumeration', {'target': 'int', 'choices': {0: 'dis_noninsn', 1: 'dis_nonbranch', 2: 'dis_branch', 3: 'dis_condbranch', 4: 'dis_jsr', 5: 'dis_condjsr', 6: 'dis_dref', 7: 'dis_dref2'}}]],
    'target': [0xa0, ['unsigned long']],
    'target2': [0xa8, ['unsigned long']],
    'disassembler_options': [0xb0, ['pointer', ['char']]],
}],
  'CCIDBus': [ 0x68, {
    'qbus': [0x0, ['BusState']],
}],
  'SpiceChannelList': [ 0x10, {
    'next': [0x0, ['pointer', ['SpiceChannelList']]],
    'value': [0x8, ['pointer', ['SpiceChannel']]],
}],
  'MemStatus': [ 0x18, {
    'dimm': [0x0, ['pointer', ['DeviceState']]],
    'is_enabled': [0x8, ['unsigned char']],
    'is_inserting': [0x9, ['unsigned char']],
    'is_removing': [0xa, ['unsigned char']],
    'ost_event': [0xc, ['unsigned int']],
    'ost_status': [0x10, ['unsigned int']],
}],
  'vfio_group_head': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['VFIOGroup']]],
}],
  '_Sink': [ 0x1, {
}],
  'Vmxnet3_TxCompDesc': [ 0x10, {
    'ext1': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 12}]],
    'txdIdx': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 0}]],
    'ext2': [0x4, ['unsigned int']],
    'ext3': [0x8, ['unsigned int']],
    'rsvd': [0xc, ['BitField', {'end_bit': 24, 'start_bit': 0}]],
    'type': [0xc, ['BitField', {'end_bit': 31, 'start_bit': 24}]],
    'gen': [0xc, ['BitField', {'end_bit': 32, 'start_bit': 31}]],
}],
  'PCIBridge': [ 0x1410, {
    'parent_obj': [0x0, ['PCIDevice']],
    'sec_bus': [0x8f0, ['PCIBus']],
    'address_space_mem': [0x11f0, ['MemoryRegion']],
    'address_space_io': [0x12f0, ['MemoryRegion']],
    'windows': [0x13f0, ['pointer', ['PCIBridgeWindows']]],
    'map_irq': [0x13f8, ['pointer', ['void']]],
    'bus_name': [0x1400, ['pointer', ['char']]],
}],
  '_XkbServerMapRec': [ 0x40, {
    'num_acts': [0x0, ['unsigned short']],
    'size_acts': [0x2, ['unsigned short']],
    'acts': [0x8, ['pointer', ['_XkbAction']]],
    'behaviors': [0x10, ['pointer', ['_XkbBehavior']]],
    'key_acts': [0x18, ['pointer', ['unsigned short']]],
    'explicit': [0x20, ['pointer', ['unsigned char']]],
    'vmods': [0x28, ['array', 16, ['unsigned char']]],
    'vmodmap': [0x38, ['pointer', ['unsigned short']]],
}],
  'AHCIControlRegs': [ 0x14, {
    'cap': [0x0, ['unsigned int']],
    'ghc': [0x4, ['unsigned int']],
    'irqstatus': [0x8, ['unsigned int']],
    'impl': [0xc, ['unsigned int']],
    'version': [0x10, ['unsigned int']],
}],
  '__unnamed_0xc7c': [ 0x10, {
    'le_next': [0x0, ['pointer', ['QEMUTimerList']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['QEMUTimerList']]]],
}],
  '__unnamed_0x9434': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['V9fsPDU']]],
}],
  'q_obj_SPICE_INITIALIZED_arg': [ 0x10, {
    'server': [0x0, ['pointer', ['SpiceServerInfo']]],
    'client': [0x8, ['pointer', ['SpiceChannel']]],
}],
  'hmac_sha512_ctx': [ 0x288, {
    'outer': [0x0, ['sha512_ctx']],
    'inner': [0xd8, ['sha512_ctx']],
    'state': [0x1b0, ['sha512_ctx']],
}],
  'ilist_traits<llvm::GlobalVariable': [ 0x10, {
    'Sentinel': [0x0, ['void']],
}],
  'QXLSurfaceCmd': [ 0x29, {
    'release_info': [0x0, ['QXLReleaseInfo']],
    'surface_id': [0x8, ['unsigned int']],
    'type': [0xc, ['unsigned char']],
    'flags': [0xd, ['unsigned int']],
    'u': [0x11, ['__unnamed_0x4160']],
}],
  'vfio_as_head': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['VFIOAddressSpace']]],
}],
  'VirtIOBlockReq': [ 0xa8, {
    'elem': [0x0, ['VirtQueueElement']],
    'sector_num': [0x30, ['long']],
    'dev': [0x38, ['pointer', ['VirtIOBlock']]],
    'vq': [0x40, ['pointer', ['VirtQueue']]],
    'in': [0x48, ['pointer', ['virtio_blk_inhdr']]],
    'out': [0x50, ['virtio_blk_outhdr']],
    'qiov': [0x60, ['QEMUIOVector']],
    'in_len': [0x78, ['unsigned long']],
    'next': [0x80, ['pointer', ['VirtIOBlockReq']]],
    'mr_next': [0x88, ['pointer', ['VirtIOBlockReq']]],
    'acct': [0x90, ['BlockAcctCookie']],
}],
  'BlockDevOps': [ 0x28, {
    'change_media_cb': [0x0, ['pointer', ['void']]],
    'eject_request_cb': [0x8, ['pointer', ['void']]],
    'is_tray_open': [0x10, ['pointer', ['void']]],
    'is_medium_locked': [0x18, ['pointer', ['void']]],
    'resize_cb': [0x20, ['pointer', ['void']]],
}],
  '__unnamed_0x1441': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['USBPort']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['USBPort']]]],
}],
  'VirtQueueElement': [ 0x30, {
    'index': [0x0, ['unsigned int']],
    'out_num': [0x4, ['unsigned int']],
    'in_num': [0x8, ['unsigned int']],
    'in_addr': [0x10, ['pointer', ['unsigned long']]],
    'out_addr': [0x18, ['pointer', ['unsigned long']]],
    'in_sg': [0x20, ['pointer', ['iovec']]],
    'out_sg': [0x28, ['pointer', ['iovec']]],
}],
  'InternalSnapshotState': [ 0x1d8, {
    'common': [0x0, ['BlkActionState']],
    'bs': [0x28, ['pointer', ['BlockDriverState']]],
    'aio_context': [0x30, ['pointer', ['AioContext']]],
    'sn': [0x38, ['QEMUSnapshotInfo']],
    'created': [0x1d0, ['unsigned char']],
}],
  'in_addr': [ 0x4, {
    's_addr': [0x0, ['unsigned int']],
}],
  'usb_redir_free_bulk_streams_header': [ 0x4, {
    'endpoints': [0x0, ['unsigned int']],
}],
  'NetdevDumpOptions': [ 0x20, {
    'has_len': [0x0, ['unsigned char']],
    'len': [0x8, ['unsigned long']],
    'has_file': [0x10, ['unsigned char']],
    'file': [0x18, ['pointer', ['char']]],
}],
  'xs_permissions': [ 0x8, {
    'id': [0x0, ['unsigned int']],
    'perms': [0x4, ['Enumeration', {'target': 'int', 'choices': {0: 'XS_PERM_NONE', 8: 'XS_PERM_OWNER', 2: 'XS_PERM_WRITE', 4: 'XS_PERM_ENOENT_OK', 1: 'XS_PERM_READ'}}]],
}],
  'OHCIPort': [ 0x50, {
    'port': [0x0, ['USBPort']],
    'ctrl': [0x48, ['unsigned int']],
}],
  'NetHubPort': [ 0x190, {
    'nc': [0x0, ['NetClientState']],
    'next': [0x170, ['__unnamed_0x181e']],
    'hub': [0x180, ['pointer', ['NetHub']]],
    'id': [0x188, ['int']],
}],
  'XenIOState': [ 0x218, {
    'ioservid': [0x0, ['unsigned short']],
    'shared_page': [0x8, ['pointer', ['shared_iopage']]],
    'shared_vmport_page': [0x10, ['pointer', ['shared_vmport_iopage']]],
    'buffered_io_page': [0x18, ['pointer', ['buffered_iopage']]],
    'buffered_io_timer': [0x20, ['pointer', ['QEMUTimer']]],
    'cpu_by_vcpu_id': [0x28, ['pointer', ['pointer', ['CPUState']]]],
    'ioreq_local_port': [0x30, ['pointer', ['unsigned int']]],
    'bufioreq_local_port': [0x38, ['unsigned int']],
    'xce_handle': [0x40, ['pointer', ['xc_interface_core']]],
    'send_vcpu': [0x48, ['int']],
    'xenstore': [0x50, ['pointer', ['xs_handle']]],
    'memory_listener': [0x58, ['MemoryListener']],
    'io_listener': [0xf8, ['MemoryListener']],
    'device_listener': [0x198, ['DeviceListener']],
    'physmap': [0x1b8, ['__unnamed_0x41c1']],
    'free_phys_offset': [0x1c0, ['unsigned long']],
    'log_for_dirtybit': [0x1c8, ['pointer', ['XenPhysmap']]],
    'exit': [0x1d0, ['Notifier']],
    'suspend': [0x1e8, ['Notifier']],
    'wakeup': [0x200, ['Notifier']],
}],
  'NetLegacyOptions': [ 0x10, {
    'type': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'NET_LEGACY_OPTIONS_KIND_NONE', 1: 'NET_LEGACY_OPTIONS_KIND_NIC', 2: 'NET_LEGACY_OPTIONS_KIND_USER', 3: 'NET_LEGACY_OPTIONS_KIND_TAP', 4: 'NET_LEGACY_OPTIONS_KIND_L2TPV3', 5: 'NET_LEGACY_OPTIONS_KIND_SOCKET', 6: 'NET_LEGACY_OPTIONS_KIND_VDE', 7: 'NET_LEGACY_OPTIONS_KIND_DUMP', 8: 'NET_LEGACY_OPTIONS_KIND_BRIDGE', 9: 'NET_LEGACY_OPTIONS_KIND_NETMAP', 10: 'NET_LEGACY_OPTIONS_KIND_VHOST_USER', 11: 'NET_LEGACY_OPTIONS_KIND__MAX'}}]],
    'u': [0x8, ['__unnamed_0xafca']],
}],
  'InputMoveEvent': [ 0x10, {
    'axis': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'INPUT_AXIS_X', 1: 'INPUT_AXIS_Y', 2: 'INPUT_AXIS__MAX'}}]],
    'value': [0x8, ['long']],
}],
  'e1000_tx': [ 0x10128, {
    'header': [0x0, ['array', 256, ['unsigned char']]],
    'vlan_header': [0x100, ['array', 4, ['unsigned char']]],
    'vlan': [0x104, ['array', 4, ['unsigned char']]],
    'data': [0x108, ['array', 65536, ['unsigned char']]],
    'size': [0x10108, ['unsigned short']],
    'vlan_needed': [0x1010a, ['unsigned char']],
    'props': [0x1010c, ['e1000x_txd_props']],
    'tso_frames': [0x10124, ['unsigned short']],
}],
  'HIDState': [ 0x130, {
    '__unnamed_0x22ac': [0x0, ['__unnamed_0x23ec']],
    'head': [0x104, ['unsigned int']],
    'n': [0x108, ['unsigned int']],
    'kind': [0x10c, ['int']],
    'protocol': [0x110, ['int']],
    'idle': [0x114, ['unsigned char']],
    'idle_pending': [0x115, ['unsigned char']],
    'idle_timer': [0x118, ['pointer', ['QEMUTimer']]],
    'event': [0x120, ['pointer', ['void']]],
    's': [0x128, ['pointer', ['QemuInputHandlerState']]],
}],
  'AIOReq': [ 0x48, {
    'aiocb': [0x0, ['pointer', ['SheepdogAIOCB']]],
    'iov_offset': [0x8, ['unsigned int']],
    'oid': [0x10, ['unsigned long']],
    'base_oid': [0x18, ['unsigned long']],
    'offset': [0x20, ['unsigned long']],
    'data_len': [0x28, ['unsigned int']],
    'flags': [0x2c, ['unsigned char']],
    'id': [0x30, ['unsigned int']],
    'create': [0x34, ['unsigned char']],
    'aio_siblings': [0x38, ['__unnamed_0x39f6']],
}],
  'XHCIEPContext': [ 0x88, {
    'xhci': [0x0, ['pointer', ['XHCIState']]],
    'slotid': [0x8, ['unsigned int']],
    'epid': [0xc, ['unsigned int']],
    'ring': [0x10, ['XHCIRing']],
    'xfer_count': [0x20, ['unsigned int']],
    'transfers': [0x28, ['__unnamed_0x4142']],
    'retry': [0x38, ['pointer', ['XHCITransfer']]],
    'type': [0x40, ['Enumeration', {'target': 'int', 'choices': {0: 'ET_INVALID', 1: 'ET_ISO_OUT', 2: 'ET_BULK_OUT', 3: 'ET_INTR_OUT', 4: 'ET_CONTROL', 5: 'ET_ISO_IN', 6: 'ET_BULK_IN', 7: 'ET_INTR_IN'}}]],
    'pctx': [0x48, ['unsigned long']],
    'max_psize': [0x50, ['unsigned int']],
    'state': [0x54, ['unsigned int']],
    'kick_active': [0x58, ['unsigned int']],
    'max_pstreams': [0x5c, ['unsigned int']],
    'lsa': [0x60, ['unsigned char']],
    'nr_pstreams': [0x64, ['unsigned int']],
    'pstreams': [0x68, ['pointer', ['XHCIStreamContext']]],
    'interval': [0x70, ['unsigned int']],
    'mfindex_last': [0x78, ['long']],
    'kick_timer': [0x80, ['pointer', ['QEMUTimer']]],
}],
  '__unnamed_0x3208': [ 0x20, {
    'msr': [0x0, ['unsigned int']],
    'control': [0x8, ['unsigned long long']],
    'evt_page': [0x10, ['unsigned long long']],
    'msg_page': [0x18, ['unsigned long long']],
}],
  '__unnamed_0x3209': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['BlockDriverState']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['BlockDriverState']]]],
}],
  'TMProperty': [ 0x8, {
    'get': [0x0, ['pointer', ['void']]],
}],
  'ilist_nextprev_traits<llvm::NamedMDNode': [ 0x1, {
}],
  'mfi_array': [ 0x120, {
    'size': [0x0, ['unsigned long']],
    'num_drives': [0x8, ['unsigned char']],
    'reserved': [0x9, ['unsigned char']],
    'array_ref': [0xa, ['unsigned short']],
    'pad': [0xc, ['array', 20, ['unsigned char']]],
    'pd': [0x20, ['array', 32, ['__unnamed_0x7c73']]],
}],
  'of_dpa_flow_context': [ 0x98, {
    'in_pport': [0x0, ['unsigned int']],
    'tunnel_id': [0x4, ['unsigned int']],
    'iov': [0x8, ['pointer', ['iovec']]],
    'iovcnt': [0x10, ['int']],
    'ethhdr_rewrite': [0x14, ['eth_header']],
    'vlanhdr_rewrite': [0x22, ['vlan_header']],
    'vlanhdr': [0x26, ['vlan_header']],
    'of_dpa': [0x30, ['pointer', ['of_dpa']]],
    'fields': [0x38, ['of_dpa_flow_pkt_fields']],
    'action_set': [0x78, ['of_dpa_flow_action']],
}],
  'V9fsFidState': [ 0xa0, {
    'fid_type': [0x0, ['int']],
    'fid': [0x4, ['int']],
    'path': [0x8, ['V9fsPath']],
    'fs': [0x18, ['V9fsFidOpenState']],
    'fs_reclaim': [0x48, ['V9fsFidOpenState']],
    'flags': [0x78, ['int']],
    'open_flags': [0x7c, ['int']],
    'uid': [0x80, ['unsigned int']],
    'ref': [0x84, ['int']],
    'clunked': [0x88, ['int']],
    'next': [0x90, ['pointer', ['V9fsFidState']]],
    'rclm_lst': [0x98, ['pointer', ['V9fsFidState']]],
}],
  'pci_data': [ 0x18, {
    'signature': [0x0, ['unsigned int']],
    'vendor': [0x4, ['unsigned short']],
    'device': [0x6, ['unsigned short']],
    'vitaldata': [0x8, ['unsigned short']],
    'dlen': [0xa, ['unsigned short']],
    'drevision': [0xc, ['unsigned char']],
    'class_lo': [0xd, ['unsigned char']],
    'class_hi': [0xe, ['unsigned short']],
    'ilen': [0x10, ['unsigned short']],
    'irevision': [0x12, ['unsigned short']],
    'type': [0x14, ['unsigned char']],
    'indicator': [0x15, ['unsigned char']],
    'reserved': [0x16, ['unsigned short']],
}],
  'QemuSemaphore': [ 0x20, {
    'sem': [0x0, ['__unnamed_0xa18']],
}],
  'AcpiDmarHardwareUnit': [ 0x10, {
    'type': [0x0, ['unsigned short']],
    'length': [0x2, ['unsigned short']],
    'flags': [0x4, ['unsigned char']],
    'reserved': [0x5, ['unsigned char']],
    'pci_segment': [0x6, ['unsigned short']],
    'address': [0x8, ['unsigned long']],
    'scope': [0x10, ['array', 0, ['AcpiDmarDeviceScope']]],
}],
  'mfi_frame_header': [ 0x18, {
    'frame_cmd': [0x0, ['unsigned char']],
    'sense_len': [0x1, ['unsigned char']],
    'cmd_status': [0x2, ['unsigned char']],
    'scsi_status': [0x3, ['unsigned char']],
    'target_id': [0x4, ['unsigned char']],
    'lun_id': [0x5, ['unsigned char']],
    'cdb_len': [0x6, ['unsigned char']],
    'sge_count': [0x7, ['unsigned char']],
    'context': [0x8, ['unsigned long']],
    'flags': [0x10, ['unsigned short']],
    'timeout': [0x12, ['unsigned short']],
    'data_len': [0x14, ['unsigned int']],
}],
  '__unnamed_0x199e': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['CryptoDevBackendClient']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['CryptoDevBackendClient']]]],
}],
  'BitmapRcu': [ 0x20, {
    'rcu': [0x0, ['rcu_head']],
    'bmap': [0x10, ['pointer', ['unsigned long']]],
    'unsentmap': [0x18, ['pointer', ['unsigned long']]],
}],
  '__unnamed_0x7b0c': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['SCSIRequest']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['SCSIRequest']]]],
}],
  'qemu_signalfd_siginfo': [ 0x80, {
    'ssi_signo': [0x0, ['unsigned int']],
    'ssi_errno': [0x4, ['int']],
    'ssi_code': [0x8, ['int']],
    'ssi_pid': [0xc, ['unsigned int']],
    'ssi_uid': [0x10, ['unsigned int']],
    'ssi_fd': [0x14, ['int']],
    'ssi_tid': [0x18, ['unsigned int']],
    'ssi_band': [0x1c, ['unsigned int']],
    'ssi_overrun': [0x20, ['unsigned int']],
    'ssi_trapno': [0x24, ['unsigned int']],
    'ssi_status': [0x28, ['int']],
    'ssi_int': [0x2c, ['int']],
    'ssi_ptr': [0x30, ['unsigned long']],
    'ssi_utime': [0x38, ['unsigned long']],
    'ssi_stime': [0x40, ['unsigned long']],
    'ssi_addr': [0x48, ['unsigned long']],
    'pad': [0x50, ['array', 48, ['unsigned char']]],
}],
  'SpicePlaybackInterface': [ 0x18, {
    'base': [0x0, ['SpiceBaseInterface']],
}],
  'QXLCopyBits': [ 0x8, {
    'src_pos': [0x0, ['QXLPoint']],
}],
  '__unnamed_0x4a74': [ 0x10, {
    'le_next': [0x0, ['pointer', ['LoadStateEntry']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['LoadStateEntry']]]],
}],
  '__unnamed_0x3b21': [ 0x10, {
    'id': [0x0, ['int']],
    'x': [0x4, ['int']],
    'y': [0x8, ['int']],
    'on': [0xc, ['int']],
}],
  'SimpleSpiceCursor': [ 0xd8, {
    'cmd': [0x0, ['QXLCursorCmd']],
    'ext': [0x96, ['QXLCommandExt']],
    'cursor': [0xae, ['QXLCursor']],
}],
  '__unnamed_0x928': [ 0x10, {
    'ifrn_name': [0x0, ['array', 16, ['char']]],
}],
  'NvdimmFuncGetLabelSizeOut': [ 0x10, {
    'len': [0x0, ['unsigned int']],
    'func_ret_status': [0x4, ['unsigned int']],
    'label_size': [0x8, ['unsigned int']],
    'max_xfer': [0xc, ['unsigned int']],
}],
  'q_obj_query_command_line_options_arg': [ 0x10, {
    'has_option': [0x0, ['unsigned char']],
    'option': [0x8, ['pointer', ['char']]],
}],
  'QXLPattern': [ 0x10, {
    'pat': [0x0, ['unsigned long']],
    'pos': [0x8, ['QXLPoint']],
}],
  'ChardevRingbuf': [ 0x20, {
    'has_logfile': [0x0, ['unsigned char']],
    'logfile': [0x8, ['pointer', ['char']]],
    'has_logappend': [0x10, ['unsigned char']],
    'logappend': [0x11, ['unsigned char']],
    'has_size': [0x12, ['unsigned char']],
    'size': [0x18, ['long']],
}],
  'KVMPITState': [ 0x240, {
    'parent_obj': [0x0, ['PITCommonState']],
    'lost_tick_policy': [0x230, ['Enumeration', {'target': 'int', 'choices': {0: 'LOST_TICK_POLICY_DISCARD', 1: 'LOST_TICK_POLICY_DELAY', 2: 'LOST_TICK_POLICY_MERGE', 3: 'LOST_TICK_POLICY_SLEW', 4: 'LOST_TICK_POLICY__MAX'}}]],
    'vm_stopped': [0x234, ['unsigned char']],
    'kernel_clock_offset': [0x238, ['long']],
}],
  '__unnamed_0x2b5e': [ 0x10, {
    '__unnamed_0x2b66': [0x0, ['__unnamed_0x2b2f']],
}],
  'DumpState': [ 0x10, {
    'start_ts': [0x0, ['long']],
    'fd': [0x8, ['int']],
    'pcap_caplen': [0xc, ['int']],
}],
  'q_obj_block_passwd_arg': [ 0x28, {
    'has_device': [0x0, ['unsigned char']],
    'device': [0x8, ['pointer', ['char']]],
    'has_node_name': [0x10, ['unsigned char']],
    'node_name': [0x18, ['pointer', ['char']]],
    'password': [0x20, ['pointer', ['char']]],
}],
  'NCQTransferState': [ 0x70, {
    'drive': [0x0, ['pointer', ['AHCIDevice']]],
    'aiocb': [0x8, ['pointer', ['BlockAIOCB']]],
    'cmdh': [0x10, ['pointer', ['AHCICmdHdr']]],
    'sglist': [0x18, ['QEMUSGList']],
    'acct': [0x40, ['BlockAcctCookie']],
    'sector_count': [0x58, ['unsigned int']],
    'lba': [0x60, ['unsigned long']],
    'tag': [0x68, ['unsigned char']],
    'cmd': [0x69, ['unsigned char']],
    'slot': [0x6a, ['unsigned char']],
    'used': [0x6b, ['unsigned char']],
    'halt': [0x6c, ['unsigned char']],
}],
  'USBCombinedPacket': [ 0x30, {
    'first': [0x0, ['pointer', ['USBPacket']]],
    'packets': [0x8, ['packets_head']],
    'iov': [0x18, ['QEMUIOVector']],
}],
  'virtio_crypto_hash_data_req': [ 0x30, {
    'para': [0x0, ['virtio_crypto_hash_para']],
    'padding': [0x8, ['array', 40, ['unsigned char']]],
}],
  'kvm_coalesced_mmio_ring': [ 0x8, {
    'first': [0x0, ['unsigned int']],
    'last': [0x4, ['unsigned int']],
    'coalesced_mmio': [0x8, ['array', 0, ['kvm_coalesced_mmio']]],
}],
  'ZMMReg': [ 0x40, {
    '_b_ZMMReg': [0x0, ['array', 64, ['unsigned char']]],
    '_d_ZMMReg': [0x0, ['array', 8, ['unsigned long']]],
    '_q_ZMMReg': [0x0, ['array', 8, ['unsigned long']]],
    '_w_ZMMReg': [0x0, ['array', 32, ['unsigned short']]],
    '_s_ZMMReg': [0x0, ['array', 16, ['unsigned int']]],
    '_l_ZMMReg': [0x0, ['array', 16, ['unsigned int']]],
}],
  '__unnamed_0x2bb6': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['DeviceListener']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['DeviceListener']]]],
}],
  'count_info': [ 0xc, {
    'bytes': [0x0, ['int']],
    'blocks': [0x4, ['int']],
    'ptr': [0x8, ['int']],
}],
  'ilist_sentinel_traits<llvm::Function': [ 0x1, {
}],
  'usb_redir_stop_interrupt_receiving_header': [ 0x1, {
    'endpoint': [0x0, ['unsigned char']],
}],
  'TCGLabel': [ 0x10, {
    'id': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 1}]],
    'has_value': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'u': [0x8, ['__unnamed_0x390f']],
}],
  'PCIHostBridgeClass': [ 0xe0, {
    'parent_class': [0x0, ['SysBusDeviceClass']],
    'root_bus_path': [0xd8, ['pointer', ['void']]],
}],
  '__unnamed_0x1fd3': [ 0x10, {
    'd': [0x0, ['__unnamed_0x134e']],
    'mmx': [0x0, ['MMXReg']],
}],
  'ChildrenHead': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['BusChild']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['BusChild']]]],
}],
  'remove_reference<std::pair<long int, llvm::Type*': [ 0x1, {
}],
  'q_obj_PCDIMMDeviceInfo_wrapper': [ 0x8, {
    'data': [0x0, ['pointer', ['PCDIMMDeviceInfo']]],
}],
  '__unnamed_0x4c53': [ 0x2, {
    'device': [0x0, ['unsigned char']],
    'function': [0x1, ['unsigned char']],
}],
  'AcpiPciHpState': [ 0xd20, {
    'acpi_pcihp_pci_status': [0x0, ['array', 256, ['AcpiPciHpPciStatus']]],
    'hotplug_select': [0xc00, ['unsigned int']],
    'root': [0xc08, ['pointer', ['PCIBus']]],
    'io': [0xc10, ['MemoryRegion']],
    'legacy_piix': [0xd10, ['unsigned char']],
    'io_base': [0xd12, ['unsigned short']],
    'io_len': [0xd14, ['unsigned short']],
}],
  'VirtIORngPCI': [ 0x8540, {
    'parent_obj': [0x0, ['VirtIOPCIProxy']],
    'vdev': [0x8410, ['VirtIORNG']],
}],
  'tpm_req_hdr': [ 0xa, {
    'tag': [0x0, ['unsigned short']],
    'len': [0x2, ['unsigned int']],
    'ordinal': [0x6, ['unsigned int']],
}],
  'CPUState': [ 0x82a0, {
    'parent_obj': [0x0, ['DeviceState']],
    'nr_cores': [0x70, ['int']],
    'nr_threads': [0x74, ['int']],
    'numa_node': [0x78, ['int']],
    'thread': [0x80, ['pointer', ['QemuThread']]],
    'thread_id': [0x88, ['int']],
    'host_tid': [0x8c, ['unsigned int']],
    'running': [0x90, ['unsigned char']],
    'has_waiter': [0x91, ['unsigned char']],
    'halt_cond': [0x98, ['pointer', ['QemuCond']]],
    'thread_kicked': [0xa0, ['unsigned char']],
    'created': [0xa1, ['unsigned char']],
    'stop': [0xa2, ['unsigned char']],
    'stopped': [0xa3, ['unsigned char']],
    'unplug': [0xa4, ['unsigned char']],
    'crash_occurred': [0xa5, ['unsigned char']],
    'exit_request': [0xa6, ['unsigned char']],
    'interrupt_request': [0xa8, ['unsigned int']],
    'singlestep_enabled': [0xac, ['int']],
    'icount_extra': [0xb0, ['long']],
    'jmp_env': [0xb8, ['array', 1, ['__jmp_buf_tag']]],
    'work_mutex': [0x180, ['QemuMutex']],
    'queued_work_first': [0x1a8, ['pointer', ['qemu_work_item']]],
    'queued_work_last': [0x1b0, ['pointer', ['qemu_work_item']]],
    'cpu_ases': [0x1b8, ['pointer', ['CPUAddressSpace']]],
    'num_ases': [0x1c0, ['int']],
    'as': [0x1c8, ['pointer', ['AddressSpace']]],
    'memory': [0x1d0, ['pointer', ['MemoryRegion']]],
    'env_ptr': [0x1d8, ['pointer', ['void']]],
    'tb_jmp_cache': [0x1e0, ['array', 4096, ['pointer', ['TranslationBlock']]]],
    'gdb_regs': [0x81e0, ['pointer', ['GDBRegisterState']]],
    'gdb_num_regs': [0x81e8, ['int']],
    'gdb_num_g_regs': [0x81ec, ['int']],
    'node': [0x81f0, ['__unnamed_0x1480']],
    'breakpoints': [0x8200, ['breakpoints_head']],
    'watchpoints': [0x8210, ['watchpoints_head']],
    'watchpoint_hit': [0x8220, ['pointer', ['CPUWatchpoint']]],
    'opaque': [0x8228, ['pointer', ['void']]],
    'mem_io_pc': [0x8230, ['unsigned long']],
    'mem_io_vaddr': [0x8238, ['unsigned long']],
    'kvm_fd': [0x8240, ['int']],
    'kvm_vcpu_dirty': [0x8244, ['unsigned char']],
    'kvm_state': [0x8248, ['pointer', ['KVMState']]],
    'kvm_run': [0x8250, ['pointer', ['kvm_run']]],
    'trace_dstate': [0x8258, ['pointer', ['unsigned long']]],
    'cpu_index': [0x8260, ['int']],
    'halted': [0x8264, ['unsigned int']],
    'icount_decr': [0x8268, ['__unnamed_0x1500']],
    'can_do_io': [0x826c, ['unsigned int']],
    'exception_index': [0x8270, ['int']],
    'rr_guest_instr_count': [0x8278, ['unsigned long']],
    'panda_guest_pc': [0x8280, ['unsigned long']],
    'throttle_thread_scheduled': [0x8288, ['unsigned char']],
    'tcg_exit_req': [0x828c, ['unsigned int']],
    'hax_vcpu_dirty': [0x8290, ['unsigned char']],
    'hax_vcpu': [0x8298, ['pointer', ['hax_vcpu_state']]],
}],
  'blkif_x86_32_request': [ 0x6c, {
    'operation': [0x0, ['unsigned char']],
    'nr_segments': [0x1, ['unsigned char']],
    'handle': [0x2, ['unsigned short']],
    'id': [0x4, ['unsigned long']],
    'sector_number': [0xc, ['unsigned long']],
    'seg': [0x14, ['array', 11, ['blkif_request_segment']]],
}],
  'do_nmi_s': [ 0x18, {
    'cpu_index': [0x0, ['int']],
    'err': [0x8, ['pointer', ['Error']]],
    'handled': [0x10, ['unsigned char']],
}],
  'rebind<llvm::Value*': [ 0x1, {
}],
  'CMD646BAR': [ 0x210, {
    'cmd': [0x0, ['MemoryRegion']],
    'data': [0x100, ['MemoryRegion']],
    'bus': [0x200, ['pointer', ['IDEBus']]],
    'pci_dev': [0x208, ['pointer', ['PCIIDEState']]],
}],
  'QIOChannelWebsockHeader': [ 0xe, {
    'b0': [0x0, ['unsigned char']],
    'b1': [0x1, ['unsigned char']],
    'u': [0x2, ['__unnamed_0x1dbb']],
}],
  '__unnamed_0xda09': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['SnapshotEntry']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['SnapshotEntry']]]],
}],
  '__unnamed_0x146': [ 0x80, {
    '__val': [0x0, ['array', 16, ['unsigned long']]],
}],
  'q_obj_BlockdevBackup_wrapper': [ 0x8, {
    'data': [0x0, ['pointer', ['BlockdevBackup']]],
}],
  'X86LegacyXSaveArea': [ 0x200, {
    'data': [0x0, ['array', 512, ['unsigned char']]],
    '__unnamed_0x3f52': [0x0, ['__unnamed_0x3e84']],
}],
  '__unnamed_0x11d5': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['BusState']]],
}],
  'kvm_userspace_memory_region': [ 0x20, {
    'slot': [0x0, ['unsigned int']],
    'flags': [0x4, ['unsigned int']],
    'guest_phys_addr': [0x8, ['unsigned long long']],
    'memory_size': [0x10, ['unsigned long long']],
    'userspace_addr': [0x18, ['unsigned long long']],
}],
  'QXLCursorHeader': [ 0x12, {
    'unique': [0x0, ['unsigned long']],
    'type': [0x8, ['unsigned short']],
    'width': [0xa, ['unsigned short']],
    'height': [0xc, ['unsigned short']],
    'hot_spot_x': [0xe, ['unsigned short']],
    'hot_spot_y': [0x10, ['unsigned short']],
}],
  'rebind<std::_Rb_tree_node<std::__cxx11::basic_string<char, std::char_traits<char': [ 0x1, {
}],
  'ilist_default_traits<llvm::Argument': [ 0x1, {
}],
  'MemoryRegionOps': [ 0x80, {
    'read': [0x0, ['pointer', ['void']]],
    'write': [0x8, ['pointer', ['void']]],
    'read_with_attrs': [0x10, ['pointer', ['void']]],
    'write_with_attrs': [0x18, ['pointer', ['void']]],
    'endianness': [0x20, ['Enumeration', {'target': 'int', 'choices': {0: 'DEVICE_NATIVE_ENDIAN', 1: 'DEVICE_BIG_ENDIAN', 2: 'DEVICE_LITTLE_ENDIAN'}}]],
    'valid': [0x28, ['Enumeration', {'target': 'int', 'choices': {0: 'RR_DEBUG_SILENT', 1: 'RR_DEBUG_WHISPER', 2: 'RR_DEBUG_QUIET', 3: 'RR_DEBUG_NOISY'}}]],
    'impl': [0x40, ['__unnamed_0x1d1a']],
    'old_mmio': [0x50, ['MemoryRegionMmio']],
}],
  'VHDXFileParameters': [ 0x8, {
    'block_size': [0x0, ['unsigned int']],
    'data_bits': [0x4, ['unsigned int']],
}],
  '__unnamed_0x1a8d': [ 0x10, {
    'type': [0x0, ['unsigned int']],
    'code': [0x8, ['unsigned long']],
}],
  'pixman_color': [ 0x8, {
    'red': [0x0, ['unsigned short']],
    'green': [0x2, ['unsigned short']],
    'blue': [0x4, ['unsigned short']],
    'alpha': [0x6, ['unsigned short']],
}],
  'EEprom9346': [ 0x94, {
    'contents': [0x0, ['array', 64, ['unsigned short']]],
    'mode': [0x80, ['int']],
    'tick': [0x84, ['unsigned int']],
    'address': [0x88, ['unsigned char']],
    'input': [0x8a, ['unsigned short']],
    'output': [0x8c, ['unsigned short']],
    'eecs': [0x8e, ['unsigned char']],
    'eesk': [0x8f, ['unsigned char']],
    'eedi': [0x90, ['unsigned char']],
    'eedo': [0x91, ['unsigned char']],
}],
  'PVSCSIRingReqDesc': [ 0x80, {
    'context': [0x0, ['unsigned long']],
    'dataAddr': [0x8, ['unsigned long']],
    'dataLen': [0x10, ['unsigned long']],
    'senseAddr': [0x18, ['unsigned long']],
    'senseLen': [0x20, ['unsigned int']],
    'flags': [0x24, ['unsigned int']],
    'cdb': [0x28, ['array', 16, ['unsigned char']]],
    'cdbLen': [0x38, ['unsigned char']],
    'lun': [0x39, ['array', 8, ['unsigned char']]],
    'tag': [0x41, ['unsigned char']],
    'bus': [0x42, ['unsigned char']],
    'target': [0x43, ['unsigned char']],
    'vcpuHint': [0x44, ['unsigned char']],
    'unused': [0x45, ['array', 59, ['unsigned char']]],
}],
  'TimedAverage': [ 0x60, {
    'period': [0x0, ['unsigned long']],
    'windows': [0x8, ['array', 2, ['TimedAverageWindow']]],
    'current': [0x58, ['unsigned int']],
    'clock_type': [0x5c, ['Enumeration', {'target': 'int', 'choices': {0: 'QEMU_CLOCK_REALTIME', 1: 'QEMU_CLOCK_VIRTUAL', 2: 'QEMU_CLOCK_HOST', 3: 'QEMU_CLOCK_VIRTUAL_RT', 4: 'QEMU_CLOCK_MAX'}}]],
}],
  'PCIEAERErr': [ 0x28, {
    'status': [0x0, ['unsigned int']],
    'source_id': [0x4, ['unsigned short']],
    'flags': [0x6, ['unsigned short']],
    'header': [0x8, ['array', 4, ['unsigned int']]],
    'prefix': [0x18, ['array', 4, ['unsigned int']]],
}],
  'RR_log_t': [ 0x90, {
    'type': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'RECORD', 1: 'REPLAY'}}]],
    'last_prog_point': [0x8, ['RR_prog_point_t']],
    'name': [0x10, ['pointer', ['char']]],
    'fp': [0x18, ['pointer', ['_IO_FILE']]],
    'size': [0x20, ['unsigned long long']],
    'bytes_read': [0x28, ['unsigned long']],
    'current_item': [0x30, ['rr_log_entry_t']],
    'current_item_valid': [0x80, ['unsigned char']],
    'item_number': [0x88, ['unsigned long']],
}],
  'mu': [ 0x18, {
    'm': [0x0, ['void']],
    'a': [0x10, ['unsigned char']],
    's': [0x14, ['unsigned int']],
}],
  'UnixSocketAddress': [ 0x8, {
    'path': [0x0, ['pointer', ['char']]],
}],
  'Abort': [ 0x1, {
    'qapi_dummy_for_empty_struct': [0x0, ['char']],
}],
  '_IO_FILE': [ 0xd8, {
    '_flags': [0x0, ['int']],
    '_IO_read_ptr': [0x8, ['pointer', ['char']]],
    '_IO_read_end': [0x10, ['pointer', ['char']]],
    '_IO_read_base': [0x18, ['pointer', ['char']]],
    '_IO_write_base': [0x20, ['pointer', ['char']]],
    '_IO_write_ptr': [0x28, ['pointer', ['char']]],
    '_IO_write_end': [0x30, ['pointer', ['char']]],
    '_IO_buf_base': [0x38, ['pointer', ['char']]],
    '_IO_buf_end': [0x40, ['pointer', ['char']]],
    '_IO_save_base': [0x48, ['pointer', ['char']]],
    '_IO_backup_base': [0x50, ['pointer', ['char']]],
    '_IO_save_end': [0x58, ['pointer', ['char']]],
    '_markers': [0x60, ['pointer', ['_IO_marker']]],
    '_chain': [0x68, ['pointer', ['_IO_FILE']]],
    '_fileno': [0x70, ['int']],
    '_flags2': [0x74, ['int']],
    '_old_offset': [0x78, ['long']],
    '_cur_column': [0x80, ['unsigned short']],
    '_vtable_offset': [0x82, ['signed char']],
    '_shortbuf': [0x83, ['array', 1, ['char']]],
    '_lock': [0x88, ['pointer', 'void']],
    '_offset': [0x90, ['long']],
    '__pad1': [0x98, ['pointer', ['void']]],
    '__pad2': [0xa0, ['pointer', ['void']]],
    '__pad3': [0xa8, ['pointer', ['void']]],
    '__pad4': [0xb0, ['pointer', ['void']]],
    '__pad5': [0xb8, ['unsigned long']],
    '_mode': [0xc0, ['int']],
    '_unused2': [0xc4, ['array', 20, ['char']]],
}],
  'ms': [ 0x18, {
    'm': [0x0, ['void']],
    's': [0x10, ['unsigned int']],
}],
  'capture_list_head': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['CaptureState']]],
}],
  'of_dpa': [ 0x20, {
    'world': [0x0, ['pointer', ['world']]],
    'flow_tbl': [0x8, ['pointer', ['_GHashTable']]],
    'group_tbl': [0x10, ['pointer', ['_GHashTable']]],
    'flow_tbl_max_size': [0x18, ['unsigned int']],
    'group_tbl_max_size': [0x1c, ['unsigned int']],
}],
  '__unnamed_0x1045': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['InputLinux']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['InputLinux']]]],
}],
  'QemuOpt': [ 0x38, {
    'name': [0x0, ['pointer', ['char']]],
    'str': [0x8, ['pointer', ['char']]],
    'desc': [0x10, ['pointer', ['QemuOptDesc']]],
    'value': [0x18, ['Enumeration', {'target': 'int', 'choices': {0: 'QEMU_CLOCK_REALTIME', 1: 'QEMU_CLOCK_VIRTUAL', 2: 'QEMU_CLOCK_HOST', 3: 'QEMU_CLOCK_VIRTUAL_RT', 4: 'QEMU_CLOCK_MAX'}}]],
    'opts': [0x20, ['pointer', ['QemuOpts']]],
    'next': [0x28, ['__unnamed_0xa83']],
}],
  'QJSON': [ 0x10, {
    'str': [0x0, ['pointer', ['QString']]],
    'omit_comma': [0x8, ['unsigned char']],
}],
  'VFIOBAR': [ 0x48, {
    'region': [0x0, ['VFIORegion']],
    'ioport': [0x38, ['unsigned char']],
    'mem64': [0x39, ['unsigned char']],
    'quirks': [0x40, ['__unnamed_0x3382']],
}],
  'SnapshotInfo': [ 0x38, {
    'id': [0x0, ['pointer', ['char']]],
    'name': [0x8, ['pointer', ['char']]],
    'vm_state_size': [0x10, ['long']],
    'date_sec': [0x18, ['long']],
    'date_nsec': [0x20, ['long']],
    'vm_clock_sec': [0x28, ['long']],
    'vm_clock_nsec': [0x30, ['long']],
}],
  'XenPVDevice': [ 0xa00, {
    'parent_obj': [0x0, ['PCIDevice']],
    'vendor_id': [0x8f0, ['unsigned short']],
    'device_id': [0x8f2, ['unsigned short']],
    'revision': [0x8f4, ['unsigned char']],
    'size': [0x8f8, ['unsigned int']],
    'mmio': [0x900, ['MemoryRegion']],
}],
  'cb_listhead': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['capture_callback']]],
}],
  '__numeric_traits_integer<long unsigned int': [ 0x1, {
}],
  'VirtioPCIClass': [ 0x118, {
    'parent_class': [0x0, ['PCIDeviceClass']],
    'parent_dc_realize': [0x108, ['pointer', ['void']]],
    'realize': [0x110, ['pointer', ['void']]],
}],
  'blkif_back_rings': [ 0x18, {
    'x86_32_part': [0x0, ['blkif_x86_32_back_ring']],
    'common': [0x0, ['blkif_common_back_ring']],
    'x86_64_part': [0x0, ['blkif_x86_64_back_ring']],
    'native': [0x0, ['blkif_back_ring']],
}],
  'NBDRequestData': [ 0x20, {
    'entry': [0x0, ['__unnamed_0x392b']],
    'client': [0x8, ['pointer', ['NBDClient']]],
    'data': [0x10, ['pointer', ['unsigned char']]],
    'complete': [0x18, ['unsigned char']],
}],
  'X86IOMMUClass': [ 0xe8, {
    'parent': [0x0, ['SysBusDeviceClass']],
    'realize': [0xd8, ['pointer', ['void']]],
    'int_remap': [0xe0, ['pointer', ['void']]],
}],
  'qcrypto_nettle_hmac_ctx': [ 0x288, {
    'md5_ctx': [0x0, ['hmac_md5_ctx']],
    'ripemd160_ctx': [0x0, ['hmac_ripemd160_ctx']],
    'sha256_ctx': [0x0, ['hmac_sha256_ctx']],
    'sha512_ctx': [0x0, ['hmac_sha512_ctx']],
    'sha1_ctx': [0x0, ['hmac_sha1_ctx']],
}],
  'QCryptoTLSCredsAnon': [ 0x58, {
    'parent_obj': [0x0, ['QCryptoTLSCreds']],
    'data': [0x50, ['Enumeration', {'target': 'int', 'choices': {0: 'QEMU_CLOCK_REALTIME', 1: 'QEMU_CLOCK_VIRTUAL', 2: 'QEMU_CLOCK_HOST', 3: 'QEMU_CLOCK_VIRTUAL_RT', 4: 'QEMU_CLOCK_MAX'}}]],
}],
  '__unnamed_0x94c': [ 0x18, {
    'ifru_hwaddr': [0x0, ['sockaddr']],
    'ifru_data': [0x0, ['pointer', ['char']]],
    'ifru_broadaddr': [0x0, ['sockaddr']],
    'ifru_map': [0x0, ['ifmap']],
    'ifru_mtu': [0x0, ['int']],
    'ifru_addr': [0x0, ['sockaddr']],
    'ifru_flags': [0x0, ['short']],
    'ifru_ivalue': [0x0, ['int']],
    'ifru_newname': [0x0, ['array', 16, ['char']]],
    'ifru_dstaddr': [0x0, ['sockaddr']],
    'ifru_slave': [0x0, ['array', 16, ['char']]],
    'ifru_netmask': [0x0, ['sockaddr']],
}],
  'VFIOMSIXInfo': [ 0x120, {
    'table_bar': [0x0, ['unsigned char']],
    'pba_bar': [0x1, ['unsigned char']],
    'entries': [0x2, ['unsigned short']],
    'table_offset': [0x4, ['unsigned int']],
    'pba_offset': [0x8, ['unsigned int']],
    'mmap_mem': [0x10, ['MemoryRegion']],
    'mmap': [0x110, ['pointer', ['void']]],
    'pending': [0x118, ['pointer', ['unsigned long']]],
}],
  'binary_function<const llvm::Function*, const llvm::Function*, bool': [ 0x1, {
}],
  'BIOSLinker': [ 0x10, {
    'cmd_blob': [0x0, ['pointer', ['_GArray']]],
    'file_list': [0x8, ['pointer', ['_GArray']]],
}],
  'AMDVIState': [ 0xd5d0, {
    'iommu': [0x0, ['X86IOMMUState']],
    'pci': [0x310, ['AMDVIPCIState']],
    'version': [0xc00, ['unsigned int']],
    'capab_offset': [0xc04, ['unsigned int']],
    'mmio_addr': [0xc08, ['unsigned long']],
    'devid': [0xc10, ['unsigned int']],
    'enabled': [0xc14, ['unsigned char']],
    'ats_enabled': [0xc15, ['unsigned char']],
    'cmdbuf_enabled': [0xc16, ['unsigned char']],
    'evtlog_enabled': [0xc17, ['unsigned char']],
    'excl_enabled': [0xc18, ['unsigned char']],
    'devtab': [0xc20, ['unsigned long']],
    'devtab_len': [0xc28, ['unsigned long']],
    'cmdbuf': [0xc30, ['unsigned long']],
    'cmdbuf_len': [0xc38, ['unsigned long']],
    'cmdbuf_head': [0xc40, ['unsigned int']],
    'cmdbuf_tail': [0xc44, ['unsigned int']],
    'completion_wait_intr': [0xc48, ['unsigned char']],
    'evtlog': [0xc50, ['unsigned long']],
    'evtlog_intr': [0xc58, ['unsigned char']],
    'evtlog_len': [0xc5c, ['unsigned int']],
    'evtlog_head': [0xc60, ['unsigned int']],
    'evtlog_tail': [0xc64, ['unsigned int']],
    'excl_base': [0xc68, ['unsigned long']],
    'excl_limit': [0xc70, ['unsigned long']],
    'excl_allow': [0xc78, ['unsigned char']],
    'excl_enable': [0xc79, ['unsigned char']],
    'ppr_log': [0xc80, ['unsigned long']],
    'pprlog_len': [0xc88, ['unsigned int']],
    'pprlog_head': [0xc8c, ['unsigned int']],
    'pprlog_tail': [0xc90, ['unsigned int']],
    'mmio': [0xca0, ['MemoryRegion']],
    'mmior': [0xda0, ['array', 16384, ['unsigned char']]],
    'w1cmask': [0x4da0, ['array', 16384, ['unsigned char']]],
    'romask': [0x8da0, ['array', 16384, ['unsigned char']]],
    'mmio_enabled': [0xcda0, ['unsigned char']],
    'iommu_ops': [0xcda8, ['MemoryRegionIOMMUOps']],
    'address_spaces': [0xcdc0, ['array', 256, ['pointer', ['pointer', ['AMDVIAddressSpace']]]]],
    'iotlb': [0xd5c0, ['pointer', ['_GHashTable']]],
}],
  '__unnamed_0x13b9': [ 0x596, {
    'tp_buf': [0x0, ['array', 1430, ['char']]],
    'tp_data': [0x0, ['__unnamed_0x1364']],
    'tp_error': [0x0, ['__unnamed_0x1397']],
}],
  '__unnamed_0x13b4': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['Slirp']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['Slirp']]]],
}],
  'q_obj_x_blockdev_remove_medium_arg': [ 0x20, {
    'has_device': [0x0, ['unsigned char']],
    'device': [0x8, ['pointer', ['char']]],
    'has_id': [0x10, ['unsigned char']],
    'id': [0x18, ['pointer', ['char']]],
}],
  'q_obj_screendump_arg': [ 0x8, {
    'filename': [0x0, ['pointer', ['char']]],
}],
  'cast_retty_impl<llvm::Function, llvm::Value*': [ 0x1, {
}],
  'VirtIOInputConfig': [ 0x98, {
    'config': [0x0, ['virtio_input_config']],
    'node': [0x88, ['__unnamed_0x8169']],
}],
  'QEMUGLParams': [ 0x8, {
    'major_ver': [0x0, ['int']],
    'minor_ver': [0x4, ['int']],
}],
  'VRingDesc': [ 0x10, {
    'addr': [0x0, ['unsigned long']],
    'len': [0x8, ['unsigned int']],
    'flags': [0xc, ['unsigned short']],
    'next': [0xe, ['unsigned short']],
}],
  'xenkbd_motion': [ 0x10, {
    'type': [0x0, ['unsigned char']],
    'rel_x': [0x4, ['int']],
    'rel_y': [0x8, ['int']],
    'rel_z': [0xc, ['int']],
}],
  'isa_impl_wrap<llvm::Instruction, llvm::Value* const, const llvm::Value*': [ 0x1, {
}],
  'FDCtrlCommand': [ 0x28, {
    'value': [0x0, ['unsigned char']],
    'mask': [0x1, ['unsigned char']],
    'name': [0x8, ['pointer', ['char']]],
    'parameters': [0x10, ['int']],
    'handler': [0x18, ['pointer', ['void']]],
    'direction': [0x20, ['int']],
}],
  'BlockStatsList': [ 0x10, {
    'next': [0x0, ['pointer', ['BlockStatsList']]],
    'value': [0x8, ['pointer', ['BlockStats']]],
}],
  'BlockdevCacheOptions': [ 0x4, {
    'has_direct': [0x0, ['unsigned char']],
    'direct': [0x1, ['unsigned char']],
    'has_no_flush': [0x2, ['unsigned char']],
    'no_flush': [0x3, ['unsigned char']],
}],
  '_Rb_tree_impl<std::less<const llvm::Function*': [ 0x30, {
    '_M_key_compare': [0x0, ['less<const llvm::Function*']],
    '_M_header': [0x8, ['_Rb_tree_node_base']],
    '_M_node_count': [0x28, ['unsigned long']],
}],
  'TCGTemp': [ 0x28, {
    'val_type': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 8}]],
    'base_type': [0x0, ['BitField', {'end_bit': 24, 'start_bit': 16}]],
    'type': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 24}]],
    'reg': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 0}]],
    'mem_coherent': [0x4, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'temp_allocated': [0x4, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'mem_allocated': [0x4, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'indirect_base': [0x4, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'indirect_reg': [0x4, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'temp_local': [0x4, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'fixed_reg': [0x4, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'val': [0x8, ['long']],
    'mem_base': [0x10, ['pointer', ['TCGTemp']]],
    'mem_offset': [0x18, ['long']],
    'name': [0x20, ['pointer', ['char']]],
}],
  'qemu_work_item': [ 0x20, {
    'next': [0x0, ['pointer', ['qemu_work_item']]],
    'func': [0x8, ['pointer', ['void']]],
    'data': [0x10, ['__unnamed_0x137d']],
    'free': [0x18, ['unsigned char']],
    'exclusive': [0x19, ['unsigned char']],
    'done': [0x1a, ['unsigned char']],
}],
  'kvm_coalesced_mmio_zone': [ 0x10, {
    'addr': [0x0, ['unsigned long long']],
    'size': [0x8, ['unsigned int']],
    'pad': [0xc, ['unsigned int']],
}],
  'virtio_net_ctrl_mq': [ 0x2, {
    'virtqueue_pairs': [0x0, ['unsigned short']],
}],
  'udpiphdr': [ 0x1c, {
    'ui_i': [0x0, ['ipovly']],
    'ui_u': [0x14, ['udphdr']],
}],
  'FWCfgMemState': [ 0x6f0, {
    'parent_obj': [0x0, ['FWCfgState']],
    'ctl_iomem': [0x460, ['MemoryRegion']],
    'data_iomem': [0x560, ['MemoryRegion']],
    'data_width': [0x660, ['unsigned int']],
    'wide_data_ops': [0x668, ['MemoryRegionOps']],
}],
  'MapEntry': [ 0x40, {
    'start': [0x0, ['long']],
    'length': [0x8, ['long']],
    'data': [0x10, ['unsigned char']],
    'zero': [0x11, ['unsigned char']],
    'depth': [0x18, ['long']],
    'has_offset': [0x20, ['unsigned char']],
    'offset': [0x28, ['long']],
    'has_filename': [0x30, ['unsigned char']],
    'filename': [0x38, ['pointer', ['char']]],
}],
  'isa_impl<llvm::ConstantInt, llvm::Constant, void': [ 0x1, {
}],
  'vm_change_state_head': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['vm_change_state_entry']]],
}],
  'AC97BusMasterRegs': [ 0x18, {
    'bdbar': [0x0, ['unsigned int']],
    'civ': [0x4, ['unsigned char']],
    'lvi': [0x5, ['unsigned char']],
    'sr': [0x6, ['unsigned short']],
    'picb': [0x8, ['unsigned short']],
    'piv': [0xa, ['unsigned char']],
    'cr': [0xb, ['unsigned char']],
    'bd_valid': [0xc, ['unsigned int']],
    'bd': [0x10, ['BD']],
}],
  '__unnamed_0x3e84': [ 0x1a0, {
    'fcw': [0x0, ['unsigned short']],
    'fsw': [0x2, ['unsigned short']],
    'ftw': [0x4, ['unsigned char']],
    'reserved': [0x5, ['unsigned char']],
    'fpop': [0x6, ['unsigned short']],
    'fpip': [0x8, ['unsigned long']],
    'fpdp': [0x10, ['unsigned long']],
    'mxcsr': [0x18, ['unsigned int']],
    'mxcsr_mask': [0x1c, ['unsigned int']],
    'fpregs': [0x20, ['array', 8, ['__unnamed_0x3e28']]],
    'xmm_regs': [0xa0, ['array', 16, ['array', 16, ['unsigned char']]]],
}],
  'PandaPluginInfo': [ 0x18, {
    'index': [0x0, ['long']],
    'name': [0x8, ['pointer', ['char']]],
    'address': [0x10, ['long']],
}],
  '_GSourceCallbackFuncs': [ 0x18, {
    'ref': [0x0, ['pointer', ['void']]],
    'unref': [0x8, ['pointer', ['void']]],
    'get': [0x10, ['pointer', ['void']]],
}],
  'VirtioBusState': [ 0x70, {
    'parent_obj': [0x0, ['BusState']],
    'ioeventfd_started': [0x68, ['unsigned char']],
    'ioeventfd_grabbed': [0x6c, ['int']],
}],
  'virtio_gpu_transfer_to_host_2d': [ 0x38, {
    'hdr': [0x0, ['virtio_gpu_ctrl_hdr']],
    'r': [0x18, ['virtio_gpu_rect']],
    'offset': [0x28, ['unsigned long']],
    'resource_id': [0x30, ['unsigned int']],
    'padding': [0x34, ['unsigned int']],
}],
  '__unnamed_0x2115': [ 0x18, {
    'min_access_size': [0x0, ['unsigned int']],
    'max_access_size': [0x4, ['unsigned int']],
    'unaligned': [0x8, ['unsigned char']],
    'accepts': [0x10, ['pointer', ['void']]],
}],
  '__unnamed_0x3807': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['virtio_gpu_ctrl_command']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['virtio_gpu_ctrl_command']]]],
}],
  'VhostUserLog': [ 0x10, {
    'mmap_size': [0x0, ['unsigned long']],
    'mmap_offset': [0x8, ['unsigned long']],
}],
  'virtio_gpu_config': [ 0x10, {
    'events_read': [0x0, ['unsigned int']],
    'events_clear': [0x4, ['unsigned int']],
    'num_scanouts': [0x8, ['unsigned int']],
    'num_capsets': [0xc, ['unsigned int']],
}],
  'virtio_input_event': [ 0x8, {
    'type': [0x0, ['unsigned short']],
    'code': [0x2, ['unsigned short']],
    'value': [0x4, ['unsigned int']],
}],
  'MTPState': [ 0x1708, {
    'dev': [0x0, ['USBDevice']],
    'root': [0x16a8, ['pointer', ['char']]],
    'desc': [0x16b0, ['pointer', ['char']]],
    'flags': [0x16b8, ['unsigned int']],
    'data_in': [0x16c0, ['pointer', ['MTPData']]],
    'data_out': [0x16c8, ['pointer', ['MTPData']]],
    'result': [0x16d0, ['pointer', ['MTPControl']]],
    'session': [0x16d8, ['unsigned int']],
    'next_handle': [0x16dc, ['unsigned int']],
    'objects': [0x16e0, ['__unnamed_0x3e00']],
    'inotifyfd': [0x16f0, ['int']],
    'events': [0x16f8, ['events']],
}],
  'new_allocator<std::_Rb_tree_node<std::pair<const std::__cxx11::basic_string<char, std::char_traits<char': [ 0x1, {
}],
  'QObjectOutputVisitor': [ 0xb8, {
    'visitor': [0x0, ['Visitor']],
    'stack': [0xa0, ['__unnamed_0xce0']],
    'root': [0xa8, ['pointer', ['QObject']]],
    'result': [0xb0, ['pointer', ['pointer', ['QObject']]]],
}],
  'RockerOfDpaFlowMask': [ 0x38, {
    'has_in_pport': [0x0, ['unsigned char']],
    'in_pport': [0x4, ['unsigned int']],
    'has_tunnel_id': [0x8, ['unsigned char']],
    'tunnel_id': [0xc, ['unsigned int']],
    'has_vlan_id': [0x10, ['unsigned char']],
    'vlan_id': [0x12, ['unsigned short']],
    'has_eth_src': [0x14, ['unsigned char']],
    'eth_src': [0x18, ['pointer', ['char']]],
    'has_eth_dst': [0x20, ['unsigned char']],
    'eth_dst': [0x28, ['pointer', ['char']]],
    'has_ip_proto': [0x30, ['unsigned char']],
    'ip_proto': [0x31, ['unsigned char']],
    'has_ip_tos': [0x32, ['unsigned char']],
    'ip_tos': [0x33, ['unsigned char']],
}],
  'PciBridgeInfo': [ 0x18, {
    'bus': [0x0, ['pointer', ['PciBusInfo']]],
    'has_devices': [0x8, ['unsigned char']],
    'devices': [0x10, ['pointer', ['PciDeviceInfoList']]],
}],
  '__unnamed_0x118d': [ 0x10, {
    'le_next': [0x0, ['pointer', ['NamedGPIOList']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['NamedGPIOList']]]],
}],
  'VHDXRegionTableHeader': [ 0x10, {
    'signature': [0x0, ['unsigned int']],
    'checksum': [0x4, ['unsigned int']],
    'entry_count': [0x8, ['unsigned int']],
    'reserved': [0xc, ['unsigned int']],
}],
  'virtio_gpu_resource_create_2d': [ 0x28, {
    'hdr': [0x0, ['virtio_gpu_ctrl_hdr']],
    'resource_id': [0x18, ['unsigned int']],
    'format': [0x1c, ['unsigned int']],
    'width': [0x20, ['unsigned int']],
    'height': [0x24, ['unsigned int']],
}],
  'virtio_net_hdr_mrg_rxbuf': [ 0xc, {
    'hdr': [0x0, ['virtio_net_hdr']],
    'num_buffers': [0xa, ['unsigned short']],
}],
  'I2CBus': [ 0x78, {
    'qbus': [0x0, ['BusState']],
    'current_devs': [0x68, ['__unnamed_0x156b']],
    'saved_address': [0x70, ['unsigned char']],
    'broadcast': [0x71, ['unsigned char']],
}],
  'BlockCryptoCreateData': [ 0x20, {
    'filename': [0x0, ['pointer', ['char']]],
    'opts': [0x8, ['pointer', ['QemuOpts']]],
    'blk': [0x10, ['pointer', ['BlockBackend']]],
    'size': [0x18, ['unsigned long']],
}],
  'q_obj_human_monitor_command_arg': [ 0x18, {
    'command_line': [0x0, ['pointer', ['char']]],
    'has_cpu_index': [0x8, ['unsigned char']],
    'cpu_index': [0x10, ['long']],
}],
  'virtio_scsi_cmd_req': [ 0x13, {
    'lun': [0x0, ['array', 8, ['unsigned char']]],
    'tag': [0x8, ['unsigned long']],
    'task_attr': [0x10, ['unsigned char']],
    'prio': [0x11, ['unsigned char']],
    'crn': [0x12, ['unsigned char']],
    'cdb': [0x13, ['array', 0, ['unsigned char']]],
}],
  '__unnamed_0xe13': [ 0x404, {
    'len': [0x0, ['int']],
    'buffer': [0x4, ['array', 1024, ['unsigned char']]],
}],
  '__unnamed_0x400e': [ 0x18, {
    '__unnamed_0x401c': [0x0, ['__unnamed_0x3fea']],
    '__unnamed_0x4017': [0x0, ['__unnamed_0x3fac']],
}],
  'ilist_nextprev_traits<llvm::Argument': [ 0x1, {
}],
  'sigval': [ 0x8, {
    'sival_int': [0x0, ['int']],
    'sival_ptr': [0x0, ['pointer', ['void']]],
}],
  'q_obj_blockdev_snapshot_delete_internal_sync_arg': [ 0x28, {
    'device': [0x0, ['pointer', ['char']]],
    'has_id': [0x8, ['unsigned char']],
    'id': [0x10, ['pointer', ['char']]],
    'has_name': [0x18, ['unsigned char']],
    'name': [0x20, ['pointer', ['char']]],
}],
  'GenericLoaderState': [ 0xa0, {
    'parent_obj': [0x0, ['DeviceState']],
    'cpu': [0x70, ['pointer', ['CPUState']]],
    'addr': [0x78, ['unsigned long']],
    'data': [0x80, ['unsigned long']],
    'data_len': [0x88, ['unsigned char']],
    'cpu_num': [0x8c, ['unsigned int']],
    'file': [0x90, ['pointer', ['char']]],
    'force_raw': [0x98, ['unsigned char']],
    'data_be': [0x99, ['unsigned char']],
    'set_pc': [0x9a, ['unsigned char']],
}],
  '__unnamed_0x3e28': [ 0x10, {
    'le_next': [0x0, ['pointer', ['BdrvChild']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['BdrvChild']]]],
}],
  'DUMMY_Q': [ 0x10, {
    'head': [0x0, ['DUMMY_Q_HEAD']],
}],
  'Qcow2Cache': [ 0x30, {
    'entries': [0x0, ['pointer', ['Qcow2CachedTable']]],
    'depends': [0x8, ['pointer', ['Qcow2Cache']]],
    'size': [0x10, ['int']],
    'depends_on_flush': [0x14, ['unsigned char']],
    'table_array': [0x18, ['pointer', ['void']]],
    'lru_counter': [0x20, ['unsigned long']],
    'cache_clean_lru_counter': [0x28, ['unsigned long']],
}],
  'TraceEventGroup': [ 0x8, {
    'events': [0x0, ['pointer', ['pointer', ['TraceEvent']]]],
}],
  'NetPacket': [ 0x28, {
    'entry': [0x0, ['__unnamed_0xe35']],
    'sender': [0x10, ['pointer', ['NetClientState']]],
    'flags': [0x18, ['unsigned int']],
    'size': [0x1c, ['int']],
    'sent_cb': [0x20, ['pointer', ['void']]],
    'data': [0x28, ['array', 0, ['unsigned char']]],
}],
  'HotpluggableCPUList': [ 0x10, {
    'next': [0x0, ['pointer', ['HotpluggableCPUList']]],
    'value': [0x8, ['pointer', ['HotpluggableCPU']]],
}],
  'blkif_x86_32_sring': [ 0xac, {
    'req_prod': [0x0, ['unsigned int']],
    'req_event': [0x4, ['unsigned int']],
    'rsp_prod': [0x8, ['unsigned int']],
    'rsp_event': [0xc, ['unsigned int']],
    'pvt': [0x10, ['__unnamed_0x489a']],
    '__pad': [0x14, ['array', 44, ['unsigned char']]],
    'ring': [0x40, ['array', 1, ['blkif_x86_32_sring_entry']]],
}],
  'QIOChannelBuffer': [ 0x58, {
    'parent': [0x0, ['QIOChannel']],
    'capacity': [0x38, ['unsigned long']],
    'usage': [0x40, ['unsigned long']],
    'offset': [0x48, ['unsigned long']],
    'data': [0x50, ['pointer', ['unsigned char']]],
}],
  'requested_infos': [ 0x10, {
    'client_id': [0x0, ['pointer', ['unsigned char']]],
    'client_id_len': [0x8, ['int']],
    'want_dns': [0xc, ['unsigned char']],
    'want_boot_url': [0xd, ['unsigned char']],
}],
  'MPIMsgSCSITaskMgmtReply': [ 0x18, {
    'TargetID': [0x0, ['unsigned char']],
    'Bus': [0x1, ['unsigned char']],
    'MsgLength': [0x2, ['unsigned char']],
    'Function': [0x3, ['unsigned char']],
    'ResponseCode': [0x4, ['unsigned char']],
    'TaskType': [0x5, ['unsigned char']],
    'Reserved1': [0x6, ['unsigned char']],
    'MsgFlags': [0x7, ['unsigned char']],
    'MsgContext': [0x8, ['unsigned int']],
    'Reserved2': [0xc, ['array', 2, ['unsigned char']]],
    'IOCStatus': [0xe, ['unsigned short']],
    'IOCLogInfo': [0x10, ['unsigned int']],
    'TerminationCount': [0x14, ['unsigned int']],
}],
  '__unnamed_0xf0d': [ 0x10, {
    'le_next': [0x0, ['pointer', ['HWVoiceOut']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['HWVoiceOut']]]],
}],
  'of_dpa_group': [ 0x20, {
    'id': [0x0, ['unsigned int']],
    '__unnamed_0x1ae8': [0x8, ['__unnamed_0x1a9c']],
}],
  'BlockConf': [ 0x38, {
    'blk': [0x0, ['pointer', ['BlockBackend']]],
    'physical_block_size': [0x8, ['unsigned short']],
    'logical_block_size': [0xa, ['unsigned short']],
    'min_io_size': [0xc, ['unsigned short']],
    'opt_io_size': [0x10, ['unsigned int']],
    'bootindex': [0x14, ['int']],
    'discard_granularity': [0x18, ['unsigned int']],
    'cyls': [0x1c, ['unsigned int']],
    'heads': [0x20, ['unsigned int']],
    'secs': [0x24, ['unsigned int']],
    'wce': [0x28, ['Enumeration', {'target': 'int', 'choices': {0: 'ON_OFF_AUTO_AUTO', 1: 'ON_OFF_AUTO_ON', 2: 'ON_OFF_AUTO_OFF', 3: 'ON_OFF_AUTO__MAX'}}]],
    'rerror': [0x2c, ['Enumeration', {'target': 'int', 'choices': {0: 'BLOCKDEV_ON_ERROR_REPORT', 1: 'BLOCKDEV_ON_ERROR_IGNORE', 2: 'BLOCKDEV_ON_ERROR_ENOSPC', 3: 'BLOCKDEV_ON_ERROR_STOP', 4: 'BLOCKDEV_ON_ERROR_AUTO', 5: 'BLOCKDEV_ON_ERROR__MAX'}}]],
    'werror': [0x30, ['Enumeration', {'target': 'int', 'choices': {0: 'BLOCKDEV_ON_ERROR_REPORT', 1: 'BLOCKDEV_ON_ERROR_IGNORE', 2: 'BLOCKDEV_ON_ERROR_ENOSPC', 3: 'BLOCKDEV_ON_ERROR_STOP', 4: 'BLOCKDEV_ON_ERROR_AUTO', 5: 'BLOCKDEV_ON_ERROR__MAX'}}]],
}],
  'CaptureState': [ 0x28, {
    'opaque': [0x0, ['pointer', ['void']]],
    'ops': [0x8, ['capture_ops']],
    'entries': [0x18, ['__unnamed_0x957']],
}],
  'USBHostIsoRing': [ 0x50, {
    'host': [0x0, ['pointer', ['USBHostDevice']]],
    'ep': [0x8, ['pointer', ['USBEndpoint']]],
    'unused': [0x10, ['__unnamed_0x3efb']],
    'inflight': [0x20, ['Enumeration', {'target': 'int', 'choices': {0: 'RR_OFF', 1: 'RR_RECORD', 2: 'RR_REPLAY'}}]],
    'copy': [0x30, ['__unnamed_0x3f3d']],
    'next': [0x40, ['__unnamed_0x3f5e']],
}],
  'pair<unsigned int, llvm::PointerAlignElem': [ 0x14, {
    'first': [0x0, ['unsigned int']],
    'second': [0x4, ['PointerAlignElem']],
}],
  'mfi_info_device': [ 0x48, {
    'type': [0x0, ['unsigned char']],
    'reserved': [0x1, ['array', 6, ['unsigned char']]],
    'port_count': [0x7, ['unsigned char']],
    'port_addr': [0x8, ['array', 8, ['unsigned long']]],
}],
  'VmdkMetaData': [ 0x18, {
    'l1_index': [0x0, ['unsigned int']],
    'l2_index': [0x4, ['unsigned int']],
    'l2_offset': [0x8, ['unsigned int']],
    'valid': [0xc, ['int']],
    'l2_cache_entry': [0x10, ['pointer', ['unsigned int']]],
}],
  'q_obj_ChardevFile_wrapper': [ 0x8, {
    'data': [0x0, ['pointer', ['ChardevFile']]],
}],
  'HIDPointerEvent': [ 0x10, {
    'xdx': [0x0, ['int']],
    'ydy': [0x4, ['int']],
    'dz': [0x8, ['int']],
    'buttons_state': [0xc, ['int']],
}],
  '__unnamed_0x3a35': [ 0x8, {
    'dir': [0x0, ['__unnamed_0x3a11']],
    'file': [0x0, ['__unnamed_0x39fa']],
}],
  '_XkbRedirectKeyAction': [ 0x8, {
    'type': [0x0, ['unsigned char']],
    'new_key': [0x1, ['unsigned char']],
    'mods_mask': [0x2, ['unsigned char']],
    'mods': [0x3, ['unsigned char']],
    'vmods_mask0': [0x4, ['unsigned char']],
    'vmods_mask1': [0x5, ['unsigned char']],
    'vmods0': [0x6, ['unsigned char']],
    'vmods1': [0x7, ['unsigned char']],
}],
  'syminfo': [ 0x28, {
    'lookup_symbol': [0x0, ['pointer', ['void']]],
    'disas_num_syms': [0x8, ['unsigned int']],
    'disas_symtab': [0x10, ['__unnamed_0x230e']],
    'disas_strtab': [0x18, ['pointer', ['char']]],
    'next': [0x20, ['pointer', ['syminfo']]],
}],
  'CpuInfoMIPS': [ 0x8, {
    'PC': [0x0, ['long']],
}],
  'MegasasBaseClass': [ 0x128, {
    'parent_class': [0x0, ['PCIDeviceClass']],
    'product_name': [0x108, ['pointer', ['char']]],
    'product_version': [0x110, ['pointer', ['char']]],
    'mmio_bar': [0x118, ['int']],
    'ioport_bar': [0x11c, ['int']],
    'osts': [0x120, ['int']],
}],
  'SCSIBlockReq': [ 0x268, {
    'req': [0x0, ['SCSIDiskReq']],
    'io_header': [0x1f8, ['sg_io_hdr']],
    'cmd': [0x250, ['unsigned char']],
    'cdb1': [0x251, ['unsigned char']],
    'group_number': [0x252, ['unsigned char']],
    'cdb': [0x253, ['array', 16, ['unsigned char']]],
}],
  'png_row_info_struct': [ 0x18, {
    'width': [0x0, ['unsigned long']],
    'rowbytes': [0x8, ['unsigned long']],
    'color_type': [0x10, ['unsigned char']],
    'bit_depth': [0x11, ['unsigned char']],
    'channels': [0x12, ['unsigned char']],
    'pixel_depth': [0x13, ['unsigned char']],
}],
  'IPMIInterfaceClass': [ 0xb8, {
    'parent': [0x0, ['InterfaceClass']],
    'init': [0x70, ['pointer', ['void']]],
    'do_hw_op': [0x78, ['pointer', ['void']]],
    'set_irq_enable': [0x80, ['pointer', ['void']]],
    'handle_if_event': [0x88, ['pointer', ['void']]],
    'set_atn': [0x90, ['pointer', ['void']]],
    'reset': [0x98, ['pointer', ['void']]],
    'handle_rsp': [0xa0, ['pointer', ['void']]],
    'get_backend_data': [0xa8, ['pointer', ['void']]],
    'get_fwinfo': [0xb0, ['pointer', ['void']]],
}],
  '__unnamed_0xaeaa': [ 0x8, {
    'abs': [0x0, ['q_obj_InputMoveEvent_wrapper']],
    'btn': [0x0, ['q_obj_InputBtnEvent_wrapper']],
    'rel': [0x0, ['q_obj_InputMoveEvent_wrapper']],
    'key': [0x0, ['q_obj_InputKeyEvent_wrapper']],
}],
  'md5_ctx': [ 0x60, {
    'state': [0x0, ['array', 4, ['unsigned int']]],
    'count': [0x10, ['unsigned long']],
    'block': [0x18, ['array', 64, ['unsigned char']]],
    'index': [0x58, ['unsigned int']],
}],
  'SchemaInfo': [ 0x38, {
    'name': [0x0, ['pointer', ['char']]],
    'meta_type': [0x8, ['Enumeration', {'target': 'int', 'choices': {0: 'SCHEMA_META_TYPE_BUILTIN', 1: 'SCHEMA_META_TYPE_ENUM', 2: 'SCHEMA_META_TYPE_ARRAY', 3: 'SCHEMA_META_TYPE_OBJECT', 4: 'SCHEMA_META_TYPE_ALTERNATE', 5: 'SCHEMA_META_TYPE_COMMAND', 6: 'SCHEMA_META_TYPE_EVENT', 7: 'SCHEMA_META_TYPE__MAX'}}]],
    'u': [0x10, ['__unnamed_0xb263']],
}],
  'NvdimmDsmFuncNoPayloadOut': [ 0x8, {
    'len': [0x0, ['unsigned int']],
    'func_ret_status': [0x4, ['unsigned int']],
}],
  'QmpCommand': [ 0x30, {
    'name': [0x0, ['pointer', ['char']]],
    'fn': [0x8, ['pointer', ['void']]],
    'options': [0x10, ['Enumeration', {'target': 'int', 'choices': {0: 'QCO_NO_OPTIONS', 1: 'QCO_NO_SUCCESS_RESP'}}]],
    'node': [0x18, ['__unnamed_0x847']],
    'enabled': [0x28, ['unsigned char']],
}],
  'SDL_Cursor': [ 0x38, {
    'area': [0x0, ['SDL_Rect']],
    'hot_x': [0x8, ['short']],
    'hot_y': [0xa, ['short']],
    'data': [0x10, ['pointer', ['unsigned char']]],
    'mask': [0x18, ['pointer', ['unsigned char']]],
    'save': [0x20, ['array', 2, ['pointer', ['unsigned char']]]],
    'wm_cursor': [0x30, ['pointer', ['WMcursor']]],
}],
  'AlignedCharArray<4ul, 4ul': [ 0x4, {
    'buffer': [0x0, ['array', 4, ['char']]],
}],
  'CharBackend': [ 0x30, {
    'chr': [0x0, ['pointer', ['Chardev']]],
    'chr_event': [0x8, ['pointer', ['void']]],
    'chr_can_read': [0x10, ['pointer', ['void']]],
    'chr_read': [0x18, ['pointer', ['void']]],
    'opaque': [0x20, ['pointer', ['void']]],
    'tag': [0x28, ['int']],
    'fe_open': [0x2c, ['int']],
}],
  '__unnamed_0x561': [ 0x100, {
    'gregs': [0x0, ['array', 23, ['long long']]],
    'fpregs': [0xb8, ['pointer', ['_libc_fpstate']]],
    '__reserved1': [0xc0, ['array', 8, ['unsigned long long']]],
}],
  'q_obj_NetdevVhostUserOptions_wrapper': [ 0x8, {
    'data': [0x0, ['pointer', ['NetdevVhostUserOptions']]],
}],
  'kvm_msr_list': [ 0x4, {
    'nmsrs': [0x0, ['unsigned int']],
    'indices': [0x4, ['array', 0, ['unsigned int']]],
}],
  'OSSConf': [ 0x28, {
    'try_mmap': [0x0, ['int']],
    'nfrags': [0x4, ['int']],
    'fragsize': [0x8, ['int']],
    'devpath_out': [0x10, ['pointer', ['char']]],
    'devpath_in': [0x18, ['pointer', ['char']]],
    'exclusive': [0x20, ['int']],
    'policy': [0x24, ['int']],
}],
  'USBDescIface': [ 0x18, {
    'bInterfaceNumber': [0x0, ['unsigned char']],
    'bAlternateSetting': [0x1, ['unsigned char']],
    'bNumEndpoints': [0x2, ['unsigned char']],
    'bInterfaceClass': [0x3, ['unsigned char']],
    'bInterfaceSubClass': [0x4, ['unsigned char']],
    'bInterfaceProtocol': [0x5, ['unsigned char']],
    'iInterface': [0x6, ['unsigned char']],
    'ndesc': [0x7, ['unsigned char']],
    'descs': [0x8, ['pointer', ['USBDescOther']]],
    'eps': [0x10, ['pointer', ['USBDescEndpoint']]],
}],
  'IPackDevice': [ 0x80, {
    'parent_obj': [0x0, ['DeviceState']],
    'slot': [0x70, ['int']],
    'irq': [0x78, ['pointer', ['pointer', ['IRQState']]]],
}],
  'QXLRect': [ 0x10, {
    'top': [0x0, ['int']],
    'left': [0x4, ['int']],
    'bottom': [0x8, ['int']],
    'right': [0xc, ['int']],
}],
  'QString': [ 0x28, {
    'base': [0x0, ['QObject']],
    'string': [0x10, ['pointer', ['char']]],
    'length': [0x18, ['unsigned long']],
    'capacity': [0x20, ['unsigned long']],
}],
  '__unnamed_0x30ab': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['ChannelList']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['ChannelList']]]],
}],
  'TPMPassthruThreadParams': [ 0x18, {
    'tpm_state': [0x0, ['pointer', ['TPMState']]],
    'recv_data_callback': [0x8, ['pointer', ['void']]],
    'tb': [0x10, ['pointer', ['TPMBackend']]],
}],
  'CPUHotplugFeatures': [ 0x2, {
    'apci_1_compatible': [0x0, ['unsigned char']],
    'has_legacy_cphp': [0x1, ['unsigned char']],
}],
  'QXLModes': [ 0x4, {
    'n_modes': [0x0, ['unsigned int']],
    'modes': [0x4, ['array', 0, ['QXLMode']]],
}],
  'kvm_x86_mce': [ 0x40, {
    'status': [0x0, ['unsigned long long']],
    'addr': [0x8, ['unsigned long long']],
    'misc': [0x10, ['unsigned long long']],
    'mcg_status': [0x18, ['unsigned long long']],
    'bank': [0x20, ['unsigned char']],
    'pad1': [0x21, ['array', 7, ['unsigned char']]],
    'pad2': [0x28, ['array', 3, ['unsigned long long']]],
}],
  'IPMISdr': [ 0x4014, {
    'sdr': [0x0, ['array', 16384, ['unsigned char']]],
    'next_free': [0x4000, ['unsigned int']],
    'next_rec_id': [0x4004, ['unsigned short']],
    'reservation': [0x4006, ['unsigned short']],
    'last_addition': [0x4008, ['array', 4, ['unsigned char']]],
    'last_clear': [0x400c, ['array', 4, ['unsigned char']]],
    'overflow': [0x4010, ['unsigned char']],
}],
  'ehci_companions': [ 0x10, {
    'name': [0x0, ['pointer', ['char']]],
    'func': [0x8, ['int']],
    'port': [0xc, ['int']],
}],
  'IPMIBmc': [ 0x80, {
    'parent': [0x0, ['DeviceState']],
    'slave_addr': [0x70, ['unsigned char']],
    'intf': [0x78, ['pointer', ['IPMIInterface']]],
}],
  'q_obj_load_plugin_arg': [ 0x28, {
    'has_file_name': [0x0, ['unsigned char']],
    'file_name': [0x8, ['pointer', ['char']]],
    'plugin_name': [0x10, ['pointer', ['char']]],
    'has_plugin_args': [0x18, ['unsigned char']],
    'plugin_args': [0x20, ['pointer', ['char']]],
}],
  'MonitorQAPIEventState': [ 0x20, {
    'event': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'QAPI_EVENT_ACPI_DEVICE_OST', 1: 'QAPI_EVENT_BALLOON_CHANGE', 2: 'QAPI_EVENT_BLOCK_IMAGE_CORRUPTED', 3: 'QAPI_EVENT_BLOCK_IO_ERROR', 4: 'QAPI_EVENT_BLOCK_JOB_CANCELLED', 5: 'QAPI_EVENT_BLOCK_JOB_COMPLETED', 6: 'QAPI_EVENT_BLOCK_JOB_ERROR', 7: 'QAPI_EVENT_BLOCK_JOB_READY', 8: 'QAPI_EVENT_BLOCK_WRITE_THRESHOLD', 9: 'QAPI_EVENT_DEVICE_DELETED', 10: 'QAPI_EVENT_DEVICE_TRAY_MOVED', 11: 'QAPI_EVENT_DUMP_COMPLETED', 12: 'QAPI_EVENT_GUEST_PANICKED', 13: 'QAPI_EVENT_MEM_UNPLUG_ERROR', 14: 'QAPI_EVENT_MIGRATION', 15: 'QAPI_EVENT_MIGRATION_PASS', 16: 'QAPI_EVENT_NIC_RX_FILTER_CHANGED', 17: 'QAPI_EVENT_POWERDOWN', 18: 'QAPI_EVENT_QUORUM_FAILURE', 19: 'QAPI_EVENT_QUORUM_REPORT_BAD', 20: 'QAPI_EVENT_RESET', 21: 'QAPI_EVENT_RESUME', 22: 'QAPI_EVENT_RTC_CHANGE', 23: 'QAPI_EVENT_SHUTDOWN', 24: 'QAPI_EVENT_SPICE_CONNECTED', 25: 'QAPI_EVENT_SPICE_DISCONNECTED', 26: 'QAPI_EVENT_SPICE_INITIALIZED', 27: 'QAPI_EVENT_SPICE_MIGRATE_COMPLETED', 28: 'QAPI_EVENT_STOP', 29: 'QAPI_EVENT_SUSPEND', 30: 'QAPI_EVENT_SUSPEND_DISK', 31: 'QAPI_EVENT_VNC_CONNECTED', 32: 'QAPI_EVENT_VNC_DISCONNECTED', 33: 'QAPI_EVENT_VNC_INITIALIZED', 34: 'QAPI_EVENT_VSERPORT_CHANGE', 35: 'QAPI_EVENT_WAKEUP', 36: 'QAPI_EVENT_WATCHDOG', 37: 'QAPI_EVENT__MAX'}}]],
    'data': [0x8, ['pointer', ['QDict']]],
    'timer': [0x10, ['pointer', ['QEMUTimer']]],
    'qdict': [0x18, ['pointer', ['QDict']]],
}],
  'InterfaceImpl': [ 0x8, {
    'typename': [0x0, ['pointer', ['char']]],
}],
  'VirtIORNGConf': [ 0x20, {
    'rng': [0x0, ['pointer', ['RngBackend']]],
    'max_bytes': [0x8, ['unsigned long']],
    'period_ms': [0x10, ['unsigned int']],
    'default_backend': [0x18, ['pointer', ['RngRandom']]],
}],
  'VirtIOInputClass': [ 0x170, {
    'parent': [0x0, ['VirtioDeviceClass']],
    'realize': [0x150, ['pointer', ['void']]],
    'unrealize': [0x158, ['pointer', ['void']]],
    'change_active': [0x160, ['pointer', ['void']]],
    'handle_status': [0x168, ['pointer', ['void']]],
}],
  'cast_retty<llvm::Function, const llvm::Use': [ 0x1, {
}],
  'ProtobufCBuffer': [ 0x8, {
    'append': [0x0, ['pointer', ['void']]],
}],
  'vhd_dyndisk_header': [ 0x300, {
    'magic': [0x0, ['array', 8, ['char']]],
    'data_offset': [0x8, ['unsigned long']],
    'table_offset': [0x10, ['unsigned long']],
    'version': [0x18, ['unsigned int']],
    'max_table_entries': [0x1c, ['unsigned int']],
    'block_size': [0x20, ['unsigned int']],
    'checksum': [0x24, ['unsigned int']],
    'parent_uuid': [0x28, ['array', 16, ['unsigned char']]],
    'parent_timestamp': [0x38, ['unsigned int']],
    'reserved': [0x3c, ['unsigned int']],
    'parent_name': [0x40, ['array', 512, ['unsigned char']]],
    'parent_locator': [0x240, ['array', 8, ['__unnamed_0x34da']]],
}],
  'remove_reference<const std::piecewise_construct_t&': [ 0x1, {
}],
  '__unnamed_0x2430': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['NamedGPIOList']]],
}],
  'allocator_traits<std::allocator<llvm::Value*': [ 0x1, {
}],
  'IntelHDAReg': [ 0x38, {
    'name': [0x0, ['pointer', ['char']]],
    'size': [0x8, ['unsigned int']],
    'reset': [0xc, ['unsigned int']],
    'wmask': [0x10, ['unsigned int']],
    'wclear': [0x14, ['unsigned int']],
    'offset': [0x18, ['unsigned int']],
    'shift': [0x1c, ['unsigned int']],
    'stream': [0x20, ['unsigned int']],
    'whandler': [0x28, ['pointer', ['void']]],
    'rhandler': [0x30, ['pointer', ['void']]],
}],
  'pcnet_TMD': [ 0x10, {
    'tbadr': [0x0, ['unsigned int']],
    'length': [0x4, ['short']],
    'status': [0x6, ['short']],
    'misc': [0x8, ['unsigned int']],
    'res': [0xc, ['unsigned int']],
}],
  'RewriterState': [ 0x60, {
    'parent_obj': [0x0, ['NetFilterState']],
    'incoming_queue': [0x50, ['pointer', ['NetQueue']]],
    'connection_track_table': [0x58, ['pointer', ['_GHashTable']]],
}],
  'MonitorDef': [ 0x20, {
    'name': [0x0, ['pointer', ['char']]],
    'offset': [0x8, ['int']],
    'get_value': [0x10, ['pointer', ['void']]],
    'type': [0x18, ['int']],
}],
  'ilist_default_traits<llvm::Function': [ 0x1, {
}],
  'SDBus': [ 0x68, {
    'qbus': [0x0, ['BusState']],
}],
  'shared_vmport_iopage': [ 0x14, {
    'vcpu_vmport_regs': [0x0, ['array', 1, ['vmware_regs']]],
}],
  'rocker': [ 0xd60, {
    'parent_obj': [0x0, ['PCIDevice']],
    'mmio': [0x8f0, ['MemoryRegion']],
    'msix_bar': [0x9f0, ['MemoryRegion']],
    'name': [0xaf0, ['pointer', ['char']]],
    'world_name': [0xaf8, ['pointer', ['char']]],
    'fp_ports': [0xb00, ['unsigned int']],
    'fp_ports_peers': [0xb08, ['pointer', ['NICPeers']]],
    'fp_start_macaddr': [0xb10, ['MACAddr']],
    'switch_id': [0xb18, ['unsigned long']],
    'fp_port': [0xb20, ['array', 62, ['pointer', ['fp_port']]]],
    'test_reg': [0xd10, ['unsigned int']],
    'test_reg64': [0xd18, ['unsigned long']],
    'test_dma_addr': [0xd20, ['unsigned long']],
    'test_dma_size': [0xd28, ['unsigned int']],
    'lower32': [0xd30, ['unsigned long']],
    'rings': [0xd38, ['pointer', ['pointer', ['desc_ring']]]],
    'worlds': [0xd40, ['array', 1, ['pointer', ['world']]]],
    'world_dflt': [0xd48, ['pointer', ['world']]],
    'next': [0xd50, ['__unnamed_0x335c']],
}],
  '__alloc_traits<std::allocator<const llvm::PassInfo*': [ 0x1, {
}],
  'StatusInfo': [ 0x8, {
    'running': [0x0, ['unsigned char']],
    'singlestep': [0x1, ['unsigned char']],
    'status': [0x4, ['Enumeration', {'target': 'int', 'choices': {0: 'RUN_STATE_DEBUG', 1: 'RUN_STATE_INMIGRATE', 2: 'RUN_STATE_INTERNAL_ERROR', 3: 'RUN_STATE_IO_ERROR', 4: 'RUN_STATE_PAUSED', 5: 'RUN_STATE_POSTMIGRATE', 6: 'RUN_STATE_PRELAUNCH', 7: 'RUN_STATE_FINISH_MIGRATE', 8: 'RUN_STATE_RESTORE_VM', 9: 'RUN_STATE_RUNNING', 10: 'RUN_STATE_SAVE_VM', 11: 'RUN_STATE_SHUTDOWN', 12: 'RUN_STATE_SUSPENDED', 13: 'RUN_STATE_WATCHDOG', 14: 'RUN_STATE_GUEST_PANICKED', 15: 'RUN_STATE_COLO', 16: 'RUN_STATE__MAX'}}]],
}],
  'NotifierList': [ 0x8, {
    'notifiers': [0x0, ['__unnamed_0x737']],
}],
  'FsContext': [ 0x30, {
    'uid': [0x0, ['unsigned int']],
    'fs_root': [0x8, ['pointer', ['char']]],
    'export_flags': [0x10, ['int']],
    'xops': [0x18, ['pointer', ['pointer', ['xattr_operations']]]],
    'exops': [0x20, ['extended_ops']],
    'private': [0x28, ['pointer', ['void']]],
}],
  'USBPortOps': [ 0x28, {
    'attach': [0x0, ['pointer', ['void']]],
    'detach': [0x8, ['pointer', ['void']]],
    'child_detach': [0x10, ['pointer', ['void']]],
    'wakeup': [0x18, ['pointer', ['void']]],
    'complete': [0x20, ['pointer', ['void']]],
}],
  '__unnamed_0x3f5e': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['USBHostIsoRing']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['USBHostIsoRing']]]],
}],
  'CryptoDevBackend': [ 0x268, {
    'parent_obj': [0x0, ['Object']],
    'ready': [0x28, ['unsigned char']],
    'is_used': [0x29, ['unsigned char']],
    'conf': [0x30, ['CryptoDevBackendConf']],
}],
  'PageSearchStatus': [ 0x18, {
    'block': [0x0, ['pointer', ['RAMBlock']]],
    'offset': [0x8, ['unsigned long']],
    'complete_round': [0x10, ['unsigned char']],
}],
  'FWPathProvider': [ 0x28, {
    'parent_obj': [0x0, ['Object']],
}],
  'nbd_opt_reply': [ 0x14, {
    'magic': [0x0, ['unsigned long']],
    'option': [0x8, ['unsigned int']],
    'type': [0xc, ['unsigned int']],
    'length': [0x10, ['unsigned int']],
}],
  'UHCIPCIDeviceClass': [ 0x128, {
    'parent_class': [0x0, ['PCIDeviceClass']],
    'info': [0x108, ['UHCIInfo']],
}],
  'QEMUAudioTimeStamp': [ 0x8, {
    'old_ts': [0x0, ['unsigned long']],
}],
  '__unnamed_0x145a': [ 0x1e, {
    'linklayer_addr': [0x0, ['array', 6, ['unsigned char']]],
    'prefixinfo': [0x0, ['prefixinfo']],
    'rdnss': [0x0, ['rdnss']],
}],
  'buf_ioreq': [ 0x8, {
    'addr': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 12}]],
    'type': [0x0, ['unsigned char']],
    'pad': [0x1, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'dir': [0x1, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'size': [0x1, ['BitField', {'end_bit': 4, 'start_bit': 2}]],
    'data': [0x4, ['unsigned int']],
}],
  '_Vector_base<llvm::Value*, std::allocator<llvm::Value*': [ 0x18, {
    '_M_impl': [0x0, ['_Vector_impl']],
}],
  'simplify_type<llvm::Type*': [ 0x1, {
}],
  'uint16List': [ 0x10, {
    'next': [0x0, ['pointer', ['uint16List']]],
    'value': [0x8, ['unsigned short']],
}],
  'q_obj_qom_list_types_arg': [ 0x18, {
    'has_implements': [0x0, ['unsigned char']],
    'implements': [0x8, ['pointer', ['char']]],
    'has_abstract': [0x10, ['unsigned char']],
    'abstract': [0x11, ['unsigned char']],
}],
  '__unnamed_0xc4d': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['BlockBackendPublic']]],
}],
  'E1000E_RSSInfo_st': [ 0x10, {
    'enabled': [0x0, ['unsigned char']],
    'hash': [0x4, ['unsigned int']],
    'queue': [0x8, ['unsigned int']],
    'type': [0xc, ['unsigned int']],
}],
  'serpent_ctx': [ 0x210, {
    'keys': [0x0, ['array', 4, ['array', 33, ['unsigned int']]]],
}],
  'q_obj_xen_set_global_dirty_log_arg': [ 0x1, {
    'enable': [0x0, ['unsigned char']],
}],
  'VncPaletteEntry': [ 0x18, {
    'idx': [0x0, ['int']],
    'color': [0x4, ['unsigned int']],
    'next': [0x8, ['__unnamed_0x1911']],
}],
  'pcap_sf_pkthdr': [ 0x10, {
    'ts': [0x0, ['__unnamed_0x1d8f']],
    'caplen': [0x8, ['unsigned int']],
    'len': [0xc, ['unsigned int']],
}],
  'xattr_operations': [ 0x28, {
    'name': [0x0, ['pointer', ['char']]],
    'getxattr': [0x8, ['pointer', ['void']]],
    'listxattr': [0x10, ['pointer', ['void']]],
    'setxattr': [0x18, ['pointer', ['void']]],
    'removexattr': [0x20, ['pointer', ['void']]],
}],
  'kvm_irq_routing_irqchip': [ 0x8, {
    'irqchip': [0x0, ['unsigned int']],
    'pin': [0x4, ['unsigned int']],
}],
  'AMDVIIOTLBEntry': [ 0x20, {
    'domid': [0x0, ['unsigned short']],
    'devid': [0x2, ['unsigned short']],
    'perms': [0x8, ['unsigned long']],
    'translated_addr': [0x10, ['unsigned long']],
    'page_mask': [0x18, ['unsigned long']],
}],
  'SDState': [ 0x380, {
    'parent_obj': [0x0, ['DeviceState']],
    'mode': [0x70, ['unsigned int']],
    'state': [0x74, ['int']],
    'ocr': [0x78, ['unsigned int']],
    'ocr_power_timer': [0x80, ['pointer', ['QEMUTimer']]],
    'scr': [0x88, ['array', 8, ['unsigned char']]],
    'cid': [0x90, ['array', 16, ['unsigned char']]],
    'csd': [0xa0, ['array', 16, ['unsigned char']]],
    'rca': [0xb0, ['unsigned short']],
    'card_status': [0xb4, ['unsigned int']],
    'sd_status': [0xb8, ['array', 64, ['unsigned char']]],
    'vhs': [0xf8, ['unsigned int']],
    'wp_switch': [0xfc, ['unsigned char']],
    'wp_groups': [0x100, ['pointer', ['unsigned long']]],
    'wpgrps_size': [0x108, ['int']],
    'size': [0x110, ['unsigned long']],
    'blk_len': [0x118, ['unsigned int']],
    'multi_blk_cnt': [0x11c, ['unsigned int']],
    'erase_start': [0x120, ['unsigned int']],
    'erase_end': [0x124, ['unsigned int']],
    'pwd': [0x128, ['array', 16, ['unsigned char']]],
    'pwd_len': [0x138, ['unsigned int']],
    'function_group': [0x13c, ['array', 6, ['unsigned char']]],
    'spi': [0x142, ['unsigned char']],
    'current_cmd': [0x143, ['unsigned char']],
    'expecting_acmd': [0x144, ['unsigned char']],
    'blk_written': [0x148, ['unsigned int']],
    'data_start': [0x150, ['unsigned long']],
    'data_offset': [0x158, ['unsigned int']],
    'data': [0x15c, ['array', 512, ['unsigned char']]],
    'readonly_cb': [0x360, ['pointer', ['IRQState']]],
    'inserted_cb': [0x368, ['pointer', ['IRQState']]],
    'blk': [0x370, ['pointer', ['BlockBackend']]],
    'enable': [0x378, ['unsigned char']],
}],
  'VncBasicInfoList': [ 0x10, {
    'next': [0x0, ['pointer', ['VncBasicInfoList']]],
    'value': [0x8, ['pointer', ['VncBasicInfo']]],
}],
  'IOAPICCommonClass': [ 0xf0, {
    'parent_class': [0x0, ['SysBusDeviceClass']],
    'realize': [0xd8, ['pointer', ['void']]],
    'pre_save': [0xe0, ['pointer', ['void']]],
    'post_load': [0xe8, ['pointer', ['void']]],
}],
  'SCSIRequest': [ 0x198, {
    'bus': [0x0, ['pointer', ['SCSIBus']]],
    'dev': [0x8, ['pointer', ['SCSIDevice']]],
    'ops': [0x10, ['pointer', ['SCSIReqOps']]],
    'refcount': [0x18, ['unsigned int']],
    'tag': [0x1c, ['unsigned int']],
    'lun': [0x20, ['unsigned int']],
    'status': [0x24, ['unsigned int']],
    'hba_private': [0x28, ['pointer', ['void']]],
    'resid': [0x30, ['unsigned long']],
    'cmd': [0x38, ['SCSICommand']],
    'cancel_notifiers': [0x68, ['NotifierList']],
    'sense': [0x70, ['array', 252, ['unsigned char']]],
    'sense_len': [0x16c, ['unsigned int']],
    'enqueued': [0x170, ['unsigned char']],
    'io_canceled': [0x171, ['unsigned char']],
    'retry': [0x172, ['unsigned char']],
    'dma_started': [0x173, ['unsigned char']],
    'aiocb': [0x178, ['pointer', ['BlockAIOCB']]],
    'sg': [0x180, ['pointer', ['QEMUSGList']]],
    'next': [0x188, ['__unnamed_0x7a82']],
}],
  '__unnamed_0x21e6': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['MemoryListener']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['MemoryListener']]]],
}],
  'QmpCommandList': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['QmpCommand']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['QmpCommand']]]],
}],
  'QemuSpin': [ 0x4, {
    'value': [0x0, ['int']],
}],
  'mfi_stp_frame': [ 0x48, {
    'header': [0x0, ['mfi_frame_header']],
    'fis': [0x18, ['array', 10, ['unsigned short']]],
    'stp_flags': [0x2c, ['unsigned int']],
    'sgl': [0x30, ['__unnamed_0x6987']],
}],
  'mfi_ctrl_info': [ 0x800, {
    'pci': [0x0, ['mfi_info_pci']],
    'host': [0x20, ['mfi_info_host']],
    'device': [0x68, ['mfi_info_device']],
    'image_check_word': [0xb0, ['unsigned int']],
    'image_component_count': [0xb4, ['unsigned int']],
    'image_component': [0xb8, ['array', 8, ['mfi_info_component']]],
    'pending_image_component_count': [0x2f8, ['unsigned int']],
    'pending_image_component': [0x2fc, ['array', 8, ['mfi_info_component']]],
    'max_arms': [0x53c, ['unsigned char']],
    'max_spans': [0x53d, ['unsigned char']],
    'max_arrays': [0x53e, ['unsigned char']],
    'max_lds': [0x53f, ['unsigned char']],
    'product_name': [0x540, ['array', 80, ['char']]],
    'serial_number': [0x590, ['array', 32, ['char']]],
    'hw_present': [0x5b0, ['unsigned int']],
    'current_fw_time': [0x5b4, ['unsigned int']],
    'max_cmds': [0x5b8, ['unsigned short']],
    'max_sg_elements': [0x5ba, ['unsigned short']],
    'max_request_size': [0x5bc, ['unsigned int']],
    'lds_present': [0x5c0, ['unsigned short']],
    'lds_degraded': [0x5c2, ['unsigned short']],
    'lds_offline': [0x5c4, ['unsigned short']],
    'pd_present': [0x5c6, ['unsigned short']],
    'pd_disks_present': [0x5c8, ['unsigned short']],
    'pd_disks_pred_failure': [0x5ca, ['unsigned short']],
    'pd_disks_failed': [0x5cc, ['unsigned short']],
    'nvram_size': [0x5ce, ['unsigned short']],
    'memory_size': [0x5d0, ['unsigned short']],
    'flash_size': [0x5d2, ['unsigned short']],
    'ram_correctable_errors': [0x5d4, ['unsigned short']],
    'ram_uncorrectable_errors': [0x5d6, ['unsigned short']],
    'cluster_allowed': [0x5d8, ['unsigned char']],
    'cluster_active': [0x5d9, ['unsigned char']],
    'max_strips_per_io': [0x5da, ['unsigned short']],
    'raid_levels': [0x5dc, ['unsigned int']],
    'adapter_ops': [0x5e0, ['unsigned int']],
    'ld_ops': [0x5e4, ['unsigned int']],
    'stripe_sz_ops': [0x5e8, ['__unnamed_0x7088']],
    'pd_ops': [0x5ec, ['unsigned int']],
    'pd_mix_support': [0x5f0, ['unsigned int']],
    'ecc_bucket_count': [0x5f4, ['unsigned char']],
    'reserved2': [0x5f5, ['array', 11, ['unsigned char']]],
    'properties': [0x600, ['mfi_ctrl_props']],
    'package_version': [0x640, ['array', 96, ['char']]],
    'pad': [0x6a0, ['array', 352, ['unsigned char']]],
}],
  'QCryptoBlockOptionsLUKS': [ 0x10, {
    'has_key_secret': [0x0, ['unsigned char']],
    'key_secret': [0x8, ['pointer', ['char']]],
}],
  'DeviceState': [ 0x70, {
    'parent_obj': [0x0, ['Object']],
    'id': [0x28, ['pointer', ['char']]],
    'realized': [0x30, ['unsigned char']],
    'pending_deleted_event': [0x31, ['unsigned char']],
    'opts': [0x38, ['pointer', ['QemuOpts']]],
    'hotplugged': [0x40, ['int']],
    'parent_bus': [0x48, ['pointer', ['BusState']]],
    'gpios': [0x50, ['__unnamed_0x11c0']],
    'child_bus': [0x58, ['__unnamed_0x11d5']],
    'num_child_bus': [0x60, ['int']],
    'instance_id_alias': [0x64, ['int']],
    'alias_required_for_version': [0x68, ['int']],
}],
  'XenHostPCIIORegion': [ 0x18, {
    'base_addr': [0x0, ['unsigned long']],
    'size': [0x8, ['unsigned long']],
    'type': [0x10, ['unsigned char']],
    'bus_flags': [0x11, ['unsigned char']],
}],
  'vhost_vring_state': [ 0x8, {
    'index': [0x0, ['unsigned int']],
    'num': [0x4, ['unsigned int']],
}],
  'scsi_sense': [ 0xc, {
    'error_type': [0x0, ['unsigned char']],
    'key': [0x4, ['Enumeration', {'target': 'int', 'choices': {0: 'SCSI_SENSE_NO_SENSE', 1: 'SCSI_SENSE_RECOVERED_ERROR', 2: 'SCSI_SENSE_NOT_READY', 3: 'SCSI_SENSE_MEDIUM_ERROR', 4: 'SCSI_SENSE_HARDWARE_ERROR', 5: 'SCSI_SENSE_ILLEGAL_REQUEST', 6: 'SCSI_SENSE_UNIT_ATTENTION', 7: 'SCSI_SENSE_DATA_PROTECTION', 8: 'SCSI_SENSE_BLANK_CHECK', 9: 'SCSI_SENSE_VENDOR_SPECIFIC', 10: 'SCSI_SENSE_COPY_ABORTED', 11: 'SCSI_SENSE_COMMAND_ABORTED', 12: 'SCSI_SENSE_OBSOLETE_ERROR_CODE', 13: 'SCSI_SENSE_OVERFLOW_COMMAND', 14: 'SCSI_SENSE_MISCOMPARE'}}]],
    'ascq': [0x8, ['int']],
}],
  'IDEDrive': [ 0xd8, {
    'dev': [0x0, ['IDEDevice']],
}],
  'PciDeviceId': [ 0x10, {
    'device': [0x0, ['long']],
    'vendor': [0x8, ['long']],
}],
  'virtio_crypto_aead_session_para': [ 0x18, {
    'algo': [0x0, ['unsigned int']],
    'key_len': [0x4, ['unsigned int']],
    'hash_result_len': [0x8, ['unsigned int']],
    'aad_len': [0xc, ['unsigned int']],
    'op': [0x10, ['unsigned int']],
    'padding': [0x14, ['unsigned int']],
}],
  '__unnamed_0x430a': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['MPTSASRequest']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['MPTSASRequest']]]],
}],
  'AlignedCharArray<4ul, 8ul': [ 0x8, {
    'buffer': [0x0, ['array', 8, ['char']]],
}],
  'IDEDevice': [ 0xd8, {
    'qdev': [0x0, ['DeviceState']],
    'unit': [0x70, ['unsigned int']],
    'conf': [0x78, ['BlockConf']],
    'chs_trans': [0xb0, ['int']],
    'version': [0xb8, ['pointer', ['char']]],
    'serial': [0xc0, ['pointer', ['char']]],
    'model': [0xc8, ['pointer', ['char']]],
    'wwn': [0xd0, ['unsigned long']],
}],
  '_Panda__SrcInfo': [ 0x38, {
    'base': [0x0, ['ProtobufCMessage']],
    'filename': [0x18, ['unsigned int']],
    'linenum': [0x1c, ['unsigned int']],
    'astnodename': [0x20, ['unsigned int']],
    'has_insertionpoint': [0x24, ['int']],
    'insertionpoint': [0x28, ['unsigned int']],
    'has_ast_loc_id': [0x2c, ['int']],
    'ast_loc_id': [0x30, ['unsigned int']],
}],
  '__va_list_tag': [ 0x18, {
    'gp_offset': [0x0, ['unsigned int']],
    'fp_offset': [0x4, ['unsigned int']],
    'overflow_arg_area': [0x8, ['pointer', ['void']]],
    'reg_save_area': [0x10, ['pointer', ['void']]],
}],
  '__unnamed_0x34b1': [ 0x108, {
    'log': [0x0, ['VhostUserLog']],
    'state': [0x0, ['vhost_vring_state']],
    'u64': [0x0, ['unsigned long']],
    'addr': [0x0, ['vhost_vring_addr']],
    'memory': [0x0, ['VhostUserMemory']],
}],
  'CompatEntry': [ 0x104, {
    'idstr': [0x0, ['array', 256, ['char']]],
    'instance_id': [0x100, ['int']],
}],
  'io_iocb_vector': [ 0x18, {
    'vec': [0x0, ['pointer', ['iovec']]],
    'nr': [0x8, ['int']],
    'offset': [0x10, ['long long']],
}],
  'PCIERootPortClass': [ 0x130, {
    'parent_class': [0x0, ['PCIDeviceClass']],
    'aer_vector': [0x108, ['pointer', ['void']]],
    'interrupts_init': [0x110, ['pointer', ['void']]],
    'interrupts_uninit': [0x118, ['pointer', ['void']]],
    'exp_offset': [0x120, ['int']],
    'aer_offset': [0x124, ['int']],
    'ssvid_offset': [0x128, ['int']],
    'ssid': [0x12c, ['int']],
}],
  '__unnamed_0x9e2e': [ 0x10, {
    'guest_cid': [0x0, ['unsigned long']],
    'vhostfd': [0x8, ['pointer', ['char']]],
}],
  'new_allocator<std::pair<const std::__cxx11::basic_string<char, std::char_traits<char': [ 0x1, {
}],
  'VhostUserMemory': [ 0x108, {
    'nregions': [0x0, ['unsigned int']],
    'padding': [0x4, ['unsigned int']],
    'regions': [0x8, ['array', 8, ['VhostUserMemoryRegion']]],
}],
  'SWVoiceIn': [ 0xa0, {
    'card': [0x0, ['pointer', ['QEMUSoundCard']]],
    'active': [0x8, ['int']],
    'info': [0xc, ['audio_pcm_info']],
    'ratio': [0x30, ['long']],
    'rate': [0x38, ['pointer', ['void']]],
    'total_hw_samples_acquired': [0x40, ['int']],
    'buf': [0x48, ['pointer', ['st_sample']]],
    'clip': [0x50, ['pointer', ['void']]],
    'hw': [0x58, ['pointer', ['HWVoiceIn']]],
    'name': [0x60, ['pointer', ['char']]],
    'vol': [0x68, ['mixeng_volume']],
    'callback': [0x80, ['audio_callback']],
    'entries': [0x90, ['Enumeration', {'target': 'int', 'choices': {0: 'QEMU_CLOCK_REALTIME', 1: 'QEMU_CLOCK_VIRTUAL', 2: 'QEMU_CLOCK_HOST', 3: 'QEMU_CLOCK_VIRTUAL_RT', 4: 'QEMU_CLOCK_MAX'}}]],
}],
  'q_obj_BLOCK_IMAGE_CORRUPTED_arg': [ 0x48, {
    'device': [0x0, ['pointer', ['char']]],
    'has_node_name': [0x8, ['unsigned char']],
    'node_name': [0x10, ['pointer', ['char']]],
    'msg': [0x18, ['pointer', ['char']]],
    'has_offset': [0x20, ['unsigned char']],
    'offset': [0x28, ['long']],
    'has_size': [0x30, ['unsigned char']],
    'size': [0x38, ['long']],
    'fatal': [0x40, ['unsigned char']],
}],
  '__unnamed_0x11c0': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['NamedGPIOList']]],
}],
  'MemoryDeviceInfoList': [ 0x10, {
    'next': [0x0, ['pointer', ['MemoryDeviceInfoList']]],
    'value': [0x8, ['pointer', ['MemoryDeviceInfo']]],
}],
  'new_allocator<std::__cxx11::basic_string<char, std::char_traits<char': [ 0x1, {
}],
  '__unnamed_0x229f': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['BusState']]],
}],
  'VHDXVirtualDiskPhysicalSectorSize': [ 0x4, {
    'physical_sector_size': [0x0, ['unsigned int']],
}],
  'Chardev': [ 0x90, {
    'parent_obj': [0x0, ['Object']],
    'chr_write_lock': [0x28, ['QemuMutex']],
    'be': [0x50, ['pointer', ['CharBackend']]],
    'label': [0x58, ['pointer', ['char']]],
    'filename': [0x60, ['pointer', ['char']]],
    'logfd': [0x68, ['int']],
    'be_open': [0x6c, ['int']],
    'fd_in_tag': [0x70, ['unsigned int']],
    'features': [0x78, ['array', 1, ['unsigned long']]],
    'next': [0x80, ['__unnamed_0x1be5']],
}],
  '__unnamed_0x1d23': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['NamedGPIOList']]],
}],
  '__unnamed_0x205c': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['AddressSpace']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['AddressSpace']]]],
}],
  'BlkActionState': [ 0x28, {
    'action': [0x0, ['pointer', ['TransactionAction']]],
    'ops': [0x8, ['pointer', ['BlkActionOps']]],
    'block_job_txn': [0x10, ['pointer', ['BlockJobTxn']]],
    'txn_props': [0x18, ['pointer', ['TransactionProperties']]],
    'entry': [0x20, ['__unnamed_0x6729']],
}],
  'NetdevUserOptions': [ 0x110, {
    'has_hostname': [0x0, ['unsigned char']],
    'hostname': [0x8, ['pointer', ['char']]],
    'has_q_restrict': [0x10, ['unsigned char']],
    'q_restrict': [0x11, ['unsigned char']],
    'has_ipv4': [0x12, ['unsigned char']],
    'ipv4': [0x13, ['unsigned char']],
    'has_ipv6': [0x14, ['unsigned char']],
    'ipv6': [0x15, ['unsigned char']],
    'has_ip': [0x16, ['unsigned char']],
    'ip': [0x18, ['pointer', ['char']]],
    'has_net': [0x20, ['unsigned char']],
    'net': [0x28, ['pointer', ['char']]],
    'has_host': [0x30, ['unsigned char']],
    'host': [0x38, ['pointer', ['char']]],
    'has_tftp': [0x40, ['unsigned char']],
    'tftp': [0x48, ['pointer', ['char']]],
    'has_bootfile': [0x50, ['unsigned char']],
    'bootfile': [0x58, ['pointer', ['char']]],
    'has_dhcpstart': [0x60, ['unsigned char']],
    'dhcpstart': [0x68, ['pointer', ['char']]],
    'has_dns': [0x70, ['unsigned char']],
    'dns': [0x78, ['pointer', ['char']]],
    'has_dnssearch': [0x80, ['unsigned char']],
    'dnssearch': [0x88, ['pointer', ['StringList']]],
    'has_ipv6_prefix': [0x90, ['unsigned char']],
    'ipv6_prefix': [0x98, ['pointer', ['char']]],
    'has_ipv6_prefixlen': [0xa0, ['unsigned char']],
    'ipv6_prefixlen': [0xa8, ['long']],
    'has_ipv6_host': [0xb0, ['unsigned char']],
    'ipv6_host': [0xb8, ['pointer', ['char']]],
    'has_ipv6_dns': [0xc0, ['unsigned char']],
    'ipv6_dns': [0xc8, ['pointer', ['char']]],
    'has_smb': [0xd0, ['unsigned char']],
    'smb': [0xd8, ['pointer', ['char']]],
    'has_smbserver': [0xe0, ['unsigned char']],
    'smbserver': [0xe8, ['pointer', ['char']]],
    'has_hostfwd': [0xf0, ['unsigned char']],
    'hostfwd': [0xf8, ['pointer', ['StringList']]],
    'has_guestfwd': [0x100, ['unsigned char']],
    'guestfwd': [0x108, ['pointer', ['StringList']]],
}],
  'scsi_mode_page_power_condition': [ 0x38, {
    'pm_bg_precedence': [0x0, ['int']],
    'standby_y': [0x4, ['int']],
    'idle_c': [0x8, ['int']],
    'idle_b': [0xc, ['int']],
    'idle_a': [0x10, ['int']],
    'standby_z': [0x14, ['int']],
    'idle_a_condition_timer': [0x18, ['unsigned int']],
    'standby_z_condition_timer': [0x1c, ['unsigned int']],
    'idle_b_condition_timer': [0x20, ['unsigned int']],
    'idle_c_condition_timer': [0x24, ['unsigned int']],
    'standby_y_condition_timer': [0x28, ['unsigned int']],
    'ccf_idle': [0x2c, ['int']],
    'ccf_standby': [0x30, ['int']],
    'ccf_stopped': [0x34, ['int']],
}],
  '__uses_alloc_base': [ 0x1, {
}],
  'q_obj_ChardevSocket_wrapper': [ 0x8, {
    'data': [0x0, ['pointer', ['ChardevSocket']]],
}],
  'BlockdevRefList': [ 0x10, {
    'next': [0x0, ['pointer', ['BlockdevRefList']]],
    'value': [0x8, ['pointer', ['BlockdevRef']]],
}],
  'BlockdevOptionsQcow2': [ 0x70, {
    'file': [0x0, ['pointer', ['BlockdevRef']]],
    'has_backing': [0x8, ['unsigned char']],
    'backing': [0x10, ['pointer', ['BlockdevRef']]],
    'has_lazy_refcounts': [0x18, ['unsigned char']],
    'lazy_refcounts': [0x19, ['unsigned char']],
    'has_pass_discard_request': [0x1a, ['unsigned char']],
    'pass_discard_request': [0x1b, ['unsigned char']],
    'has_pass_discard_snapshot': [0x1c, ['unsigned char']],
    'pass_discard_snapshot': [0x1d, ['unsigned char']],
    'has_pass_discard_other': [0x1e, ['unsigned char']],
    'pass_discard_other': [0x1f, ['unsigned char']],
    'has_overlap_check': [0x20, ['unsigned char']],
    'overlap_check': [0x28, ['pointer', ['Qcow2OverlapChecks']]],
    'has_cache_size': [0x30, ['unsigned char']],
    'cache_size': [0x38, ['long']],
    'has_l2_cache_size': [0x40, ['unsigned char']],
    'l2_cache_size': [0x48, ['long']],
    'has_refcount_cache_size': [0x50, ['unsigned char']],
    'refcount_cache_size': [0x58, ['long']],
    'has_cache_clean_interval': [0x60, ['unsigned char']],
    'cache_clean_interval': [0x68, ['long']],
}],
  'CaptureVoiceOut': [ 0xa8, {
    'hw': [0x0, ['HWVoiceOut']],
    'buf': [0x88, ['pointer', ['void']]],
    'cb_head': [0x90, ['cb_listhead']],
    'entries': [0x98, ['__unnamed_0x142b']],
}],
  '__unnamed_0x3108': [ 0x12, {
    'rld': [0x0, ['unsigned short']],
    'din': [0x2, ['unsigned char']],
    'dout': [0x3, ['unsigned char']],
    'sts1': [0x4, ['unsigned short']],
    'sts2': [0x6, ['unsigned short']],
    'cnt1': [0x8, ['unsigned short']],
    'cnt2': [0xa, ['unsigned short']],
    'msg1': [0xc, ['unsigned char']],
    'msg2': [0xd, ['unsigned char']],
    'wdcnt': [0xe, ['unsigned char']],
    'tmr': [0x10, ['unsigned short']],
}],
  'Vmxnet3_RxCompDesc': [ 0x10, {
    'sop': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 15}]],
    'ext2': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 31}]],
    'ext1': [0x0, ['BitField', {'end_bit': 14, 'start_bit': 12}]],
    'eop': [0x0, ['BitField', {'end_bit': 15, 'start_bit': 14}]],
    'rqID': [0x0, ['BitField', {'end_bit': 26, 'start_bit': 16}]],
    'cnc': [0x0, ['BitField', {'end_bit': 31, 'start_bit': 30}]],
    'rxdIdx': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 0}]],
    'rssType': [0x0, ['BitField', {'end_bit': 30, 'start_bit': 26}]],
    'rssHash': [0x4, ['unsigned int']],
    'tci': [0x8, ['BitField', {'end_bit': 32, 'start_bit': 16}]],
    'ts': [0x8, ['BitField', {'end_bit': 16, 'start_bit': 15}]],
    'len': [0x8, ['BitField', {'end_bit': 14, 'start_bit': 0}]],
    'err': [0x8, ['BitField', {'end_bit': 15, 'start_bit': 14}]],
    'ipc': [0xc, ['BitField', {'end_bit': 20, 'start_bit': 19}]],
    'tcp': [0xc, ['BitField', {'end_bit': 19, 'start_bit': 18}]],
    'csum': [0xc, ['BitField', {'end_bit': 16, 'start_bit': 0}]],
    'frg': [0xc, ['BitField', {'end_bit': 23, 'start_bit': 22}]],
    'type': [0xc, ['BitField', {'end_bit': 31, 'start_bit': 24}]],
    'udp': [0xc, ['BitField', {'end_bit': 18, 'start_bit': 17}]],
    'fcs': [0xc, ['BitField', {'end_bit': 24, 'start_bit': 23}]],
    'v4': [0xc, ['BitField', {'end_bit': 22, 'start_bit': 21}]],
    'v6': [0xc, ['BitField', {'end_bit': 21, 'start_bit': 20}]],
    'tuc': [0xc, ['BitField', {'end_bit': 17, 'start_bit': 16}]],
    'gen': [0xc, ['BitField', {'end_bit': 32, 'start_bit': 31}]],
}],
  'msos_prop_data': [ 0x4, {
    'dwPropertyDataLength': [0x0, ['unsigned int']],
    'bPropertyData': [0x4, ['array', 0, ['unsigned char']]],
}],
  'NetdevTapOptions': [ 0xb0, {
    'has_ifname': [0x0, ['unsigned char']],
    'ifname': [0x8, ['pointer', ['char']]],
    'has_fd': [0x10, ['unsigned char']],
    'fd': [0x18, ['pointer', ['char']]],
    'has_fds': [0x20, ['unsigned char']],
    'fds': [0x28, ['pointer', ['char']]],
    'has_script': [0x30, ['unsigned char']],
    'script': [0x38, ['pointer', ['char']]],
    'has_downscript': [0x40, ['unsigned char']],
    'downscript': [0x48, ['pointer', ['char']]],
    'has_br': [0x50, ['unsigned char']],
    'br': [0x58, ['pointer', ['char']]],
    'has_helper': [0x60, ['unsigned char']],
    'helper': [0x68, ['pointer', ['char']]],
    'has_sndbuf': [0x70, ['unsigned char']],
    'sndbuf': [0x78, ['unsigned long']],
    'has_vnet_hdr': [0x80, ['unsigned char']],
    'vnet_hdr': [0x81, ['unsigned char']],
    'has_vhost': [0x82, ['unsigned char']],
    'vhost': [0x83, ['unsigned char']],
    'has_vhostfd': [0x84, ['unsigned char']],
    'vhostfd': [0x88, ['pointer', ['char']]],
    'has_vhostfds': [0x90, ['unsigned char']],
    'vhostfds': [0x98, ['pointer', ['char']]],
    'has_vhostforce': [0xa0, ['unsigned char']],
    'vhostforce': [0xa1, ['unsigned char']],
    'has_queues': [0xa2, ['unsigned char']],
    'queues': [0xa4, ['unsigned int']],
    'has_poll_us': [0xa8, ['unsigned char']],
    'poll_us': [0xac, ['unsigned int']],
}],
  'rate': [ 0x28, {
    'opos': [0x0, ['unsigned long']],
    'opos_inc': [0x8, ['unsigned long']],
    'ipos': [0x10, ['unsigned int']],
    'ilast': [0x18, ['st_sample']],
}],
  '__unnamed_0x358c': [ 0x44, {
    '__unnamed_0x35a1': [0x0, ['__unnamed_0x34fd']],
    'opreg': [0x0, ['array', 17, ['unsigned int']]],
}],
  '_Panda__TaintQuery': [ 0x30, {
    'base': [0x0, ['ProtobufCMessage']],
    'ptr': [0x18, ['unsigned long']],
    'tcn': [0x20, ['unsigned int']],
    'offset': [0x24, ['unsigned int']],
    'unique_label_set': [0x28, ['pointer', ['_Panda__TaintQueryUniqueLabelSet']]],
}],
  'x86_longdouble': [ 0x8, {
    'mant': [0x0, ['unsigned long']],
    'exp': [0x0, ['unsigned short']],
}],
  'q_obj_VNC_INITIALIZED_arg': [ 0x10, {
    'server': [0x0, ['pointer', ['VncServerInfo']]],
    'client': [0x8, ['pointer', ['VncClientInfo']]],
}],
  'USBDescString': [ 0x20, {
    'index': [0x0, ['unsigned char']],
    'str': [0x8, ['pointer', ['char']]],
    'next': [0x10, ['__unnamed_0x1183']],
}],
  '__unnamed_0x2c3c': [ 0xc, {
    'min_access_size': [0x0, ['unsigned int']],
    'max_access_size': [0x4, ['unsigned int']],
    'unaligned': [0x8, ['unsigned char']],
}],
  'ip_pseudo_header': [ 0xc, {
    'ip_src': [0x0, ['unsigned int']],
    'ip_dst': [0x4, ['unsigned int']],
    'zeros': [0x8, ['unsigned char']],
    'ip_proto': [0x9, ['unsigned char']],
    'ip_payload': [0xa, ['unsigned short']],
}],
  'ReplicationOps': [ 0x20, {
    'start': [0x0, ['pointer', ['void']]],
    'stop': [0x8, ['pointer', ['void']]],
    'checkpoint': [0x10, ['pointer', ['void']]],
    'get_error': [0x18, ['pointer', ['void']]],
}],
  'HMPMigrationStatus': [ 0x18, {
    'timer': [0x0, ['pointer', ['QEMUTimer']]],
    'mon': [0x8, ['pointer', ['Monitor']]],
    'is_block_migration': [0x10, ['unsigned char']],
}],
  '_GList': [ 0x18, {
    'data': [0x0, ['pointer', ['void']]],
    'next': [0x8, ['pointer', ['_GList']]],
    'prev': [0x10, ['pointer', ['_GList']]],
}],
  'rebind<llvm::SourceMgr::SrcBuffer': [ 0x1, {
}],
  '_Select1st<std::pair<const std::pair<long int, llvm::Type*': [ 0x1, {
}],
  'SDL_Rect': [ 0x8, {
    'x': [0x0, ['short']],
    'y': [0x2, ['short']],
    'w': [0x4, ['unsigned short']],
    'h': [0x6, ['unsigned short']],
}],
  'iovec': [ 0x10, {
    'iov_base': [0x0, ['pointer', ['void']]],
    'iov_len': [0x8, ['unsigned long']],
}],
  '__unnamed_0x379': [ 0x10, {
    '__u6_addr16': [0x0, ['array', 8, ['unsigned short']]],
    '__u6_addr32': [0x0, ['array', 4, ['unsigned int']]],
    '__u6_addr8': [0x0, ['array', 16, ['unsigned char']]],
}],
  'SchemaInfoAlternateMember': [ 0x8, {
    'type': [0x0, ['pointer', ['char']]],
}],
  '_XkbControls': [ 0x54, {
    'mk_dflt_btn': [0x0, ['unsigned char']],
    'num_groups': [0x1, ['unsigned char']],
    'groups_wrap': [0x2, ['unsigned char']],
    'internal': [0x4, ['_XkbMods']],
    'ignore_lock': [0x8, ['_XkbMods']],
    'enabled_ctrls': [0xc, ['unsigned int']],
    'repeat_delay': [0x10, ['unsigned short']],
    'repeat_interval': [0x12, ['unsigned short']],
    'slow_keys_delay': [0x14, ['unsigned short']],
    'debounce_delay': [0x16, ['unsigned short']],
    'mk_delay': [0x18, ['unsigned short']],
    'mk_interval': [0x1a, ['unsigned short']],
    'mk_time_to_max': [0x1c, ['unsigned short']],
    'mk_max_speed': [0x1e, ['unsigned short']],
    'mk_curve': [0x20, ['short']],
    'ax_options': [0x22, ['unsigned short']],
    'ax_timeout': [0x24, ['unsigned short']],
    'axt_opts_mask': [0x26, ['unsigned short']],
    'axt_opts_values': [0x28, ['unsigned short']],
    'axt_ctrls_mask': [0x2c, ['unsigned int']],
    'axt_ctrls_values': [0x30, ['unsigned int']],
    'per_key_repeat': [0x34, ['array', 32, ['unsigned char']]],
}],
  '__unnamed_0x3367': [ 0x10, {
    'le_next': [0x0, ['pointer', ['QuorumVoteItem']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['QuorumVoteItem']]]],
}],
  'KvmInfo': [ 0x2, {
    'enabled': [0x0, ['unsigned char']],
    'present': [0x1, ['unsigned char']],
}],
  '__unnamed_0x3361': [ 0x10, {
    'le_next': [0x0, ['pointer', ['BlkdebugSuspendedReq']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['BlkdebugSuspendedReq']]]],
}],
  'BlockDirtyInfo': [ 0x20, {
    'has_name': [0x0, ['unsigned char']],
    'name': [0x8, ['pointer', ['char']]],
    'count': [0x10, ['long']],
    'granularity': [0x18, ['unsigned int']],
    'status': [0x1c, ['Enumeration', {'target': 'int', 'choices': {0: 'DIRTY_BITMAP_STATUS_ACTIVE', 1: 'DIRTY_BITMAP_STATUS_DISABLED', 2: 'DIRTY_BITMAP_STATUS_FROZEN', 3: 'DIRTY_BITMAP_STATUS__MAX'}}]],
}],
  'SaveStateEntry': [ 0x148, {
    'entry': [0x0, ['__unnamed_0x48c7']],
    'idstr': [0x10, ['array', 256, ['char']]],
    'instance_id': [0x110, ['int']],
    'alias_id': [0x114, ['int']],
    'version_id': [0x118, ['int']],
    'section_id': [0x11c, ['int']],
    'ops': [0x120, ['pointer', ['SaveVMHandlers']]],
    'vmsd': [0x128, ['pointer', ['VMStateDescription']]],
    'opaque': [0x130, ['pointer', ['void']]],
    'compat': [0x138, ['pointer', ['CompatEntry']]],
    'is_ram': [0x140, ['int']],
}],
  'SB16State': [ 0x3d0, {
    'parent_obj': [0x0, ['ISADevice']],
    'card': [0x80, ['QEMUSoundCard']],
    'pic': [0x98, ['pointer', ['IRQState']]],
    'irq': [0xa0, ['unsigned int']],
    'dma': [0xa4, ['unsigned int']],
    'hdma': [0xa8, ['unsigned int']],
    'port': [0xac, ['unsigned int']],
    'ver': [0xb0, ['unsigned int']],
    'isa_dma': [0xb8, ['pointer', ['IsaDma']]],
    'isa_hdma': [0xc0, ['pointer', ['IsaDma']]],
    'in_index': [0xc8, ['int']],
    'out_data_len': [0xcc, ['int']],
    'fmt_stereo': [0xd0, ['int']],
    'fmt_signed': [0xd4, ['int']],
    'fmt_bits': [0xd8, ['int']],
    'fmt': [0xdc, ['Enumeration', {'target': 'int', 'choices': {0: 'AUD_FMT_U8', 1: 'AUD_FMT_S8', 2: 'AUD_FMT_U16', 3: 'AUD_FMT_S16', 4: 'AUD_FMT_U32', 5: 'AUD_FMT_S32'}}]],
    'dma_auto': [0xe0, ['int']],
    'block_size': [0xe4, ['int']],
    'fifo': [0xe8, ['int']],
    'freq': [0xec, ['int']],
    'time_const': [0xf0, ['int']],
    'speaker': [0xf4, ['int']],
    'needed_bytes': [0xf8, ['int']],
    'cmd': [0xfc, ['int']],
    'use_hdma': [0x100, ['int']],
    'highspeed': [0x104, ['int']],
    'can_write': [0x108, ['int']],
    'v2x6': [0x10c, ['int']],
    'csp_param': [0x110, ['unsigned char']],
    'csp_value': [0x111, ['unsigned char']],
    'csp_mode': [0x112, ['unsigned char']],
    'csp_regs': [0x113, ['array', 256, ['unsigned char']]],
    'csp_index': [0x213, ['unsigned char']],
    'csp_reg83': [0x214, ['array', 4, ['unsigned char']]],
    'csp_reg83r': [0x218, ['int']],
    'csp_reg83w': [0x21c, ['int']],
    'in2_data': [0x220, ['array', 10, ['unsigned char']]],
    'out_data': [0x22a, ['array', 50, ['unsigned char']]],
    'test_reg': [0x25c, ['unsigned char']],
    'last_read_byte': [0x25d, ['unsigned char']],
    'nzero': [0x260, ['int']],
    'left_till_irq': [0x264, ['int']],
    'dma_running': [0x268, ['int']],
    'bytes_per_second': [0x26c, ['int']],
    'align': [0x270, ['int']],
    'audio_free': [0x274, ['int']],
    'voice': [0x278, ['pointer', ['SWVoiceOut']]],
    'aux_ts': [0x280, ['pointer', ['QEMUTimer']]],
    'mixer_nreg': [0x288, ['int']],
    'mixer_regs': [0x28c, ['array', 256, ['unsigned char']]],
    'portio_list': [0x390, ['PortioList']],
}],
  'PITClass': [ 0xe8, {
    'parent_class': [0x0, ['PITCommonClass']],
    'parent_realize': [0xe0, ['pointer', ['void']]],
}],
  'sw_in_listhead': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['SWVoiceIn']]],
}],
  'kvm_create_device': [ 0xc, {
    'type': [0x0, ['unsigned int']],
    'fd': [0x4, ['unsigned int']],
    'flags': [0x8, ['unsigned int']],
}],
  'ilist_node_traits<llvm::NamedMDNode': [ 0x1, {
}],
  'virtio_console_config': [ 0xc, {
    'cols': [0x0, ['unsigned short']],
    'rows': [0x2, ['unsigned short']],
    'max_nr_ports': [0x4, ['unsigned int']],
    'emerg_wr': [0x8, ['unsigned int']],
}],
  'sizeList': [ 0x10, {
    'next': [0x0, ['pointer', ['sizeList']]],
    'value': [0x8, ['unsigned long']],
}],
  'remove_reference<std::__cxx11::basic_string<char, std::char_traits<char': [ 0x1, {
}],
  'q_obj_cpu_arg': [ 0x8, {
    'index': [0x0, ['long']],
}],
  '__unnamed_0x726f': [ 0x10, {
    'le_next': [0x0, ['pointer', ['VirtIOSerial']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['VirtIOSerial']]]],
}],
  '__unnamed_0x2f23': [ 0x10, {
    'le_next': [0x0, ['pointer', ['BdrvAioNotifier']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['BdrvAioNotifier']]]],
}],
  'MultiReqBuffer': [ 0x108, {
    'reqs': [0x0, ['array', 32, ['pointer', ['VirtIOBlockReq']]]],
    'num_reqs': [0x100, ['unsigned int']],
    'is_write': [0x104, ['unsigned char']],
}],
  'input_iterator_tag': [ 0x1, {
}],
  'VirtIOGPU': [ 0x930, {
    'parent_obj': [0x0, ['VirtIODevice']],
    'ctrl_bh': [0xe8, ['pointer', ['QEMUBH']]],
    'cursor_bh': [0xf0, ['pointer', ['QEMUBH']]],
    'ctrl_vq': [0xf8, ['pointer', ['VirtQueue']]],
    'cursor_vq': [0x100, ['pointer', ['VirtQueue']]],
    'enable': [0x108, ['int']],
    'config_size': [0x10c, ['int']],
    'qdev': [0x110, ['pointer', ['DeviceState']]],
    'reslist': [0x118, ['Enumeration', {'target': 'int', 'choices': {256: 'VNC_AUTH_VENCRYPT_PLAIN', 257: 'VNC_AUTH_VENCRYPT_TLSNONE', 258: 'VNC_AUTH_VENCRYPT_TLSVNC', 259: 'VNC_AUTH_VENCRYPT_TLSPLAIN', 260: 'VNC_AUTH_VENCRYPT_X509NONE', 261: 'VNC_AUTH_VENCRYPT_X509VNC', 262: 'VNC_AUTH_VENCRYPT_X509PLAIN', 263: 'VNC_AUTH_VENCRYPT_X509SASL', 264: 'VNC_AUTH_VENCRYPT_TLSSASL'}}]],
    'cmdq': [0x128, ['__unnamed_0x38b5']],
    'fenceq': [0x138, ['__unnamed_0x38d6']],
    'scanout': [0x148, ['array', 16, ['virtio_gpu_scanout']]],
    'req_state': [0x7c8, ['array', 16, ['virtio_gpu_requested_state']]],
    'conf': [0x8c8, ['virtio_gpu_conf']],
    'hostmem': [0x8d8, ['unsigned long']],
    'enabled_output_bitmask': [0x8e0, ['int']],
    'virtio_config': [0x8e4, ['virtio_gpu_config']],
    'use_virgl_renderer': [0x8f4, ['unsigned char']],
    'renderer_inited': [0x8f5, ['unsigned char']],
    'renderer_blocked': [0x8f8, ['int']],
    'fence_poll': [0x900, ['pointer', ['QEMUTimer']]],
    'print_stats': [0x908, ['pointer', ['QEMUTimer']]],
    'inflight': [0x910, ['unsigned int']],
    'stats': [0x914, ['__unnamed_0x38f7']],
    'migration_blocker': [0x928, ['pointer', ['Error']]],
}],
  'VFIOConfigMirrorQuirk': [ 0x18, {
    'vdev': [0x0, ['pointer', ['VFIOPCIDevice']]],
    'offset': [0x8, ['unsigned int']],
    'bar': [0xc, ['unsigned char']],
    'mem': [0x10, ['pointer', ['MemoryRegion']]],
}],
  'USBCCIDState': [ 0x124c0, {
    'dev': [0x0, ['USBDevice']],
    'intr': [0x16a8, ['pointer', ['USBEndpoint']]],
    'bulk': [0x16b0, ['pointer', ['USBEndpoint']]],
    'bus': [0x16b8, ['CCIDBus']],
    'card': [0x1720, ['pointer', ['CCIDCardState']]],
    'bulk_in_pending': [0x1728, ['array', 8, ['BulkIn']]],
    'bulk_in_pending_start': [0x2368, ['unsigned int']],
    'bulk_in_pending_end': [0x236c, ['unsigned int']],
    'bulk_in_pending_num': [0x2370, ['unsigned int']],
    'current_bulk_in': [0x2378, ['pointer', ['BulkIn']]],
    'bulk_out_data': [0x2380, ['array', 65536, ['unsigned char']]],
    'bulk_out_pos': [0x12380, ['unsigned int']],
    'last_answer_error': [0x12388, ['unsigned long']],
    'pending_answers': [0x12390, ['array', 128, ['Answer']]],
    'pending_answers_start': [0x12490, ['unsigned int']],
    'pending_answers_end': [0x12494, ['unsigned int']],
    'pending_answers_num': [0x12498, ['unsigned int']],
    'bError': [0x1249c, ['unsigned char']],
    'bmCommandStatus': [0x1249d, ['unsigned char']],
    'bProtocolNum': [0x1249e, ['unsigned char']],
    'abProtocolDataStructure': [0x1249f, ['CCID_ProtocolDataStructure']],
    'ulProtocolDataStructureSize': [0x124a8, ['unsigned int']],
    'state_vmstate': [0x124ac, ['unsigned int']],
    'migration_target_ip': [0x124b0, ['unsigned int']],
    'migration_target_port': [0x124b4, ['unsigned short']],
    'migration_state': [0x124b6, ['unsigned char']],
    'bmSlotICCState': [0x124b7, ['unsigned char']],
    'powered': [0x124b8, ['unsigned char']],
    'notify_slot_change': [0x124b9, ['unsigned char']],
    'debug': [0x124ba, ['unsigned char']],
}],
  'VFIOCalxedaXgmacDeviceClass': [ 0xe0, {
    'parent_class': [0x0, ['VFIOPlatformDeviceClass']],
    'parent_realize': [0xd8, ['pointer', ['void']]],
}],
  'q_obj_query_rx_filter_arg': [ 0x10, {
    'has_name': [0x0, ['unsigned char']],
    'name': [0x8, ['pointer', ['char']]],
}],
  'SDL_JoyBallEvent': [ 0x8, {
    'type': [0x0, ['unsigned char']],
    'which': [0x1, ['unsigned char']],
    'ball': [0x2, ['unsigned char']],
    'xrel': [0x4, ['short']],
    'yrel': [0x6, ['short']],
}],
  'simplify_type<llvm::Constant*': [ 0x1, {
}],
  'soundhw': [ 0x20, {
    'name': [0x0, ['pointer', ['char']]],
    'descr': [0x8, ['pointer', ['char']]],
    'enabled': [0x10, ['int']],
    'isa': [0x14, ['int']],
    'init': [0x18, ['__unnamed_0x226f']],
}],
  '_Vector_base<std::pair<unsigned int, unsigned int': [ 0x18, {
    '_M_impl': [0x0, ['_Vector_impl']],
}],
  '__unnamed_0x11e3': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['USBDescString']]],
}],
  'allocator_traits<std::allocator<std::_Rb_tree_node<std::pair<const llvm::Function* const, long int': [ 0x1, {
}],
  'MigrationInfo': [ 0x98, {
    'has_status': [0x0, ['unsigned char']],
    'status': [0x4, ['Enumeration', {'target': 'int', 'choices': {0: 'MIGRATION_STATUS_NONE', 1: 'MIGRATION_STATUS_SETUP', 2: 'MIGRATION_STATUS_CANCELLING', 3: 'MIGRATION_STATUS_CANCELLED', 4: 'MIGRATION_STATUS_ACTIVE', 5: 'MIGRATION_STATUS_POSTCOPY_ACTIVE', 6: 'MIGRATION_STATUS_COMPLETED', 7: 'MIGRATION_STATUS_FAILED', 8: 'MIGRATION_STATUS_COLO', 9: 'MIGRATION_STATUS__MAX'}}]],
    'has_ram': [0x8, ['unsigned char']],
    'ram': [0x10, ['pointer', ['MigrationStats']]],
    'has_disk': [0x18, ['unsigned char']],
    'disk': [0x20, ['pointer', ['MigrationStats']]],
    'has_xbzrle_cache': [0x28, ['unsigned char']],
    'xbzrle_cache': [0x30, ['pointer', ['XBZRLECacheStats']]],
    'has_total_time': [0x38, ['unsigned char']],
    'total_time': [0x40, ['long']],
    'has_expected_downtime': [0x48, ['unsigned char']],
    'expected_downtime': [0x50, ['long']],
    'has_downtime': [0x58, ['unsigned char']],
    'downtime': [0x60, ['long']],
    'has_setup_time': [0x68, ['unsigned char']],
    'setup_time': [0x70, ['long']],
    'has_cpu_throttle_percentage': [0x78, ['unsigned char']],
    'cpu_throttle_percentage': [0x80, ['long']],
    'has_error_desc': [0x88, ['unsigned char']],
    'error_desc': [0x90, ['pointer', ['char']]],
}],
  'vhost_memory': [ 0x8, {
    'nregions': [0x0, ['unsigned int']],
    'padding': [0x4, ['unsigned int']],
    'regions': [0x8, ['array', 0, ['vhost_memory_region']]],
}],
  'MigrationParameters': [ 0xa0, {
    'has_compress_level': [0x0, ['unsigned char']],
    'compress_level': [0x8, ['long']],
    'has_compress_threads': [0x10, ['unsigned char']],
    'compress_threads': [0x18, ['long']],
    'has_decompress_threads': [0x20, ['unsigned char']],
    'decompress_threads': [0x28, ['long']],
    'has_cpu_throttle_initial': [0x30, ['unsigned char']],
    'cpu_throttle_initial': [0x38, ['long']],
    'has_cpu_throttle_increment': [0x40, ['unsigned char']],
    'cpu_throttle_increment': [0x48, ['long']],
    'has_tls_creds': [0x50, ['unsigned char']],
    'tls_creds': [0x58, ['pointer', ['char']]],
    'has_tls_hostname': [0x60, ['unsigned char']],
    'tls_hostname': [0x68, ['pointer', ['char']]],
    'has_max_bandwidth': [0x70, ['unsigned char']],
    'max_bandwidth': [0x78, ['long']],
    'has_downtime_limit': [0x80, ['unsigned char']],
    'downtime_limit': [0x88, ['long']],
    'has_x_checkpoint_delay': [0x90, ['unsigned char']],
    'x_checkpoint_delay': [0x98, ['long']],
}],
  'ObjectProperty': [ 0x40, {
    'name': [0x0, ['pointer', ['char']]],
    'type': [0x8, ['pointer', ['char']]],
    'description': [0x10, ['pointer', ['char']]],
    'get': [0x18, ['pointer', ['void']]],
    'set': [0x20, ['pointer', ['void']]],
    'resolve': [0x28, ['pointer', ['void']]],
    'release': [0x30, ['pointer', ['void']]],
    'opaque': [0x38, ['pointer', ['void']]],
}],
  'XHCIEvent': [ 0x20, {
    'type': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'TRB_RESERVED', 1: 'TR_NORMAL', 2: 'TR_SETUP', 3: 'TR_DATA', 4: 'TR_STATUS', 5: 'TR_ISOCH', 6: 'TR_LINK', 7: 'TR_EVDATA', 8: 'TR_NOOP', 9: 'CR_ENABLE_SLOT', 10: 'CR_DISABLE_SLOT', 11: 'CR_ADDRESS_DEVICE', 12: 'CR_CONFIGURE_ENDPOINT', 13: 'CR_EVALUATE_CONTEXT', 14: 'CR_RESET_ENDPOINT', 15: 'CR_STOP_ENDPOINT', 16: 'CR_SET_TR_DEQUEUE', 17: 'CR_RESET_DEVICE', 18: 'CR_FORCE_EVENT', 19: 'CR_NEGOTIATE_BW', 20: 'CR_SET_LATENCY_TOLERANCE', 21: 'CR_GET_PORT_BANDWIDTH', 22: 'CR_FORCE_HEADER', 23: 'CR_NOOP', 32: 'ER_TRANSFER', 33: 'ER_COMMAND_COMPLETE', 34: 'ER_PORT_STATUS_CHANGE', 35: 'ER_BANDWIDTH_REQUEST', 36: 'ER_DOORBELL', 37: 'ER_HOST_CONTROLLER', 38: 'ER_DEVICE_NOTIFICATION', 39: 'ER_MFINDEX_WRAP', 48: 'CR_VENDOR_VIA_CHALLENGE_RESPONSE', 49: 'CR_VENDOR_NEC_FIRMWARE_REVISION', 50: 'CR_VENDOR_NEC_CHALLENGE_RESPONSE'}}]],
    'ccode': [0x4, ['Enumeration', {'target': 'int', 'choices': {0: 'CC_INVALID', 1: 'CC_SUCCESS', 2: 'CC_DATA_BUFFER_ERROR', 3: 'CC_BABBLE_DETECTED', 4: 'CC_USB_TRANSACTION_ERROR', 5: 'CC_TRB_ERROR', 6: 'CC_STALL_ERROR', 7: 'CC_RESOURCE_ERROR', 8: 'CC_BANDWIDTH_ERROR', 9: 'CC_NO_SLOTS_ERROR', 10: 'CC_INVALID_STREAM_TYPE_ERROR', 11: 'CC_SLOT_NOT_ENABLED_ERROR', 12: 'CC_EP_NOT_ENABLED_ERROR', 13: 'CC_SHORT_PACKET', 14: 'CC_RING_UNDERRUN', 15: 'CC_RING_OVERRUN', 16: 'CC_VF_ER_FULL', 17: 'CC_PARAMETER_ERROR', 18: 'CC_BANDWIDTH_OVERRUN', 19: 'CC_CONTEXT_STATE_ERROR', 20: 'CC_NO_PING_RESPONSE_ERROR', 21: 'CC_EVENT_RING_FULL_ERROR', 22: 'CC_INCOMPATIBLE_DEVICE_ERROR', 23: 'CC_MISSED_SERVICE_ERROR', 24: 'CC_COMMAND_RING_STOPPED', 25: 'CC_COMMAND_ABORTED', 26: 'CC_STOPPED', 27: 'CC_STOPPED_LENGTH_INVALID', 29: 'CC_MAX_EXIT_LATENCY_TOO_LARGE_ERROR', 31: 'CC_ISOCH_BUFFER_OVERRUN', 32: 'CC_EVENT_LOST_ERROR', 33: 'CC_UNDEFINED_ERROR', 34: 'CC_INVALID_STREAM_ID_ERROR', 35: 'CC_SECONDARY_BANDWIDTH_ERROR', 36: 'CC_SPLIT_TRANSACTION_ERROR'}}]],
    'ptr': [0x8, ['unsigned long']],
    'length': [0x10, ['unsigned int']],
    'flags': [0x14, ['unsigned int']],
    'slotid': [0x18, ['unsigned char']],
    'epid': [0x19, ['unsigned char']],
}],
  'SpiceWatch': [ 0x28, {
    'fd': [0x0, ['int']],
    'event_mask': [0x4, ['int']],
    'func': [0x8, ['pointer', ['void']]],
    'opaque': [0x10, ['pointer', ['void']]],
    'next': [0x18, ['Enumeration', {'target': 'int', 'choices': {0: 'DMA_DIRECTION_TO_DEVICE', 1: 'DMA_DIRECTION_FROM_DEVICE'}}]],
}],
  '__unnamed_0x336c': [ 0x18, {
    'phys_addr': [0x0, ['unsigned long long']],
    'data': [0x8, ['array', 8, ['unsigned char']]],
    'len': [0x10, ['unsigned int']],
    'is_write': [0x14, ['unsigned char']],
}],
  'mfi_ctrl_props': [ 0x40, {
    'seq_num': [0x0, ['unsigned short']],
    'pred_fail_poll_interval': [0x2, ['unsigned short']],
    'intr_throttle_cnt': [0x4, ['unsigned short']],
    'intr_throttle_timeout': [0x6, ['unsigned short']],
    'rebuild_rate': [0x8, ['unsigned char']],
    'patrol_read_rate': [0x9, ['unsigned char']],
    'bgi_rate': [0xa, ['unsigned char']],
    'cc_rate': [0xb, ['unsigned char']],
    'recon_rate': [0xc, ['unsigned char']],
    'cache_flush_interval': [0xd, ['unsigned char']],
    'spinup_drv_cnt': [0xe, ['unsigned char']],
    'spinup_delay': [0xf, ['unsigned char']],
    'cluster_enable': [0x10, ['unsigned char']],
    'coercion_mode': [0x11, ['unsigned char']],
    'alarm_enable': [0x12, ['unsigned char']],
    'disable_auto_rebuild': [0x13, ['unsigned char']],
    'disable_battery_warn': [0x14, ['unsigned char']],
    'ecc_bucket_size': [0x15, ['unsigned char']],
    'ecc_bucket_leak_rate': [0x16, ['unsigned short']],
    'restore_hotspare_on_insertion': [0x18, ['unsigned char']],
    'expose_encl_devices': [0x19, ['unsigned char']],
    'maintainPdFailHistory': [0x1a, ['unsigned char']],
    'disallowHostRequestReordering': [0x1b, ['unsigned char']],
    'abortCCOnError': [0x1c, ['unsigned char']],
    'loadBalanceMode': [0x1d, ['unsigned char']],
    'disableAutoDetectBackplane': [0x1e, ['unsigned char']],
    'snapVDSpace': [0x1f, ['unsigned char']],
    'OnOffProperties': [0x20, ['unsigned int']],
    'autoSnapVDSpace': [0x24, ['unsigned char']],
    'viewSpace': [0x25, ['unsigned char']],
    'spinDownTime': [0x26, ['unsigned short']],
    'reserved': [0x28, ['array', 24, ['unsigned char']]],
}],
  'TCGBackendData': [ 0x8, {
    'labels': [0x0, ['pointer', ['TCGLabelQemuLdst']]],
}],
  'DriveBackupState': [ 0x40, {
    'common': [0x0, ['BlkActionState']],
    'bs': [0x28, ['pointer', ['BlockDriverState']]],
    'aio_context': [0x30, ['pointer', ['AioContext']]],
    'job': [0x38, ['pointer', ['BlockJob']]],
}],
  'qht_bucket': [ 0x40, {
    'lock': [0x0, ['QemuSpin']],
    'sequence': [0x4, ['QemuSeqLock']],
    'hashes': [0x8, ['array', 4, ['unsigned int']]],
    'pointers': [0x18, ['array', 4, ['pointer', ['void']]]],
    'next': [0x38, ['pointer', ['qht_bucket']]],
}],
  '__unnamed_0x957': [ 0x10, {
    'le_next': [0x0, ['pointer', ['CaptureState']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['CaptureState']]]],
}],
  'RxFilterInfo': [ 0x40, {
    'name': [0x0, ['pointer', ['char']]],
    'promiscuous': [0x8, ['unsigned char']],
    'multicast': [0xc, ['Enumeration', {'target': 'int', 'choices': {0: 'RX_STATE_NORMAL', 1: 'RX_STATE_NONE', 2: 'RX_STATE_ALL', 3: 'RX_STATE__MAX'}}]],
    'unicast': [0x10, ['Enumeration', {'target': 'int', 'choices': {0: 'RX_STATE_NORMAL', 1: 'RX_STATE_NONE', 2: 'RX_STATE_ALL', 3: 'RX_STATE__MAX'}}]],
    'vlan': [0x14, ['Enumeration', {'target': 'int', 'choices': {0: 'RX_STATE_NORMAL', 1: 'RX_STATE_NONE', 2: 'RX_STATE_ALL', 3: 'RX_STATE__MAX'}}]],
    'broadcast_allowed': [0x18, ['unsigned char']],
    'multicast_overflow': [0x19, ['unsigned char']],
    'unicast_overflow': [0x1a, ['unsigned char']],
    'main_mac': [0x20, ['pointer', ['char']]],
    'vlan_table': [0x28, ['pointer', ['intList']]],
    'unicast_table': [0x30, ['pointer', ['strList']]],
    'multicast_table': [0x38, ['pointer', ['strList']]],
}],
  'Monitor': [ 0x100, {
    'chr': [0x0, ['CharBackend']],
    'reset_seen': [0x30, ['int']],
    'flags': [0x34, ['int']],
    'suspend_cnt': [0x38, ['int']],
    'skip_flush': [0x3c, ['unsigned char']],
    'out_lock': [0x40, ['QemuMutex']],
    'outbuf': [0x68, ['pointer', ['QString']]],
    'out_watch': [0x70, ['unsigned int']],
    'mux_out': [0x74, ['int']],
    'rs': [0x78, ['pointer', ['ReadLineState']]],
    'qmp': [0x80, ['__unnamed_0x929e']],
    'mon_cpu': [0xc8, ['pointer', ['CPUState']]],
    'password_completion_cb': [0xd0, ['pointer', ['void']]],
    'password_opaque': [0xd8, ['pointer', ['void']]],
    'cmd_table': [0xe0, ['pointer', ['mon_cmd_t']]],
    'fds': [0xe8, ['__unnamed_0x9332']],
    'entry': [0xf0, ['__unnamed_0x9347']],
}],
  '__unnamed_0x950': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['QemuOpts']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['QemuOpts']]]],
}],
  'NvdimmFuncReadFITIn': [ 0x4, {
    'offset': [0x0, ['unsigned int']],
}],
  '__uninitialized_copy<true': [ 0x1, {
}],
  '__unnamed_0x10aa': [ 0x80, {
    'ss': [0x0, ['sockaddr_storage']],
    'sin6': [0x0, ['sockaddr_in6']],
    'sin': [0x0, ['sockaddr_in']],
}],
  'QObjectInputVisitor': [ 0xb8, {
    'visitor': [0x0, ['Visitor']],
    'root': [0xa0, ['pointer', ['QObject']]],
    'stack': [0xa8, ['__unnamed_0xdba']],
    'strict': [0xb0, ['unsigned char']],
}],
  '__unnamed_0x3e5e': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['USBHostIsoRing']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['USBHostIsoRing']]]],
}],
  'BlockAIOCB': [ 0x28, {
    'aiocb_info': [0x0, ['pointer', ['AIOCBInfo']]],
    'bs': [0x8, ['pointer', ['BlockDriverState']]],
    'cb': [0x10, ['pointer', ['void']]],
    'opaque': [0x18, ['pointer', ['void']]],
    'refcnt': [0x20, ['int']],
}],
  'q_obj_add_fd_arg': [ 0x20, {
    'has_fdset_id': [0x0, ['unsigned char']],
    'fdset_id': [0x8, ['long']],
    'has_opaque': [0x10, ['unsigned char']],
    'opaque': [0x18, ['pointer', ['char']]],
}],
  'RockerSwitch': [ 0x18, {
    'name': [0x0, ['pointer', ['char']]],
    'id': [0x8, ['unsigned long']],
    'ports': [0x10, ['unsigned int']],
}],
  '_GThreadPool': [ 0x18, {
    'func': [0x0, ['pointer', ['void']]],
    'user_data': [0x8, ['pointer', ['void']]],
    'exclusive': [0x10, ['int']],
}],
  'ChardevVC': [ 0x50, {
    'has_logfile': [0x0, ['unsigned char']],
    'logfile': [0x8, ['pointer', ['char']]],
    'has_logappend': [0x10, ['unsigned char']],
    'logappend': [0x11, ['unsigned char']],
    'has_width': [0x12, ['unsigned char']],
    'width': [0x18, ['long']],
    'has_height': [0x20, ['unsigned char']],
    'height': [0x28, ['long']],
    'has_cols': [0x30, ['unsigned char']],
    'cols': [0x38, ['long']],
    'has_rows': [0x40, ['unsigned char']],
    'rows': [0x48, ['long']],
}],
  '__unnamed_0x915f': [ 0x10, {
    'le_next': [0x0, ['pointer', ['mon_fd_t']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['mon_fd_t']]]],
}],
  'RTL8139TallyCounters': [ 0x40, {
    'TxOk': [0x0, ['unsigned long']],
    'RxOk': [0x8, ['unsigned long']],
    'TxERR': [0x10, ['unsigned long']],
    'RxERR': [0x18, ['unsigned int']],
    'MissPkt': [0x1c, ['unsigned short']],
    'FAE': [0x1e, ['unsigned short']],
    'Tx1Col': [0x20, ['unsigned int']],
    'TxMCol': [0x24, ['unsigned int']],
    'RxOkPhy': [0x28, ['unsigned long']],
    'RxOkBrd': [0x30, ['unsigned long']],
    'RxOkMul': [0x38, ['unsigned int']],
    'TxAbt': [0x3c, ['unsigned short']],
    'TxUndrn': [0x3e, ['unsigned short']],
}],
  'TAPState': [ 0x11628, {
    'nc': [0x0, ['NetClientState']],
    'fd': [0x170, ['int']],
    'down_script': [0x174, ['array', 1024, ['char']]],
    'down_script_arg': [0x574, ['array', 128, ['char']]],
    'buf': [0x5f4, ['array', 69632, ['unsigned char']]],
    'read_poll': [0x115f4, ['unsigned char']],
    'write_poll': [0x115f5, ['unsigned char']],
    'using_vnet_hdr': [0x115f6, ['unsigned char']],
    'has_ufo': [0x115f7, ['unsigned char']],
    'enabled': [0x115f8, ['unsigned char']],
    'vhost_net': [0x11600, ['pointer', ['vhost_net']]],
    'host_vnet_hdr_len': [0x11608, ['unsigned int']],
    'exit': [0x11610, ['Notifier']],
}],
  'SpiceKbdInstance': [ 0x10, {
    'base': [0x0, ['SpiceBaseInstance']],
    'st': [0x8, ['pointer', ['SpiceKbdState']]],
}],
  'PICClass': [ 0xd8, {
    'parent_class': [0x0, ['PICCommonClass']],
    'parent_realize': [0xd0, ['pointer', ['void']]],
}],
  'QIOChannel': [ 0x38, {
    'parent': [0x0, ['Object']],
    'features': [0x28, ['unsigned int']],
    'name': [0x30, ['pointer', ['char']]],
}],
  '__unnamed_0x52c8': [ 0x18, {
    'cmd': [0x0, ['virtio_scsi_cmd_req']],
    'tmf': [0x0, ['virtio_scsi_ctrl_tmf_req']],
    'an': [0x0, ['virtio_scsi_ctrl_an_req']],
}],
  'strList': [ 0x10, {
    'next': [0x0, ['pointer', ['strList']]],
    'value': [0x8, ['pointer', ['char']]],
}],
  'RngEgd': [ 0x78, {
    'parent': [0x0, ['RngBackend']],
    'chr': [0x40, ['CharBackend']],
    'chr_name': [0x70, ['pointer', ['char']]],
}],
  '_GPtrArray': [ 0x10, {
    'pdata': [0x0, ['pointer', ['pointer', ['void']]]],
    'len': [0x8, ['unsigned int']],
}],
  'blkif_x86_32_back_ring': [ 0x18, {
    'rsp_prod_pvt': [0x0, ['unsigned int']],
    'req_cons': [0x4, ['unsigned int']],
    'nr_ents': [0x8, ['unsigned int']],
    'sring': [0x10, ['pointer', ['blkif_x86_32_sring']]],
}],
  '__unnamed_0x10a0': [ 0x10, {
    'le_next': [0x0, ['pointer', ['ChildProcessRecord']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['ChildProcessRecord']]]],
}],
  'MonFdsetFd': [ 0x20, {
    'fd': [0x0, ['int']],
    'removed': [0x4, ['unsigned char']],
    'opaque': [0x8, ['pointer', ['char']]],
    'next': [0x10, ['__unnamed_0x91d3']],
}],
  '__unnamed_0x10a7': [ 0x10, {
    'le_next': [0x0, ['pointer', ['NamedGPIOList']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['NamedGPIOList']]]],
}],
  '_Vector_impl': [ 0x18, {
    '_M_start': [0x0, ['pointer', ['pointer', ['void']]]],
    '_M_finish': [0x8, ['pointer', ['pointer', ['void']]]],
    '_M_end_of_storage': [0x10, ['pointer', ['pointer', ['void']]]],
}],
  'kvm_fpu': [ 0x1a0, {
    'fpr': [0x0, ['array', 16, ['array', 8, ['unsigned char']]]],
    'fcw': [0x80, ['unsigned short']],
    'fsw': [0x82, ['unsigned short']],
    'ftwx': [0x84, ['unsigned char']],
    'pad1': [0x85, ['unsigned char']],
    'last_opcode': [0x86, ['unsigned short']],
    'last_ip': [0x88, ['unsigned long long']],
    'last_dp': [0x90, ['unsigned long long']],
    'xmm': [0x98, ['array', 16, ['array', 16, ['unsigned char']]]],
    'mxcsr': [0x198, ['unsigned int']],
    'pad2': [0x19c, ['unsigned int']],
}],
  'smbios_30_entry_point': [ 0x18, {
    'anchor_string': [0x0, ['array', 5, ['unsigned char']]],
    'checksum': [0x5, ['unsigned char']],
    'length': [0x6, ['unsigned char']],
    'smbios_major_version': [0x7, ['unsigned char']],
    'smbios_minor_version': [0x8, ['unsigned char']],
    'smbios_doc_rev': [0x9, ['unsigned char']],
    'entry_point_revision': [0xa, ['unsigned char']],
    'reserved': [0xb, ['unsigned char']],
    'structure_table_max_size': [0xc, ['unsigned int']],
    'structure_table_address': [0x10, ['unsigned long']],
}],
  'VncInfo2List': [ 0x10, {
    'next': [0x0, ['pointer', ['VncInfo2List']]],
    'value': [0x8, ['pointer', ['VncInfo2']]],
}],
  'QXLDrawable': [ 0xbf, {
    'release_info': [0x0, ['QXLReleaseInfo']],
    'surface_id': [0x8, ['unsigned int']],
    'effect': [0xc, ['unsigned char']],
    'type': [0xd, ['unsigned char']],
    'self_bitmap': [0xe, ['unsigned char']],
    'self_bitmap_area': [0xf, ['QXLRect']],
    'bbox': [0x1f, ['QXLRect']],
    'clip': [0x2f, ['QXLClip']],
    'mm_time': [0x3b, ['unsigned int']],
    'surfaces_dest': [0x3f, ['array', 3, ['int']]],
    'surfaces_rects': [0x4b, ['array', 3, ['QXLRect']]],
    'u': [0x7b, ['__unnamed_0x1bff']],
}],
  'virtio_gpu_set_scanout': [ 0x30, {
    'hdr': [0x0, ['virtio_gpu_ctrl_hdr']],
    'r': [0x18, ['virtio_gpu_rect']],
    'scanout_id': [0x28, ['unsigned int']],
    'resource_id': [0x2c, ['unsigned int']],
}],
  'BDRVQcow2State': [ 0x190, {
    'cluster_bits': [0x0, ['int']],
    'cluster_size': [0x4, ['int']],
    'cluster_sectors': [0x8, ['int']],
    'l2_bits': [0xc, ['int']],
    'l2_size': [0x10, ['int']],
    'l1_size': [0x14, ['int']],
    'l1_vm_state_index': [0x18, ['int']],
    'refcount_block_bits': [0x1c, ['int']],
    'refcount_block_size': [0x20, ['int']],
    'csize_shift': [0x24, ['int']],
    'csize_mask': [0x28, ['int']],
    'cluster_offset_mask': [0x30, ['unsigned long']],
    'l1_table_offset': [0x38, ['unsigned long']],
    'l1_table': [0x40, ['pointer', ['unsigned long']]],
    'l2_table_cache': [0x48, ['pointer', ['Qcow2Cache']]],
    'refcount_block_cache': [0x50, ['pointer', ['Qcow2Cache']]],
    'cache_clean_timer': [0x58, ['pointer', ['QEMUTimer']]],
    'cache_clean_interval': [0x60, ['unsigned int']],
    'cluster_cache': [0x68, ['pointer', ['unsigned char']]],
    'cluster_data': [0x70, ['pointer', ['unsigned char']]],
    'cluster_cache_offset': [0x78, ['unsigned long']],
    'cluster_allocs': [0x80, ['QCowClusterAlloc']],
    'refcount_table': [0x88, ['pointer', ['unsigned long']]],
    'refcount_table_offset': [0x90, ['unsigned long']],
    'refcount_table_size': [0x98, ['unsigned int']],
    'free_cluster_index': [0xa0, ['unsigned long']],
    'free_byte_offset': [0xa8, ['unsigned long']],
    'lock': [0xb0, ['CoMutex']],
    'cipher': [0xd0, ['pointer', ['QCryptoCipher']]],
    'crypt_method_header': [0xd8, ['unsigned int']],
    'snapshots_offset': [0xe0, ['unsigned long']],
    'snapshots_size': [0xe8, ['int']],
    'nb_snapshots': [0xec, ['unsigned int']],
    'snapshots': [0xf0, ['pointer', ['QCowSnapshot']]],
    'flags': [0xf8, ['int']],
    'qcow_version': [0xfc, ['int']],
    'use_lazy_refcounts': [0x100, ['unsigned char']],
    'refcount_order': [0x104, ['int']],
    'refcount_bits': [0x108, ['int']],
    'refcount_max': [0x110, ['unsigned long']],
    'get_refcount': [0x118, ['pointer', ['void']]],
    'set_refcount': [0x120, ['pointer', ['void']]],
    'discard_passthrough': [0x128, ['array', 5, ['unsigned char']]],
    'overlap_check': [0x130, ['int']],
    'signaled_corruption': [0x134, ['unsigned char']],
    'incompatible_features': [0x138, ['unsigned long']],
    'compatible_features': [0x140, ['unsigned long']],
    'autoclear_features': [0x148, ['unsigned long']],
    'unknown_header_fields_size': [0x150, ['unsigned long']],
    'unknown_header_fields': [0x158, ['pointer', ['void']]],
    'unknown_header_ext': [0x160, ['__unnamed_0x3a34']],
    'discards': [0x168, ['__unnamed_0x3a4b']],
    'cache_discards': [0x178, ['unsigned char']],
    'image_backing_file': [0x180, ['pointer', ['char']]],
    'image_backing_format': [0x188, ['pointer', ['char']]],
}],
  'PageDescriptor': [ 0x18, {
    'offset': [0x0, ['unsigned long']],
    'size': [0x8, ['unsigned int']],
    'flags': [0xc, ['unsigned int']],
    'page_flags': [0x10, ['unsigned long']],
}],
  'audio_callback': [ 0x10, {
    'opaque': [0x0, ['pointer', ['void']]],
    'fn': [0x8, ['pointer', ['void']]],
}],
  'prefixinfo': [ 0x1e, {
    'prefix_length': [0x0, ['unsigned char']],
    'A': [0x1, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'L': [0x1, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'reserved1': [0x1, ['BitField', {'end_bit': 6, 'start_bit': 0}]],
    'valid_lt': [0x2, ['unsigned int']],
    'pref_lt': [0x6, ['unsigned int']],
    'reserved2': [0xa, ['unsigned int']],
    'prefix': [0xe, ['in6_addr']],
}],
  'SmallVectorStorage<llvm::sys::MemoryBlock, 16u': [ 0xf0, {
    'InlineElts': [0x0, ['array', 15, ['AlignedCharArrayUnion<llvm::sys::MemoryBlock, char, char, char, char, char, char']]],
}],
  '__unnamed_0xb50': [ 0x8, {
    'sqe_next': [0x0, ['pointer', ['Coroutine']]],
}],
  'CCID_Header': [ 0x7, {
    'bMessageType': [0x0, ['unsigned char']],
    'dwLength': [0x1, ['unsigned int']],
    'bSlot': [0x5, ['unsigned char']],
    'bSeq': [0x6, ['unsigned char']],
}],
  '__is_normal_iterator<llvm::Type**': [ 0x1, {
}],
  'iterator<std::bidirectional_iterator_tag, const llvm::Argument, long int, const llvm::Argument*, const llvm::Argument&': [ 0x1, {
}],
  'I440FXState': [ 0x640, {
    'parent_obj': [0x0, ['PCIHostState']],
    'pci_hole': [0x620, ['Range']],
    'pci_hole64_size': [0x630, ['unsigned long']],
    'short_root_bus': [0x638, ['unsigned int']],
}],
  'HDGeometry': [ 0xc, {
    'heads': [0x0, ['unsigned int']],
    'sectors': [0x4, ['unsigned int']],
    'cylinders': [0x8, ['unsigned int']],
}],
  'IsaDma': [ 0x28, {
    'parent': [0x0, ['Object']],
}],
  'VFIOPlatformDevice': [ 0x3b8, {
    'sbdev': [0x0, ['SysBusDevice']],
    'vbasedev': [0x300, ['VFIODevice']],
    'regions': [0x350, ['pointer', ['pointer', ['VFIORegion']]]],
    'intp_list': [0x358, ['Enumeration', {'target': 'int', 'choices': {0: 'MIG_PRI_DEFAULT', 1: 'MIG_PRI_IOMMU', 2: 'MIG_PRI_MAX'}}]],
    'pending_intp_queue': [0x360, ['pending_intp_queue']],
    'compat': [0x370, ['pointer', ['char']]],
    'mmap_timeout': [0x378, ['unsigned int']],
    'mmap_timer': [0x380, ['pointer', ['QEMUTimer']]],
    'intp_mutex': [0x388, ['QemuMutex']],
    'irqfd_allowed': [0x3b0, ['unsigned char']],
}],
  'KBDState': [ 0x38, {
    'write_cmd': [0x0, ['unsigned char']],
    'status': [0x1, ['unsigned char']],
    'mode': [0x2, ['unsigned char']],
    'outport': [0x3, ['unsigned char']],
    'outport_present': [0x4, ['unsigned char']],
    'pending': [0x5, ['unsigned char']],
    'kbd': [0x8, ['pointer', ['void']]],
    'mouse': [0x10, ['pointer', ['void']]],
    'irq_kbd': [0x18, ['pointer', ['IRQState']]],
    'irq_mouse': [0x20, ['pointer', ['IRQState']]],
    'a20_out': [0x28, ['pointer', ['IRQState']]],
    'mask': [0x30, ['unsigned long']],
}],
  'new_allocator<llvm::SourceMgr::SrcBuffer': [ 0x1, {
}],
  'isa_impl_cl<llvm::Instruction, const llvm::Value*': [ 0x1, {
}],
  'virtio_crypto_config': [ 0x38, {
    'status': [0x0, ['unsigned int']],
    'max_dataqueues': [0x4, ['unsigned int']],
    'crypto_services': [0x8, ['unsigned int']],
    'cipher_algo_l': [0xc, ['unsigned int']],
    'cipher_algo_h': [0x10, ['unsigned int']],
    'hash_algo': [0x14, ['unsigned int']],
    'mac_algo_l': [0x18, ['unsigned int']],
    'mac_algo_h': [0x1c, ['unsigned int']],
    'aead_algo': [0x20, ['unsigned int']],
    'max_cipher_key_len': [0x24, ['unsigned int']],
    'max_auth_key_len': [0x28, ['unsigned int']],
    'reserve': [0x2c, ['unsigned int']],
    'max_size': [0x30, ['unsigned long']],
}],
  '__unnamed_0x18c8': [ 0x8, {
    'qcow2': [0x0, ['q_obj_ImageInfoSpecificQCow2_wrapper']],
    'vmdk': [0x0, ['q_obj_ImageInfoSpecificVmdk_wrapper']],
    'luks': [0x0, ['q_obj_QCryptoBlockInfoLUKS_wrapper']],
}],
  'eth_ip6_hdr_info_st': [ 0x60, {
    'l4proto': [0x0, ['unsigned char']],
    'full_hdr_len': [0x8, ['unsigned long']],
    'ip6_hdr': [0x10, ['ip6_header']],
    'has_ext_hdrs': [0x38, ['unsigned char']],
    'rss_ex_src_valid': [0x39, ['unsigned char']],
    'rss_ex_src': [0x3a, ['in6_address']],
    'rss_ex_dst_valid': [0x4a, ['unsigned char']],
    'rss_ex_dst': [0x4b, ['in6_address']],
    'fragment': [0x5b, ['unsigned char']],
}],
  '__unnamed_0x77a': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['qemu_acl_entry']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['qemu_acl_entry']]]],
}],
  'kvm_mp_state': [ 0x4, {
    'mp_state': [0x0, ['unsigned int']],
}],
  'ImageCheck': [ 0xa8, {
    'filename': [0x0, ['pointer', ['char']]],
    'format': [0x8, ['pointer', ['char']]],
    'check_errors': [0x10, ['long']],
    'has_image_end_offset': [0x18, ['unsigned char']],
    'image_end_offset': [0x20, ['long']],
    'has_corruptions': [0x28, ['unsigned char']],
    'corruptions': [0x30, ['long']],
    'has_leaks': [0x38, ['unsigned char']],
    'leaks': [0x40, ['long']],
    'has_corruptions_fixed': [0x48, ['unsigned char']],
    'corruptions_fixed': [0x50, ['long']],
    'has_leaks_fixed': [0x58, ['unsigned char']],
    'leaks_fixed': [0x60, ['long']],
    'has_total_clusters': [0x68, ['unsigned char']],
    'total_clusters': [0x70, ['long']],
    'has_allocated_clusters': [0x78, ['unsigned char']],
    'allocated_clusters': [0x80, ['long']],
    'has_fragmented_clusters': [0x88, ['unsigned char']],
    'fragmented_clusters': [0x90, ['long']],
    'has_compressed_clusters': [0x98, ['unsigned char']],
    'compressed_clusters': [0xa0, ['long']],
}],
  'TpmTypeList': [ 0x10, {
    'next': [0x0, ['pointer', ['TpmTypeList']]],
    'value': [0x8, ['Enumeration', {'target': 'int', 'choices': {0: 'TPM_TYPE_PASSTHROUGH', 1: 'TPM_TYPE__MAX'}}]],
}],
  '_Iter_base<unsigned char*, false': [ 0x1, {
}],
  'SchemaInfoObjectMember': [ 0x20, {
    'name': [0x0, ['pointer', ['char']]],
    'type': [0x8, ['pointer', ['char']]],
    'has_q_default': [0x10, ['unsigned char']],
    'q_default': [0x18, ['pointer', ['QObject']]],
}],
  'virtio_crypto_aead_create_session_req': [ 0x38, {
    'para': [0x0, ['virtio_crypto_aead_session_para']],
    'padding': [0x18, ['array', 32, ['unsigned char']]],
}],
  'NBDServerData': [ 0x18, {
    'listen_ioc': [0x0, ['pointer', ['QIOChannelSocket']]],
    'watch': [0x8, ['int']],
    'tlscreds': [0x10, ['pointer', ['QCryptoTLSCreds']]],
}],
  'q_obj_Abort_wrapper': [ 0x8, {
    'data': [0x0, ['pointer', ['Abort']]],
}],
  'RockerOfDpaFlowKey': [ 0x50, {
    'priority': [0x0, ['unsigned int']],
    'tbl_id': [0x4, ['unsigned int']],
    'has_in_pport': [0x8, ['unsigned char']],
    'in_pport': [0xc, ['unsigned int']],
    'has_tunnel_id': [0x10, ['unsigned char']],
    'tunnel_id': [0x14, ['unsigned int']],
    'has_vlan_id': [0x18, ['unsigned char']],
    'vlan_id': [0x1a, ['unsigned short']],
    'has_eth_type': [0x1c, ['unsigned char']],
    'eth_type': [0x1e, ['unsigned short']],
    'has_eth_src': [0x20, ['unsigned char']],
    'eth_src': [0x28, ['pointer', ['char']]],
    'has_eth_dst': [0x30, ['unsigned char']],
    'eth_dst': [0x38, ['pointer', ['char']]],
    'has_ip_proto': [0x40, ['unsigned char']],
    'ip_proto': [0x41, ['unsigned char']],
    'has_ip_tos': [0x42, ['unsigned char']],
    'ip_tos': [0x43, ['unsigned char']],
    'has_ip_dst': [0x44, ['unsigned char']],
    'ip_dst': [0x48, ['pointer', ['char']]],
}],
  'TrimAIOCB': [ 0x58, {
    'common': [0x0, ['BlockAIOCB']],
    'blk': [0x28, ['pointer', ['BlockBackend']]],
    'bh': [0x30, ['pointer', ['QEMUBH']]],
    'ret': [0x38, ['int']],
    'qiov': [0x40, ['pointer', ['QEMUIOVector']]],
    'aiocb': [0x48, ['pointer', ['BlockAIOCB']]],
    'i': [0x50, ['int']],
    'j': [0x54, ['int']],
}],
  'vhost_msg': [ 0x48, {
    'type': [0x0, ['int']],
    '__unnamed_0xeff': [0x8, ['__unnamed_0xeb8']],
}],
  'out_req_list': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['NvmeRequest']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['NvmeRequest']]]],
}],
  'oss_params': [ 0x14, {
    'freq': [0x0, ['int']],
    'fmt': [0x4, ['Enumeration', {'target': 'int', 'choices': {0: 'AUD_FMT_U8', 1: 'AUD_FMT_S8', 2: 'AUD_FMT_U16', 3: 'AUD_FMT_S16', 4: 'AUD_FMT_U32', 5: 'AUD_FMT_S32'}}]],
    'nchannels': [0x8, ['int']],
    'nfrags': [0xc, ['int']],
    'fragsize': [0x10, ['int']],
}],
  'kvm_xsave': [ 0x1000, {
    'region': [0x0, ['array', 1024, ['unsigned int']]],
}],
  'q_obj_netdev_del_arg': [ 0x8, {
    'id': [0x0, ['pointer', ['char']]],
}],
  '__unnamed_0x1a3': [ 0x80, {
    '__val': [0x0, ['array', 16, ['unsigned long']]],
}],
  'ExtSaveArea': [ 0x10, {
    'feature': [0x0, ['unsigned int']],
    'bits': [0x4, ['unsigned int']],
    'offset': [0x8, ['unsigned int']],
    'size': [0xc, ['unsigned int']],
}],
  'virtio_crypto_mac_para': [ 0x8, {
    'hash': [0x0, ['virtio_crypto_hash_para']],
}],
  'virtio_crypto_alg_chain_data_req': [ 0x28, {
    'para': [0x0, ['virtio_crypto_alg_chain_data_para']],
}],
  '__unnamed_0x4764': [ 0x4, {
    'tapif_user': [0x0, ['__unnamed_0x474f']],
    'netif': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'IOMMU_NOTIFIER_NONE', 1: 'IOMMU_NOTIFIER_UNMAP', 2: 'IOMMU_NOTIFIER_MAP'}}]],
    'pvt_pad': [0x0, ['array', 4, ['unsigned char']]],
}],
  'cast_convert_val<llvm::ConstantInt, llvm::Value*, llvm::Value*': [ 0x1, {
}],
  'VncSurface': [ 0x45820, {
    'last_freq_check': [0x0, ['timeval']],
    'dirty': [0x10, ['array', 3, ['array', 2048, ['unsigned long']]]],
    'stats': [0xc010, ['array', 40, ['array', 32, ['VncRectStat']]]],
    'fb': [0x45810, ['pointer', ['pixman_image']]],
    'format': [0x45818, ['Enumeration', {'target': 'int', 'choices': {67371008: 'PIXMAN_c4', 134545408: 'PIXMAN_g8', 537004714: 'PIXMAN_x2r10g10b10', 537495688: 'PIXMAN_r8g8b8a8', 67190784: 'PIXMAN_a4', 268567909: 'PIXMAN_r5g6b5', 402851976: 'PIXMAN_b8g8r8', 537462920: 'PIXMAN_r8g8b8x8', 17104896: 'PIXMAN_g1', 67244305: 'PIXMAN_a1r1g1b1', 537069704: 'PIXMAN_x8b8g8r8', 268633156: 'PIXMAN_x4b4g4r4', 134479872: 'PIXMAN_c8', 268649540: 'PIXMAN_a4b4g4r4', 67240225: 'PIXMAN_r1g2b1', 134357538: 'PIXMAN_a2r2g2b2', 537397384: 'PIXMAN_b8g8r8x8', 268571989: 'PIXMAN_a1r5g5b5', 268828672: 'PIXMAN_yuy2', 537078442: 'PIXMAN_a2b10g10r10', 537561224: 'PIXMAN_a8r8g8b8_sRGB', 134415154: 'PIXMAN_b2g3r3', 402786440: 'PIXMAN_r8g8b8', 134349618: 'PIXMAN_r3g3b2', 537430152: 'PIXMAN_b8g8r8a8', 537004168: 'PIXMAN_x8r8g8b8', 268567893: 'PIXMAN_x1r5g5b5', 268567620: 'PIXMAN_x4r4g4b4', 537036936: 'PIXMAN_a8r8g8b8', 67305761: 'PIXMAN_b1g2r1', 134423074: 'PIXMAN_a2b2g2r2', 537102472: 'PIXMAN_a8b8g8r8', 268633429: 'PIXMAN_x1b5g5r5', 67436544: 'PIXMAN_g4', 16846848: 'PIXMAN_a1', 268633445: 'PIXMAN_b5g6r5', 537003622: 'PIXMAN_x14r6g6b6', 67309841: 'PIXMAN_a1b1g1r1', 201785344: 'PIXMAN_yv12', 537012906: 'PIXMAN_a2r10g10b10', 134299648: 'PIXMAN_x4a4', 268584004: 'PIXMAN_a4r4g4b4', 134316032: 'PIXMAN_a8', 537070250: 'PIXMAN_x2b10g10r10', 268637525: 'PIXMAN_a1b5g5r5'}}]],
}],
  'QXLPoint': [ 0x8, {
    'x': [0x0, ['int']],
    'y': [0x4, ['int']],
}],
  'OptsFromQDictState': [ 0x10, {
    'opts': [0x0, ['pointer', ['QemuOpts']]],
    'errp': [0x8, ['pointer', ['pointer', ['Error']]]],
}],
  'guest_slots': [ 0x38, {
    'slot': [0x0, ['QXLMemSlot']],
    'mr': [0x10, ['pointer', ['MemoryRegion']]],
    'offset': [0x18, ['unsigned long']],
    'size': [0x20, ['unsigned long']],
    'delta': [0x28, ['unsigned long']],
    'active': [0x30, ['unsigned int']],
}],
  'BlkMigBlock': [ 0x60, {
    'buf': [0x0, ['pointer', ['unsigned char']]],
    'bmds': [0x8, ['pointer', ['BlkMigDevState']]],
    'sector': [0x10, ['long']],
    'nr_sectors': [0x18, ['int']],
    'iov': [0x20, ['iovec']],
    'qiov': [0x30, ['QEMUIOVector']],
    'aiocb': [0x48, ['pointer', ['BlockAIOCB']]],
    'ret': [0x50, ['int']],
    'entry': [0x58, ['__unnamed_0x35f6']],
}],
  'slirp_config_str': [ 0x410, {
    'next': [0x0, ['pointer', ['slirp_config_str']]],
    'flags': [0x8, ['int']],
    'str': [0xc, ['array', 1024, ['char']]],
    'legacy_format': [0x40c, ['int']],
}],
  '__unnamed_0x142b': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['BusState']]],
}],
  'QuorumCo': [ 0x10, {
    'acb': [0x0, ['pointer', ['QuorumAIOCB']]],
    'idx': [0x8, ['int']],
}],
  'USBBus': [ 0xb0, {
    'qbus': [0x0, ['BusState']],
    'ops': [0x68, ['pointer', ['USBBusOps']]],
    'busnr': [0x70, ['int']],
    'nfree': [0x74, ['int']],
    'nused': [0x78, ['int']],
    'free': [0x80, ['__unnamed_0x141d']],
    'used': [0x90, ['__unnamed_0x1441']],
    'next': [0xa0, ['__unnamed_0x1465']],
}],
  'less<std::__cxx11::basic_string<char, std::char_traits<char': [ 0x1, {
}],
  'PIIX3State': [ 0xa20, {
    'dev': [0x0, ['PCIDevice']],
    'pic_levels': [0x8f0, ['unsigned long']],
    'pic': [0x8f8, ['pointer', ['pointer', ['IRQState']]]],
    'pci_irq_levels_vmstate': [0x900, ['array', 4, ['int']]],
    'rcr': [0x910, ['unsigned char']],
    'rcr_mem': [0x920, ['MemoryRegion']],
}],
  '__unnamed_0xafca': [ 0x8, {
    'bridge': [0x0, ['q_obj_NetdevBridgeOptions_wrapper']],
    'none': [0x0, ['q_obj_NetdevNoneOptions_wrapper']],
    'tap': [0x0, ['q_obj_NetdevTapOptions_wrapper']],
    'socket': [0x0, ['q_obj_NetdevSocketOptions_wrapper']],
    'dump': [0x0, ['q_obj_NetdevDumpOptions_wrapper']],
    'vhost_user': [0x0, ['q_obj_NetdevVhostUserOptions_wrapper']],
    'nic': [0x0, ['q_obj_NetLegacyNicOptions_wrapper']],
    'netmap': [0x0, ['q_obj_NetdevNetmapOptions_wrapper']],
    'vde': [0x0, ['q_obj_NetdevVdeOptions_wrapper']],
    'user': [0x0, ['q_obj_NetdevUserOptions_wrapper']],
    'l2tpv3': [0x0, ['q_obj_NetdevL2TPv3Options_wrapper']],
}],
  'PciDeviceInfoList': [ 0x10, {
    'next': [0x0, ['pointer', ['PciDeviceInfoList']]],
    'value': [0x8, ['pointer', ['PciDeviceInfo']]],
}],
  '__unnamed_0x36e8': [ 0x12, {
    'fat16': [0x0, ['__unnamed_0x362b']],
    'fat32': [0x0, ['__unnamed_0x367f']],
}],
  '__unnamed_0xc89': [ 0x8, {
    'sle_next': [0x0, ['pointer', ['QStackEntry']]],
}],
  'mmsghdr': [ 0x40, {
    'msg_hdr': [0x0, ['msghdr']],
    'msg_len': [0x38, ['unsigned int']],
}],
  'SDL_AudioSpec': [ 0x20, {
    'freq': [0x0, ['int']],
    'format': [0x4, ['unsigned short']],
    'channels': [0x6, ['unsigned char']],
    'silence': [0x7, ['unsigned char']],
    'samples': [0x8, ['unsigned short']],
    'padding': [0xa, ['unsigned short']],
    'size': [0xc, ['unsigned int']],
    'callback': [0x10, ['pointer', ['void']]],
    'userdata': [0x18, ['pointer', ['void']]],
}],
  'XenDevOps': [ 0x60, {
    'size': [0x0, ['unsigned long']],
    'flags': [0x8, ['unsigned int']],
    'alloc': [0x10, ['pointer', ['void']]],
    'init': [0x18, ['pointer', ['void']]],
    'initialise': [0x20, ['pointer', ['void']]],
    'connected': [0x28, ['pointer', ['void']]],
    'event': [0x30, ['pointer', ['void']]],
    'disconnect': [0x38, ['pointer', ['void']]],
    'free': [0x40, ['pointer', ['void']]],
    'backend_changed': [0x48, ['pointer', ['void']]],
    'frontend_changed': [0x50, ['pointer', ['void']]],
    'backend_register': [0x58, ['pointer', ['void']]],
}],
  '__unnamed_0x36eb': [ 0x4, {
    'fields': [0x0, ['__unnamed_0x36ba']],
    'data': [0x0, ['unsigned int']],
}],
  'libusb_control_setup': [ 0x8, {
    'bmRequestType': [0x0, ['unsigned char']],
    'bRequest': [0x1, ['unsigned char']],
    'wValue': [0x2, ['unsigned short']],
    'wIndex': [0x4, ['unsigned short']],
    'wLength': [0x6, ['unsigned short']],
}],
  'XenPTMSI': [ 0x1c, {
    'flags': [0x0, ['unsigned short']],
    'addr_lo': [0x4, ['unsigned int']],
    'addr_hi': [0x8, ['unsigned int']],
    'data': [0xc, ['unsigned short']],
    'ctrl_offset': [0x10, ['unsigned int']],
    'pirq': [0x14, ['int']],
    'initialized': [0x18, ['unsigned char']],
    'mapped': [0x19, ['unsigned char']],
}],
  'VncServerInfo': [ 0x20, {
    'host': [0x0, ['pointer', ['char']]],
    'service': [0x8, ['pointer', ['char']]],
    'family': [0x10, ['Enumeration', {'target': 'int', 'choices': {0: 'NETWORK_ADDRESS_FAMILY_IPV4', 1: 'NETWORK_ADDRESS_FAMILY_IPV6', 2: 'NETWORK_ADDRESS_FAMILY_UNIX', 3: 'NETWORK_ADDRESS_FAMILY_VSOCK', 4: 'NETWORK_ADDRESS_FAMILY_UNKNOWN', 5: 'NETWORK_ADDRESS_FAMILY__MAX'}}]],
    'websocket': [0x14, ['unsigned char']],
    'has_auth': [0x15, ['unsigned char']],
    'auth': [0x18, ['pointer', ['char']]],
}],
  'q_obj_unload_plugin_arg': [ 0x8, {
    'index': [0x0, ['long']],
}],
  'virtio_crypto_mac_session_para': [ 0x10, {
    'algo': [0x0, ['unsigned int']],
    'hash_result_len': [0x4, ['unsigned int']],
    'auth_key_len': [0x8, ['unsigned int']],
    'padding': [0xc, ['unsigned int']],
}],
  '__unnamed_0x1736': [ 0x10, {
    'color': [0x0, ['unsigned int']],
    'pattern': [0x0, ['QXLPattern']],
}],
  'XenDevice': [ 0x510, {
    'qdev': [0x0, ['DeviceState']],
    'type': [0x70, ['pointer', ['char']]],
    'dom': [0x78, ['int']],
    'dev': [0x7c, ['int']],
    'name': [0x80, ['array', 64, ['char']]],
    'debug': [0xc0, ['int']],
    'be_state': [0xc4, ['Enumeration', {'target': 'int', 'choices': {0: 'XenbusStateUnknown', 1: 'XenbusStateInitialising', 2: 'XenbusStateInitWait', 3: 'XenbusStateInitialised', 4: 'XenbusStateConnected', 5: 'XenbusStateClosing', 6: 'XenbusStateClosed', 7: 'XenbusStateReconfiguring', 8: 'XenbusStateReconfigured'}}]],
    'fe_state': [0xc8, ['Enumeration', {'target': 'int', 'choices': {0: 'XenbusStateUnknown', 1: 'XenbusStateInitialising', 2: 'XenbusStateInitWait', 3: 'XenbusStateInitialised', 4: 'XenbusStateConnected', 5: 'XenbusStateClosing', 6: 'XenbusStateClosed', 7: 'XenbusStateReconfiguring', 8: 'XenbusStateReconfigured'}}]],
    'online': [0xcc, ['int']],
    'be': [0xd0, ['array', 1024, ['char']]],
    'fe': [0x4d0, ['pointer', ['char']]],
    'protocol': [0x4d8, ['pointer', ['char']]],
    'remote_port': [0x4e0, ['int']],
    'local_port': [0x4e4, ['int']],
    'evtchndev': [0x4e8, ['pointer', ['xc_interface_core']]],
    'gnttabdev': [0x4f0, ['pointer', ['xc_interface_core']]],
    'ops': [0x4f8, ['pointer', ['XenDevOps']]],
    'next': [0x500, ['__unnamed_0x231b']],
}],
  '_XkbClientMapRec': [ 0x30, {
    'size_types': [0x0, ['unsigned char']],
    'num_types': [0x1, ['unsigned char']],
    'types': [0x8, ['pointer', ['_XkbKeyType']]],
    'size_syms': [0x10, ['unsigned short']],
    'num_syms': [0x12, ['unsigned short']],
    'syms': [0x18, ['pointer', ['unsigned long']]],
    'key_sym_map': [0x20, ['pointer', ['_XkbSymMapRec']]],
    'modmap': [0x28, ['pointer', ['unsigned char']]],
}],
  '_XkbCompatMapRec': [ 0x20, {
    'sym_interpret': [0x0, ['pointer', ['_XkbSymInterpretRec']]],
    'groups': [0x8, ['array', 4, ['_XkbMods']]],
    'num_si': [0x18, ['unsigned short']],
    'size_si': [0x1a, ['unsigned short']],
}],
  '__unnamed_0x1423': [ 0x10, {
    'le_next': [0x0, ['pointer', ['DisplayChangeListener']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['DisplayChangeListener']]]],
}],
  'BMDMAState': [ 0x290, {
    'dma': [0x0, ['IDEDMA']],
    'cmd': [0x38, ['unsigned char']],
    'status': [0x39, ['unsigned char']],
    'addr': [0x3c, ['unsigned int']],
    'bus': [0x40, ['pointer', ['IDEBus']]],
    'cur_addr': [0x48, ['unsigned int']],
    'cur_prd_last': [0x4c, ['unsigned int']],
    'cur_prd_addr': [0x50, ['unsigned int']],
    'cur_prd_len': [0x54, ['unsigned int']],
    'dma_cb': [0x58, ['pointer', ['void']]],
    'addr_ioport': [0x60, ['MemoryRegion']],
    'extra_io': [0x160, ['MemoryRegion']],
    'irq': [0x260, ['pointer', ['IRQState']]],
    'migration_compat_status': [0x268, ['unsigned char']],
    'migration_retry_unit': [0x269, ['unsigned char']],
    'migration_retry_sector_num': [0x270, ['long']],
    'migration_retry_nsector': [0x278, ['unsigned int']],
    'pci_dev': [0x280, ['pointer', ['PCIIDEState']]],
}],
  'ifreq': [ 0x28, {
    'ifr_ifrn': [0x0, ['__unnamed_0x928']],
    'ifr_ifru': [0x10, ['__unnamed_0x94c']],
}],
  'q_obj_ChardevCommon_wrapper': [ 0x8, {
    'data': [0x0, ['pointer', ['ChardevCommon']]],
}],
  'mfi_ld_progress': [ 0x24, {
    'active': [0x0, ['unsigned int']],
    'cc': [0x4, ['mfi_progress']],
    'bgi': [0x8, ['mfi_progress']],
    'fgi': [0xc, ['mfi_progress']],
    'recon': [0x10, ['mfi_progress']],
    'reserved': [0x14, ['array', 4, ['mfi_progress']]],
}],
  'kvm_sync_regs': [ 0x0, {
}],
  'NotifierThreadData': [ 0x8, {
    'list': [0x0, ['NotifierList']],
    'ptr': [0x0, ['pointer', ['void']]],
}],
  'SaveVMHandlers': [ 0x50, {
    'set_params': [0x0, ['pointer', ['void']]],
    'save_state': [0x8, ['pointer', ['void']]],
    'cleanup': [0x10, ['pointer', ['void']]],
    'save_live_complete_postcopy': [0x18, ['pointer', ['void']]],
    'save_live_complete_precopy': [0x20, ['pointer', ['void']]],
    'is_active': [0x28, ['pointer', ['void']]],
    'save_live_iterate': [0x30, ['pointer', ['void']]],
    'save_live_setup': [0x38, ['pointer', ['void']]],
    'save_live_pending': [0x40, ['pointer', ['void']]],
    'load_state': [0x48, ['pointer', ['void']]],
}],
  'VDAgentMonConfig': [ 0x14, {
    'height': [0x0, ['unsigned int']],
    'width': [0x4, ['unsigned int']],
    'depth': [0x8, ['unsigned int']],
    'x': [0xc, ['int']],
    'y': [0x10, ['int']],
}],
  'msghdr': [ 0x38, {
    'msg_name': [0x0, ['pointer', ['void']]],
    'msg_namelen': [0x8, ['unsigned int']],
    'msg_iov': [0x10, ['pointer', ['iovec']]],
    'msg_iovlen': [0x18, ['unsigned long']],
    'msg_control': [0x20, ['pointer', ['void']]],
    'msg_controllen': [0x28, ['unsigned long']],
    'msg_flags': [0x30, ['int']],
}],
  'requests': [ 0x10, {
    'sqh_first': [0x0, ['pointer', ['RngRequest']]],
    'sqh_last': [0x8, ['pointer', ['pointer', ['RngRequest']]]],
}],
  'IPMIBT': [ 0x3a0, {
    'bmc': [0x0, ['pointer', ['IPMIBmc']]],
    'do_wake': [0x8, ['unsigned char']],
    'irq': [0x10, ['pointer', ['IRQState']]],
    'io_base': [0x18, ['unsigned int']],
    'io_length': [0x20, ['unsigned long']],
    'io': [0x30, ['MemoryRegion']],
    'obf_irq_set': [0x130, ['unsigned char']],
    'atn_irq_set': [0x131, ['unsigned char']],
    'use_irq': [0x132, ['unsigned char']],
    'irqs_enabled': [0x133, ['unsigned char']],
    'outmsg': [0x134, ['array', 300, ['unsigned char']]],
    'outpos': [0x260, ['unsigned int']],
    'outlen': [0x264, ['unsigned int']],
    'inmsg': [0x268, ['array', 300, ['unsigned char']]],
    'inlen': [0x394, ['unsigned int']],
    'control_reg': [0x398, ['unsigned char']],
    'mask_reg': [0x399, ['unsigned char']],
    'waiting_rsp': [0x39a, ['unsigned char']],
    'waiting_seq': [0x39b, ['unsigned char']],
}],
  'usb_redir_iso_stream_status_header': [ 0x2, {
    'status': [0x0, ['unsigned char']],
    'endpoint': [0x1, ['unsigned char']],
}],
  'utsname': [ 0x186, {
    'sysname': [0x0, ['array', 65, ['char']]],
    'nodename': [0x41, ['array', 65, ['char']]],
    'release': [0x82, ['array', 65, ['char']]],
    'version': [0xc3, ['array', 65, ['char']]],
    'machine': [0x104, ['array', 65, ['char']]],
    'domainname': [0x145, ['array', 65, ['char']]],
}],
  'VMStateField': [ 0x60, {
    'name': [0x0, ['pointer', ['char']]],
    'offset': [0x8, ['unsigned long']],
    'size': [0x10, ['unsigned long']],
    'start': [0x18, ['unsigned long']],
    'num': [0x20, ['int']],
    'num_offset': [0x28, ['unsigned long']],
    'size_offset': [0x30, ['unsigned long']],
    'info': [0x38, ['pointer', ['VMStateInfo']]],
    'flags': [0x40, ['Enumeration', {'target': 'int', 'choices': {2048: 'VMS_VARRAY_UINT32', 16384: 'VMS_MULTIPLY_ELEMENTS', 2: 'VMS_POINTER', 4096: 'VMS_MUST_EXIST', 8192: 'VMS_ALLOC', 1024: 'VMS_VARRAY_UINT8', 32: 'VMS_BUFFER', 8: 'VMS_STRUCT', 64: 'VMS_ARRAY_OF_POINTER', 256: 'VMS_VBUFFER', 16: 'VMS_VARRAY_INT32', 296: 'VMS_VARRAY_UINT16', 1: 'VMS_SINGLE', 512: 'VMS_MULTIPLY', 4: 'VMS_ARRAY'}}]],
    'vmsd': [0x48, ['pointer', ['VMStateDescription']]],
    'version_id': [0x50, ['int']],
    'field_exists': [0x58, ['pointer', ['void']]],
}],
  '__unnamed_0x9e5a': [ 0x348, {
    'parent': [0x0, ['VirtIODevice']],
    'conf': [0xe8, ['__unnamed_0x9e2e']],
    'vhost_vqs': [0xf8, ['array', 2, ['vhost_virtqueue']]],
    'vhost_dev': [0x1c8, ['vhost_dev']],
    'event_vq': [0x338, ['pointer', ['VirtQueue']]],
    'post_load_timer': [0x340, ['pointer', ['QEMUTimer']]],
}],
  '_XkbIndicatorMapRec': [ 0xc, {
    'flags': [0x0, ['unsigned char']],
    'which_groups': [0x1, ['unsigned char']],
    'groups': [0x2, ['unsigned char']],
    'which_mods': [0x3, ['unsigned char']],
    'mods': [0x4, ['_XkbMods']],
    'ctrls': [0x8, ['unsigned int']],
}],
  'ilist<llvm::NamedMDNode': [ 0x18, {
}],
  'ilist_default_traits<llvm::BasicBlock': [ 0x1, {
}],
  '__unnamed_0x277c': [ 0x48, {
    'type': [0x0, ['int']],
    'serial': [0x8, ['unsigned long']],
    'send_event': [0x10, ['int']],
    'display': [0x18, ['pointer', ['_XDisplay']]],
    'requestor': [0x20, ['unsigned long']],
    'selection': [0x28, ['unsigned long']],
    'target': [0x30, ['unsigned long']],
    'property': [0x38, ['unsigned long']],
    'time': [0x40, ['unsigned long']],
}],
  'rocker_desc': [ 0x20, {
    'buf_addr': [0x0, ['unsigned long']],
    'cookie': [0x8, ['unsigned long']],
    'buf_size': [0x10, ['unsigned short']],
    'tlv_size': [0x12, ['unsigned short']],
    'rsvd': [0x14, ['array', 5, ['unsigned short']]],
    'comp_err': [0x1e, ['unsigned short']],
}],
  'node_info': [ 0x28, {
    'node_mem': [0x0, ['unsigned long']],
    'node_cpu': [0x8, ['pointer', ['unsigned long']]],
    'node_memdev': [0x10, ['pointer', ['HostMemoryBackend']]],
    'present': [0x18, ['unsigned char']],
    'addr': [0x20, ['__unnamed_0x5453']],
}],
  'ParallelsHeader': [ 0x40, {
    'magic': [0x0, ['array', 16, ['char']]],
    'version': [0x10, ['unsigned int']],
    'heads': [0x14, ['unsigned int']],
    'cylinders': [0x18, ['unsigned int']],
    'tracks': [0x1c, ['unsigned int']],
    'bat_entries': [0x20, ['unsigned int']],
    'nb_sectors': [0x24, ['unsigned long']],
    'inuse': [0x2c, ['unsigned int']],
    'data_off': [0x30, ['unsigned int']],
    'padding': [0x34, ['array', 12, ['char']]],
}],
  'V9fsSynthNode': [ 0x150, {
    'child': [0x0, ['__unnamed_0x15b9']],
    'sibling': [0x8, ['__unnamed_0x15d4']],
    'name': [0x18, ['array', 255, ['char']]],
    'attr': [0x118, ['pointer', ['V9fsSynthNodeAttr']]],
    'actual_attr': [0x120, ['V9fsSynthNodeAttr']],
    'private': [0x140, ['pointer', ['void']]],
    'open_count': [0x148, ['int']],
}],
  'NvmeNamespace': [ 0x1000, {
    'id_ns': [0x0, ['NvmeIdNs']],
}],
  'uint8List': [ 0x10, {
    'next': [0x0, ['pointer', ['uint8List']]],
    'value': [0x8, ['unsigned char']],
}],
  'PhysPageEntry': [ 0x4, {
    'skip': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 0}]],
    'ptr': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 6}]],
}],
  '_Panda__TaintedBranch': [ 0x30, {
    'base': [0x0, ['ProtobufCMessage']],
    'call_stack': [0x18, ['pointer', ['_Panda__CallStack']]],
    'n_taint_query': [0x20, ['unsigned long']],
    'taint_query': [0x28, ['pointer', ['pointer', ['_Panda__TaintQuery']]]],
}],
  'BlockDirtyBitmap': [ 0x10, {
    'node': [0x0, ['pointer', ['char']]],
    'name': [0x8, ['pointer', ['char']]],
}],
  '__unnamed_0x1552': [ 0xd, {
    'position': [0x0, ['QXLPoint16']],
    'visible': [0x4, ['unsigned char']],
    'shape': [0x5, ['unsigned long']],
}],
  'AcpiMcfgInfo': [ 0x10, {
    'mcfg_base': [0x0, ['unsigned long']],
    'mcfg_size': [0x8, ['unsigned int']],
}],
  'RR_MapList': [ 0x30, {
    'ptr': [0x0, ['pointer', ['void']]],
    'addr': [0x8, ['unsigned long']],
    'len': [0x10, ['unsigned long']],
    'crc': [0x18, ['unsigned int']],
    'link': [0x20, ['__unnamed_0x5a38']],
}],
  '__unnamed_0x26e4': [ 0x50, {
    'type': [0x0, ['int']],
    'serial': [0x8, ['unsigned long']],
    'send_event': [0x10, ['int']],
    'display': [0x18, ['pointer', ['_XDisplay']]],
    'owner': [0x20, ['unsigned long']],
    'requestor': [0x28, ['unsigned long']],
    'selection': [0x30, ['unsigned long']],
    'target': [0x38, ['unsigned long']],
    'property': [0x40, ['unsigned long']],
    'time': [0x48, ['unsigned long']],
}],
  'XSaveHi16_ZMM': [ 0x400, {
    'hi16_zmm': [0x0, ['array', 64, ['array', 16, ['unsigned char']]]],
}],
  'FsDriverEntry_head': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['FsDriverListEntry']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['FsDriverListEntry']]]],
}],
  'q_obj_ringbuf_read_arg': [ 0x18, {
    'device': [0x0, ['pointer', ['char']]],
    'size': [0x8, ['long']],
    'has_format': [0x10, ['unsigned char']],
    'format': [0x14, ['Enumeration', {'target': 'int', 'choices': {0: 'DATA_FORMAT_UTF8', 1: 'DATA_FORMAT_BASE64', 2: 'DATA_FORMAT__MAX'}}]],
}],
  'mfi_pd_address': [ 0x18, {
    'device_id': [0x0, ['unsigned short']],
    'encl_device_id': [0x2, ['unsigned short']],
    'encl_index': [0x4, ['unsigned char']],
    'slot_number': [0x5, ['unsigned char']],
    'scsi_dev_type': [0x6, ['unsigned char']],
    'connect_port_bitmap': [0x7, ['unsigned char']],
    'sas_addr': [0x8, ['array', 2, ['unsigned long']]],
}],
  '__unnamed_0x34cb': [ 0x88, {
    'suberror': [0x0, ['unsigned int']],
    'ndata': [0x4, ['unsigned int']],
    'data': [0x8, ['array', 16, ['unsigned long long']]],
}],
  'Qcow2Feature': [ 0x30, {
    'type': [0x0, ['unsigned char']],
    'bit': [0x1, ['unsigned char']],
    'name': [0x2, ['array', 46, ['char']]],
}],
  'q_obj_begin_record_from_arg': [ 0x10, {
    'snapshot': [0x0, ['pointer', ['char']]],
    'file_name': [0x8, ['pointer', ['char']]],
}],
  'E1000EState': [ 0x231a0, {
    'parent_obj': [0x0, ['PCIDevice']],
    'nic': [0x8f0, ['pointer', ['NICState']]],
    'conf': [0x8f8, ['NICConf']],
    'mmio': [0x2910, ['MemoryRegion']],
    'flash': [0x2a10, ['MemoryRegion']],
    'io': [0x2b10, ['MemoryRegion']],
    'msix': [0x2c10, ['MemoryRegion']],
    'ioaddr': [0x2d10, ['unsigned int']],
    'subsys_ven': [0x2d14, ['unsigned short']],
    'subsys': [0x2d16, ['unsigned short']],
    'subsys_ven_used': [0x2d18, ['unsigned short']],
    'subsys_used': [0x2d1a, ['unsigned short']],
    'disable_vnet': [0x2d1c, ['unsigned char']],
    'core': [0x2d20, ['E1000Core']],
}],
  '__unnamed_0x235f': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['VncDisplay']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['VncDisplay']]]],
}],
  '__unnamed_0x2513': [ 0x38, {
    'type': [0x0, ['int']],
    'serial': [0x8, ['unsigned long']],
    'send_event': [0x10, ['int']],
    'display': [0x18, ['pointer', ['_XDisplay']]],
    'event': [0x20, ['unsigned long']],
    'window': [0x28, ['unsigned long']],
    'place': [0x30, ['int']],
}],
  '__unnamed_0x1bd3': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['Chardev']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['Chardev']]]],
}],
  'Notifier': [ 0x18, {
    'notify': [0x0, ['pointer', ['void']]],
    'node': [0x8, ['__unnamed_0x14cd']],
}],
  'PciMemoryRegion': [ 0x28, {
    'bar': [0x0, ['long']],
    'type': [0x8, ['pointer', ['char']]],
    'address': [0x10, ['long']],
    'size': [0x18, ['long']],
    'has_prefetch': [0x20, ['unsigned char']],
    'prefetch': [0x21, ['unsigned char']],
    'has_mem_type_64': [0x22, ['unsigned char']],
    'mem_type_64': [0x23, ['unsigned char']],
}],
  'Acpi20Tcpa': [ 0x32, {
    'signature': [0x0, ['unsigned int']],
    'length': [0x4, ['unsigned int']],
    'revision': [0x8, ['unsigned char']],
    'checksum': [0x9, ['unsigned char']],
    'oem_id': [0xa, ['array', 6, ['unsigned char']]],
    'oem_table_id': [0x10, ['array', 8, ['unsigned char']]],
    'oem_revision': [0x18, ['unsigned int']],
    'asl_compiler_id': [0x1c, ['array', 4, ['unsigned char']]],
    'asl_compiler_revision': [0x20, ['unsigned int']],
    'platform_class': [0x24, ['unsigned short']],
    'log_area_minimum_length': [0x26, ['unsigned int']],
    'log_area_start_address': [0x2a, ['unsigned long']],
}],
  'kvm_irq_routing_s390_adapter': [ 0x20, {
    'ind_addr': [0x0, ['unsigned long long']],
    'summary_addr': [0x8, ['unsigned long long']],
    'ind_offset': [0x10, ['unsigned long long']],
    'summary_offset': [0x18, ['unsigned int']],
    'adapter_id': [0x1c, ['unsigned int']],
}],
  'IPMISel': [ 0x820, {
    'sel': [0x0, ['array', 16, ['array', 128, ['unsigned char']]]],
    'next_free': [0x800, ['unsigned int']],
    'time_offset': [0x808, ['long']],
    'reservation': [0x810, ['unsigned short']],
    'last_addition': [0x812, ['array', 4, ['unsigned char']]],
    'last_clear': [0x816, ['array', 4, ['unsigned char']]],
    'overflow': [0x81a, ['unsigned char']],
}],
  'PCIHostState': [ 0x620, {
    'busdev': [0x0, ['SysBusDevice']],
    'conf_mem': [0x300, ['MemoryRegion']],
    'data_mem': [0x400, ['MemoryRegion']],
    'mmcfg': [0x500, ['MemoryRegion']],
    'config_reg': [0x600, ['unsigned int']],
    'bus': [0x608, ['pointer', ['PCIBus']]],
    'next': [0x610, ['Enumeration', {'target': 'int', 'choices': {0: 'IOMMU_NOTIFIER_NONE', 1: 'IOMMU_NOTIFIER_UNMAP', 2: 'IOMMU_NOTIFIER_MAP'}}]],
}],
  'q_obj_x_blockdev_insert_medium_arg': [ 0x28, {
    'has_device': [0x0, ['unsigned char']],
    'device': [0x8, ['pointer', ['char']]],
    'has_id': [0x10, ['unsigned char']],
    'id': [0x18, ['pointer', ['char']]],
    'node_name': [0x20, ['pointer', ['char']]],
}],
  'ilist_nextprev_traits<llvm::Instruction': [ 0x1, {
}],
  'q_obj_client_migrate_info_arg': [ 0x40, {
    'protocol': [0x0, ['pointer', ['char']]],
    'hostname': [0x8, ['pointer', ['char']]],
    'has_port': [0x10, ['unsigned char']],
    'port': [0x18, ['long']],
    'has_tls_port': [0x20, ['unsigned char']],
    'tls_port': [0x28, ['long']],
    'has_cert_subject': [0x30, ['unsigned char']],
    'cert_subject': [0x38, ['pointer', ['char']]],
}],
  '__unnamed_0x1959': [ 0x60, {
    'type': [0x0, ['int']],
    'serial': [0x8, ['unsigned long']],
    'send_event': [0x10, ['int']],
    'display': [0x18, ['pointer', ['_XDisplay']]],
    'window': [0x20, ['unsigned long']],
    'root': [0x28, ['unsigned long']],
    'subwindow': [0x30, ['unsigned long']],
    'time': [0x38, ['unsigned long']],
    'x': [0x40, ['int']],
    'y': [0x44, ['int']],
    'x_root': [0x48, ['int']],
    'y_root': [0x4c, ['int']],
    'state': [0x50, ['unsigned int']],
    'keycode': [0x54, ['unsigned int']],
    'same_screen': [0x58, ['int']],
}],
  'BDRVVmdkState': [ 0x50, {
    'lock': [0x0, ['CoMutex']],
    'desc_offset': [0x20, ['unsigned long']],
    'cid_updated': [0x28, ['unsigned char']],
    'cid_checked': [0x29, ['unsigned char']],
    'cid': [0x2c, ['unsigned int']],
    'parent_cid': [0x30, ['unsigned int']],
    'num_extents': [0x34, ['int']],
    'extents': [0x38, ['pointer', ['VmdkExtent']]],
    'migration_blocker': [0x40, ['pointer', ['Error']]],
    'create_type': [0x48, ['pointer', ['char']]],
}],
  'DriveMirror': [ 0x98, {
    'has_job_id': [0x0, ['unsigned char']],
    'job_id': [0x8, ['pointer', ['char']]],
    'device': [0x10, ['pointer', ['char']]],
    'target': [0x18, ['pointer', ['char']]],
    'has_format': [0x20, ['unsigned char']],
    'format': [0x28, ['pointer', ['char']]],
    'has_node_name': [0x30, ['unsigned char']],
    'node_name': [0x38, ['pointer', ['char']]],
    'has_replaces': [0x40, ['unsigned char']],
    'replaces': [0x48, ['pointer', ['char']]],
    'sync': [0x50, ['Enumeration', {'target': 'int', 'choices': {0: 'MIRROR_SYNC_MODE_TOP', 1: 'MIRROR_SYNC_MODE_FULL', 2: 'MIRROR_SYNC_MODE_NONE', 3: 'MIRROR_SYNC_MODE_INCREMENTAL', 4: 'MIRROR_SYNC_MODE__MAX'}}]],
    'has_mode': [0x54, ['unsigned char']],
    'mode': [0x58, ['Enumeration', {'target': 'int', 'choices': {0: 'NEW_IMAGE_MODE_EXISTING', 1: 'NEW_IMAGE_MODE_ABSOLUTE_PATHS', 2: 'NEW_IMAGE_MODE__MAX'}}]],
    'has_speed': [0x5c, ['unsigned char']],
    'speed': [0x60, ['long']],
    'has_granularity': [0x68, ['unsigned char']],
    'granularity': [0x6c, ['unsigned int']],
    'has_buf_size': [0x70, ['unsigned char']],
    'buf_size': [0x78, ['long']],
    'has_on_source_error': [0x80, ['unsigned char']],
    'on_source_error': [0x84, ['Enumeration', {'target': 'int', 'choices': {0: 'BLOCKDEV_ON_ERROR_REPORT', 1: 'BLOCKDEV_ON_ERROR_IGNORE', 2: 'BLOCKDEV_ON_ERROR_ENOSPC', 3: 'BLOCKDEV_ON_ERROR_STOP', 4: 'BLOCKDEV_ON_ERROR_AUTO', 5: 'BLOCKDEV_ON_ERROR__MAX'}}]],
    'has_on_target_error': [0x88, ['unsigned char']],
    'on_target_error': [0x8c, ['Enumeration', {'target': 'int', 'choices': {0: 'BLOCKDEV_ON_ERROR_REPORT', 1: 'BLOCKDEV_ON_ERROR_IGNORE', 2: 'BLOCKDEV_ON_ERROR_ENOSPC', 3: 'BLOCKDEV_ON_ERROR_STOP', 4: 'BLOCKDEV_ON_ERROR_AUTO', 5: 'BLOCKDEV_ON_ERROR__MAX'}}]],
    'has_unmap': [0x90, ['unsigned char']],
    'unmap': [0x91, ['unsigned char']],
}],
  'q_obj_BLOCK_JOB_READY_arg': [ 0x28, {
    'type': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'BLOCK_JOB_TYPE_COMMIT', 1: 'BLOCK_JOB_TYPE_STREAM', 2: 'BLOCK_JOB_TYPE_MIRROR', 3: 'BLOCK_JOB_TYPE_BACKUP', 4: 'BLOCK_JOB_TYPE__MAX'}}]],
    'device': [0x8, ['pointer', ['char']]],
    'len': [0x10, ['long']],
    'offset': [0x18, ['long']],
    'speed': [0x20, ['long']],
}],
  'conditional<false, const std::pair<unsigned int, llvm::PointerAlignElem': [ 0x1, {
}],
  '__unnamed_0x2332': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['VncState']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['VncState']]]],
}],
  'QIOChannelYieldData': [ 0x10, {
    'ioc': [0x0, ['pointer', ['QIOChannel']]],
    'co': [0x8, ['pointer', ['Coroutine']]],
}],
  'TCGOpDef': [ 0x20, {
    'name': [0x0, ['pointer', ['char']]],
    'nb_oargs': [0x8, ['unsigned char']],
    'nb_iargs': [0x9, ['unsigned char']],
    'nb_cargs': [0xa, ['unsigned char']],
    'nb_args': [0xb, ['unsigned char']],
    'flags': [0xc, ['unsigned char']],
    'args_ct': [0x10, ['pointer', ['TCGArgConstraint']]],
    'sorted_args': [0x18, ['pointer', ['int']]],
}],
  '__unnamed_0xb360': [ 0x8, {
    'passthrough': [0x0, ['q_obj_TPMPassthroughOptions_wrapper']],
}],
  'des_ctx': [ 0x80, {
    'key': [0x0, ['array', 32, ['unsigned int']]],
}],
  'key_range': [ 0x10, {
    'start': [0x0, ['int']],
    'end': [0x4, ['int']],
    'next': [0x8, ['pointer', ['key_range']]],
}],
  'SchemaInfoEvent': [ 0x8, {
    'arg_type': [0x0, ['pointer', ['char']]],
}],
  '__unnamed_0x6987': [ 0x18, {
    'sg64': [0x0, ['array', 2, ['mfi_sg64']]],
    'sg32': [0x0, ['array', 2, ['mfi_sg32']]],
}],
  'kvm_sregs': [ 0x138, {
    'cs': [0x0, ['kvm_segment']],
    'ds': [0x18, ['kvm_segment']],
    'es': [0x30, ['kvm_segment']],
    'fs': [0x48, ['kvm_segment']],
    'gs': [0x60, ['kvm_segment']],
    'ss': [0x78, ['kvm_segment']],
    'tr': [0x90, ['kvm_segment']],
    'ldt': [0xa8, ['kvm_segment']],
    'gdt': [0xc0, ['kvm_dtable']],
    'idt': [0xd0, ['kvm_dtable']],
    'cr0': [0xe0, ['unsigned long long']],
    'cr2': [0xe8, ['unsigned long long']],
    'cr3': [0xf0, ['unsigned long long']],
    'cr4': [0xf8, ['unsigned long long']],
    'cr8': [0x100, ['unsigned long long']],
    'efer': [0x108, ['unsigned long long']],
    'apic_base': [0x110, ['unsigned long long']],
    'interrupt_bitmap': [0x118, ['array', 4, ['unsigned long long']]],
}],
  '__unnamed_0x2354': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['xs_dirs']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['xs_dirs']]]],
}],
  'bt_l2cap_sdp_state_s': [ 0x18, {
    'channel': [0x0, ['pointer', ['bt_l2cap_conn_params_s']]],
    'service_list': [0x8, ['pointer', ['sdp_service_record_s']]],
    'services': [0x10, ['int']],
}],
  'PVSCSISGElement': [ 0x10, {
    'addr': [0x0, ['unsigned long']],
    'length': [0x8, ['unsigned int']],
    'flags': [0xc, ['unsigned int']],
}],
  'VncJobQueue': [ 0x78, {
    'cond': [0x0, ['QemuCond']],
    'mutex': [0x30, ['QemuMutex']],
    'thread': [0x58, ['QemuThread']],
    'exit': [0x60, ['unsigned char']],
    'jobs': [0x68, ['__unnamed_0x2660']],
}],
  'MirrorOp': [ 0x30, {
    's': [0x0, ['pointer', ['MirrorBlockJob']]],
    'qiov': [0x8, ['QEMUIOVector']],
    'sector_num': [0x20, ['long']],
    'nb_sectors': [0x28, ['int']],
}],
  'q_obj_ChardevSpicePort_wrapper': [ 0x8, {
    'data': [0x0, ['pointer', ['ChardevSpicePort']]],
}],
  'QuorumVotes': [ 0x10, {
    'vote_list': [0x0, ['__unnamed_0x345a']],
    'compare': [0x8, ['pointer', ['void']]],
}],
  'input_event': [ 0x18, {
    'time': [0x0, ['timeval']],
    'type': [0x10, ['unsigned short']],
    'code': [0x12, ['unsigned short']],
    'value': [0x14, ['int']],
}],
  'V9fsQID': [ 0x10, {
    'type': [0x0, ['signed char']],
    'version': [0x4, ['int']],
    'path': [0x8, ['long']],
}],
  'AcpiSystemResourceAffinityTable': [ 0x30, {
    'signature': [0x0, ['unsigned int']],
    'length': [0x4, ['unsigned int']],
    'revision': [0x8, ['unsigned char']],
    'checksum': [0x9, ['unsigned char']],
    'oem_id': [0xa, ['array', 6, ['unsigned char']]],
    'oem_table_id': [0x10, ['array', 8, ['unsigned char']]],
    'oem_revision': [0x18, ['unsigned int']],
    'asl_compiler_id': [0x1c, ['array', 4, ['unsigned char']]],
    'asl_compiler_revision': [0x20, ['unsigned int']],
    'reserved1': [0x24, ['unsigned int']],
    'reserved2': [0x28, ['array', 2, ['unsigned int']]],
}],
  'QEMUSoundCard': [ 0x18, {
    'name': [0x0, ['pointer', ['char']]],
    'entries': [0x8, ['Enumeration', {'target': 'int', 'choices': {0: 'MIG_PRI_DEFAULT', 1: 'MIG_PRI_IOMMU', 2: 'MIG_PRI_MAX'}}]],
}],
  '_Base_bitset<1ul': [ 0x8, {
    '_M_w': [0x0, ['unsigned long']],
}],
  '__unnamed_0x3200': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['BlkdebugRule']]],
}],
  'usbredirfilter_rule': [ 0x14, {
    'device_class': [0x0, ['int']],
    'vendor_id': [0x4, ['int']],
    'product_id': [0x8, ['int']],
    'device_version_bcd': [0xc, ['int']],
    'allow': [0x10, ['int']],
}],
  'iterator<std::bidirectional_iterator_tag, llvm::NamedMDNode, long int, llvm::NamedMDNode*, llvm::NamedMDNode&': [ 0x1, {
}],
  'sg_io_hdr': [ 0x58, {
    'interface_id': [0x0, ['int']],
    'dxfer_direction': [0x4, ['int']],
    'cmd_len': [0x8, ['unsigned char']],
    'mx_sb_len': [0x9, ['unsigned char']],
    'iovec_count': [0xa, ['unsigned short']],
    'dxfer_len': [0xc, ['unsigned int']],
    'dxferp': [0x10, ['pointer', ['void']]],
    'cmdp': [0x18, ['pointer', ['unsigned char']]],
    'sbp': [0x20, ['pointer', ['unsigned char']]],
    'timeout': [0x28, ['unsigned int']],
    'flags': [0x2c, ['unsigned int']],
    'pack_id': [0x30, ['int']],
    'usr_ptr': [0x38, ['pointer', ['void']]],
    'status': [0x40, ['unsigned char']],
    'masked_status': [0x41, ['unsigned char']],
    'msg_status': [0x42, ['unsigned char']],
    'sb_len_wr': [0x43, ['unsigned char']],
    'host_status': [0x44, ['unsigned short']],
    'driver_status': [0x46, ['unsigned short']],
    'resid': [0x48, ['int']],
    'duration': [0x4c, ['unsigned int']],
    'info': [0x50, ['unsigned int']],
}],
  'ip': [ 0x14, {
    'ip_v': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 4}]],
    'ip_hl': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 0}]],
    'ip_tos': [0x1, ['unsigned char']],
    'ip_len': [0x2, ['unsigned short']],
    'ip_id': [0x4, ['unsigned short']],
    'ip_off': [0x6, ['unsigned short']],
    'ip_ttl': [0x8, ['unsigned char']],
    'ip_p': [0x9, ['unsigned char']],
    'ip_sum': [0xa, ['unsigned short']],
    'ip_src': [0xc, ['in_addr']],
    'ip_dst': [0x10, ['in_addr']],
}],
  'sockaddr_in': [ 0x10, {
    'sin_family': [0x0, ['unsigned short']],
    'sin_port': [0x2, ['unsigned short']],
    'sin_addr': [0x4, ['in_addr']],
    'sin_zero': [0x8, ['array', 8, ['unsigned char']]],
}],
  'PVSCSICmdDescAbortCmd': [ 0x10, {
    'context': [0x0, ['unsigned long']],
    'target': [0x8, ['unsigned int']],
    'pad': [0xc, ['unsigned int']],
}],
  '__unnamed_0x11b0': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['USBPacket']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['USBPacket']]]],
}],
  'SDL_MouseMotionEvent': [ 0xc, {
    'type': [0x0, ['unsigned char']],
    'which': [0x1, ['unsigned char']],
    'state': [0x2, ['unsigned char']],
    'x': [0x4, ['unsigned short']],
    'y': [0x6, ['unsigned short']],
    'xrel': [0x8, ['short']],
    'yrel': [0xa, ['short']],
}],
  '__unnamed_0x1d37': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['IOMMUNotifier']]],
}],
  '__unnamed_0x3554': [ 0x14, {
    'subchannel_id': [0x0, ['unsigned short']],
    'subchannel_nr': [0x2, ['unsigned short']],
    'io_int_parm': [0x4, ['unsigned int']],
    'io_int_word': [0x8, ['unsigned int']],
    'ipb': [0xc, ['unsigned int']],
    'dequeued': [0x10, ['unsigned char']],
}],
  'smbios_field': [ 0x6, {
    'header': [0x0, ['smbios_header']],
    'type': [0x3, ['unsigned char']],
    'offset': [0x4, ['unsigned short']],
    'data': [0x6, ['array', 0, ['unsigned char']]],
}],
  'qht_map': [ 0x30, {
    'rcu': [0x0, ['rcu_head']],
    'buckets': [0x10, ['pointer', ['qht_bucket']]],
    'n_buckets': [0x18, ['unsigned long']],
    'n_added_buckets': [0x20, ['unsigned long']],
    'n_added_buckets_threshold': [0x28, ['unsigned long']],
}],
  'VHDXPage83Data': [ 0x10, {
    'page_83_data': [0x0, ['MSGUID']],
}],
  'ProtobufCIntRange': [ 0x8, {
    'start_value': [0x0, ['int']],
    'orig_index': [0x4, ['unsigned int']],
}],
  'ilist_node_traits<llvm::Instruction': [ 0x1, {
}],
  '__alloc_traits<std::allocator<std::pair<const llvm::Function* const, long int': [ 0x1, {
}],
  'TPMPassthroughOptions': [ 0x20, {
    'has_path': [0x0, ['unsigned char']],
    'path': [0x8, ['pointer', ['char']]],
    'has_cancel_path': [0x10, ['unsigned char']],
    'cancel_path': [0x18, ['pointer', ['char']]],
}],
  'sha256_ctx': [ 0x70, {
    'state': [0x0, ['array', 8, ['unsigned int']]],
    'count': [0x20, ['unsigned long']],
    'block': [0x28, ['array', 64, ['unsigned char']]],
    'index': [0x68, ['unsigned int']],
}],
  'VTDIrq': [ 0xc, {
    'trigger_mode': [0x0, ['unsigned char']],
    'vector': [0x1, ['unsigned char']],
    'delivery_mode': [0x2, ['unsigned char']],
    'dest': [0x4, ['unsigned int']],
    'dest_mode': [0x8, ['unsigned char']],
    'redir_hint': [0x9, ['unsigned char']],
    'msi_addr_last_bits': [0xa, ['unsigned char']],
}],
  '__unnamed_0x1d38': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['BusState']]],
}],
  'QDict': [ 0x1018, {
    'base': [0x0, ['QObject']],
    'size': [0x10, ['unsigned long']],
    'table': [0x18, ['array', 512, ['__unnamed_0x87c']]],
}],
  'bochs_header': [ 0x200, {
    'magic': [0x0, ['array', 32, ['char']]],
    'type': [0x20, ['array', 16, ['char']]],
    'subtype': [0x30, ['array', 16, ['char']]],
    'version': [0x40, ['unsigned int']],
    'header': [0x44, ['unsigned int']],
    'catalog': [0x48, ['unsigned int']],
    'bitmap': [0x4c, ['unsigned int']],
    'extent': [0x50, ['unsigned int']],
    'extra': [0x54, ['Enumeration', {'target': 'int', 'choices': {67371008: 'PIXMAN_c4', 134545408: 'PIXMAN_g8', 537004714: 'PIXMAN_x2r10g10b10', 537495688: 'PIXMAN_r8g8b8a8', 67190784: 'PIXMAN_a4', 268567909: 'PIXMAN_r5g6b5', 402851976: 'PIXMAN_b8g8r8', 537462920: 'PIXMAN_r8g8b8x8', 17104896: 'PIXMAN_g1', 67244305: 'PIXMAN_a1r1g1b1', 537069704: 'PIXMAN_x8b8g8r8', 268633156: 'PIXMAN_x4b4g4r4', 134479872: 'PIXMAN_c8', 268649540: 'PIXMAN_a4b4g4r4', 67240225: 'PIXMAN_r1g2b1', 134357538: 'PIXMAN_a2r2g2b2', 537397384: 'PIXMAN_b8g8r8x8', 268571989: 'PIXMAN_a1r5g5b5', 268828672: 'PIXMAN_yuy2', 537078442: 'PIXMAN_a2b10g10r10', 537561224: 'PIXMAN_a8r8g8b8_sRGB', 134415154: 'PIXMAN_b2g3r3', 402786440: 'PIXMAN_r8g8b8', 134349618: 'PIXMAN_r3g3b2', 537430152: 'PIXMAN_b8g8r8a8', 537004168: 'PIXMAN_x8r8g8b8', 268567893: 'PIXMAN_x1r5g5b5', 268567620: 'PIXMAN_x4r4g4b4', 537036936: 'PIXMAN_a8r8g8b8', 67305761: 'PIXMAN_b1g2r1', 134423074: 'PIXMAN_a2b2g2r2', 537102472: 'PIXMAN_a8b8g8r8', 268633429: 'PIXMAN_x1b5g5r5', 67436544: 'PIXMAN_g4', 16846848: 'PIXMAN_a1', 268633445: 'PIXMAN_b5g6r5', 537003622: 'PIXMAN_x14r6g6b6', 67309841: 'PIXMAN_a1b1g1r1', 201785344: 'PIXMAN_yv12', 537012906: 'PIXMAN_a2r10g10b10', 134299648: 'PIXMAN_x4a4', 268584004: 'PIXMAN_a4r4g4b4', 134316032: 'PIXMAN_a8', 537070250: 'PIXMAN_x2b10g10r10', 268637525: 'PIXMAN_a1b5g5r5'}}]],
}],
  'ripemd160_ctx': [ 0x68, {
    'state': [0x0, ['array', 5, ['unsigned int']]],
    'count': [0x18, ['unsigned long']],
    'block': [0x20, ['array', 64, ['unsigned char']]],
    'index': [0x60, ['unsigned int']],
}],
  'AlignedCharArray<8ul, 8ul': [ 0x8, {
    'buffer': [0x0, ['array', 8, ['char']]],
}],
  'BlockdevSnapshotInternal': [ 0x10, {
    'device': [0x0, ['pointer', ['char']]],
    'name': [0x8, ['pointer', ['char']]],
}],
  'IntelIOMMUState': [ 0x1560, {
    'x86_iommu': [0x0, ['X86IOMMUState']],
    'csrmem': [0x310, ['MemoryRegion']],
    'csr': [0x410, ['array', 560, ['unsigned char']]],
    'wmask': [0x640, ['array', 560, ['unsigned char']]],
    'w1cmask': [0x870, ['array', 560, ['unsigned char']]],
    'womask': [0xaa0, ['array', 560, ['unsigned char']]],
    'version': [0xcd0, ['unsigned int']],
    'root': [0xcd8, ['unsigned long']],
    'root_extended': [0xce0, ['unsigned char']],
    'dmar_enabled': [0xce1, ['unsigned char']],
    'iq_head': [0xce2, ['unsigned short']],
    'iq_tail': [0xce4, ['unsigned short']],
    'iq': [0xce8, ['unsigned long']],
    'iq_size': [0xcf0, ['unsigned short']],
    'qi_enabled': [0xcf2, ['unsigned char']],
    'iq_last_desc_type': [0xcf3, ['unsigned char']],
    'next_frcd_reg': [0xcf4, ['unsigned short']],
    'cap': [0xcf8, ['unsigned long']],
    'ecap': [0xd00, ['unsigned long']],
    'context_cache_gen': [0xd08, ['unsigned int']],
    'iotlb': [0xd10, ['pointer', ['_GHashTable']]],
    'iommu_ops': [0xd18, ['MemoryRegionIOMMUOps']],
    'vtd_as_by_busptr': [0xd30, ['pointer', ['_GHashTable']]],
    'vtd_as_by_bus_num': [0xd38, ['array', 256, ['pointer', ['VTDBus']]]],
    'intr_enabled': [0x1538, ['unsigned char']],
    'intr_root': [0x1540, ['unsigned long']],
    'intr_size': [0x1548, ['unsigned int']],
    'intr_eime': [0x154c, ['unsigned char']],
    'intr_eim': [0x1550, ['Enumeration', {'target': 'int', 'choices': {0: 'ON_OFF_AUTO_AUTO', 1: 'ON_OFF_AUTO_ON', 2: 'ON_OFF_AUTO_OFF', 3: 'ON_OFF_AUTO__MAX'}}]],
    'buggy_eim': [0x1554, ['unsigned char']],
}],
  '_IO_marker': [ 0x18, {
    '_next': [0x0, ['pointer', ['_IO_marker']]],
    '_sbuf': [0x8, ['pointer', ['_IO_FILE']]],
    '_pos': [0x10, ['int']],
}],
  'mfi_init_frame': [ 0x40, {
    'header': [0x0, ['mfi_frame_header']],
    'qinfo_new_addr_lo': [0x18, ['unsigned int']],
    'qinfo_new_addr_hi': [0x1c, ['unsigned int']],
    'qinfo_old_addr_lo': [0x20, ['unsigned int']],
    'qinfo_old_addr_hi': [0x24, ['unsigned int']],
    'reserved': [0x28, ['array', 6, ['unsigned int']]],
}],
  'HostMemoryBackendClass': [ 0x68, {
    'parent_class': [0x0, ['ObjectClass']],
    'alloc': [0x60, ['pointer', ['void']]],
}],
  'IDEBus': [ 0x8e0, {
    'qbus': [0x0, ['BusState']],
    'master': [0x68, ['pointer', ['IDEDevice']]],
    'slave': [0x70, ['pointer', ['IDEDevice']]],
    'ifs': [0x78, ['array', 2, ['IDEState']]],
    'bh': [0x818, ['pointer', ['QEMUBH']]],
    'bus_id': [0x820, ['int']],
    'max_units': [0x824, ['int']],
    'dma': [0x828, ['pointer', ['IDEDMA']]],
    'unit': [0x830, ['unsigned char']],
    'cmd': [0x831, ['unsigned char']],
    'irq': [0x838, ['pointer', ['IRQState']]],
    'error_status': [0x840, ['int']],
    'retry_unit': [0x844, ['unsigned char']],
    'retry_sector_num': [0x848, ['long']],
    'retry_nsector': [0x850, ['unsigned int']],
    'portio_list': [0x858, ['PortioList']],
    'portio2_list': [0x898, ['PortioList']],
    'vmstate': [0x8d8, ['pointer', ['vm_change_state_entry']]],
}],
  'RegisterPass<llvm::PandaCallMorphFunctionPass': [ 0x40, {
}],
  'kvm_clock_data': [ 0x30, {
    'clock': [0x0, ['unsigned long long']],
    'flags': [0x8, ['unsigned int']],
    'pad': [0xc, ['array', 9, ['unsigned int']]],
}],
  'QIOChannelFDPairSource': [ 0x80, {
    'parent': [0x0, ['_GSource']],
    'fdread': [0x60, ['_GPollFD']],
    'fdwrite': [0x68, ['_GPollFD']],
    'ioc': [0x70, ['pointer', ['QIOChannel']]],
    'condition': [0x78, ['Enumeration', {'target': 'int', 'choices': {32: 'G_IO_NVAL', 1: 'G_IO_IN', 2: 'G_IO_PRI', 4: 'G_IO_OUT', 8: 'G_IO_ERR', 16: 'G_IO_HUP'}}]],
}],
  'QEMUResetEntry': [ 0x20, {
    'entry': [0x0, ['__unnamed_0x64b']],
    'func': [0x10, ['pointer', ['void']]],
    'opaque': [0x18, ['pointer', ['void']]],
}],
  '__unnamed_0x1d3e': [ 0x48, {
    'type': [0x0, ['int']],
    'serial': [0x8, ['unsigned long']],
    'send_event': [0x10, ['int']],
    'display': [0x18, ['pointer', ['_XDisplay']]],
    'window': [0x20, ['unsigned long']],
    'key_vector': [0x28, ['array', 32, ['char']]],
}],
  '__unnamed_0x4cbc': [ 0x10, {
    'le_next': [0x0, ['pointer', ['vm_change_state_entry']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['vm_change_state_entry']]]],
}],
  'ImageInfoSpecificVmdk': [ 0x20, {
    'create_type': [0x0, ['pointer', ['char']]],
    'cid': [0x8, ['long']],
    'parent_cid': [0x10, ['long']],
    'extents': [0x18, ['pointer', ['ImageInfoList']]],
}],
  'fp_port': [ 0x2050, {
    'r': [0x0, ['pointer', ['rocker']]],
    'world': [0x8, ['pointer', ['world']]],
    'index': [0x10, ['unsigned int']],
    'name': [0x18, ['pointer', ['char']]],
    'pport': [0x20, ['unsigned int']],
    'enabled': [0x24, ['unsigned char']],
    'speed': [0x28, ['unsigned int']],
    'duplex': [0x2c, ['unsigned char']],
    'autoneg': [0x2d, ['unsigned char']],
    'learning': [0x2e, ['unsigned char']],
    'nic': [0x30, ['pointer', ['NICState']]],
    'conf': [0x38, ['NICConf']],
}],
  'ISAKBDState': [ 0x2c0, {
    'parent_obj': [0x0, ['ISADevice']],
    'kbd': [0x80, ['KBDState']],
    'io': [0xc0, ['array', 2, ['MemoryRegion']]],
}],
  'QXLText': [ 0x44, {
    'str': [0x0, ['unsigned long']],
    'back_area': [0x8, ['QXLRect']],
    'fore_brush': [0x18, ['QXLBrush']],
    'back_brush': [0x2c, ['QXLBrush']],
    'fore_mode': [0x40, ['unsigned short']],
    'back_mode': [0x42, ['unsigned short']],
}],
  'PCIESlot': [ 0x1440, {
    'parent_obj': [0x0, ['PCIEPort']],
    'chassis': [0x1420, ['unsigned char']],
    'slot': [0x1422, ['unsigned short']],
    'next': [0x1428, ['__unnamed_0x29bc']],
}],
  'bt_link_s': [ 0x18, {
    'slave': [0x0, ['pointer', ['bt_device_s']]],
    'host': [0x8, ['pointer', ['bt_device_s']]],
    'handle': [0x10, ['unsigned short']],
    'acl_interval': [0x12, ['unsigned short']],
    'acl_mode': [0x14, ['Enumeration', {'target': 'int', 'choices': {0: 'acl_active', 1: 'acl_hold', 2: 'acl_sniff', 3: 'acl_parked'}}]],
}],
  'audio_driver': [ 0x48, {
    'name': [0x0, ['pointer', ['char']]],
    'descr': [0x8, ['pointer', ['char']]],
    'options': [0x10, ['pointer', ['audio_option']]],
    'init': [0x18, ['pointer', ['void']]],
    'fini': [0x20, ['pointer', ['void']]],
    'pcm_ops': [0x28, ['pointer', ['audio_pcm_ops']]],
    'can_be_default': [0x30, ['int']],
    'max_voices_out': [0x34, ['int']],
    'max_voices_in': [0x38, ['int']],
    'voice_size_out': [0x3c, ['int']],
    'voice_size_in': [0x40, ['int']],
    'ctl_caps': [0x44, ['int']],
}],
  '_GError': [ 0x10, {
    'domain': [0x0, ['unsigned int']],
    'code': [0x4, ['int']],
    'message': [0x8, ['pointer', ['char']]],
}],
  'q_obj_object_add_arg': [ 0x20, {
    'qom_type': [0x0, ['pointer', ['char']]],
    'id': [0x8, ['pointer', ['char']]],
    'has_props': [0x10, ['unsigned char']],
    'props': [0x18, ['pointer', ['QObject']]],
}],
  'V9fsDir': [ 0x30, {
    'stream': [0x0, ['pointer', ['__dirstream']]],
    'readdir_mutex': [0x8, ['QemuMutex']],
}],
  'QOMCompositionState': [ 0x10, {
    'mon': [0x0, ['pointer', ['Monitor']]],
    'indent': [0x8, ['int']],
}],
  'TPMDriverOps': [ 0x78, {
    'type': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'TPM_TYPE_PASSTHROUGH', 1: 'TPM_TYPE__MAX'}}]],
    'opts': [0x8, ['pointer', ['QemuOptDesc']]],
    'desc': [0x10, ['pointer', ['void']]],
    'create': [0x18, ['pointer', ['void']]],
    'destroy': [0x20, ['pointer', ['void']]],
    'init': [0x28, ['pointer', ['void']]],
    'startup_tpm': [0x30, ['pointer', ['void']]],
    'had_startup_error': [0x38, ['pointer', ['void']]],
    'realloc_buffer': [0x40, ['pointer', ['void']]],
    'deliver_request': [0x48, ['pointer', ['void']]],
    'reset': [0x50, ['pointer', ['void']]],
    'cancel_cmd': [0x58, ['pointer', ['void']]],
    'get_tpm_established_flag': [0x60, ['pointer', ['void']]],
    'reset_tpm_established_flag': [0x68, ['pointer', ['void']]],
    'get_tpm_version': [0x70, ['pointer', ['void']]],
}],
  '__unnamed_0x7873': [ 0x10, {
    'ld': [0x0, ['mfi_ld_ref']],
    'state': [0x4, ['unsigned char']],
    'reserved2': [0x5, ['array', 3, ['unsigned char']]],
    'size': [0x8, ['unsigned long']],
}],
  'NICInfo': [ 0x38, {
    'macaddr': [0x0, ['MACAddr']],
    'model': [0x8, ['pointer', ['char']]],
    'name': [0x10, ['pointer', ['char']]],
    'devaddr': [0x18, ['pointer', ['char']]],
    'netdev': [0x20, ['pointer', ['NetClientState']]],
    'used': [0x28, ['int']],
    'instantiated': [0x2c, ['int']],
    'nvectors': [0x30, ['int']],
}],
  'QCryptoBlockLUKSCipherNameMap': [ 0x10, {
    'name': [0x0, ['pointer', ['char']]],
    'sizes': [0x8, ['pointer', ['QCryptoBlockLUKSCipherSizeMap']]],
}],
  'q_obj_RTC_CHANGE_arg': [ 0x8, {
    'offset': [0x0, ['long']],
}],
  'FWBootEntry': [ 0x28, {
    'link': [0x0, ['__unnamed_0xd6d']],
    'bootindex': [0x10, ['int']],
    'dev': [0x18, ['pointer', ['DeviceState']]],
    'suffix': [0x20, ['pointer', ['char']]],
}],
  'CCID_T0ProtocolDataStructure': [ 0x5, {
    'bmFindexDindex': [0x0, ['unsigned char']],
    'bmTCCKST0': [0x1, ['unsigned char']],
    'bGuardTimeT0': [0x2, ['unsigned char']],
    'bWaitingIntegerT0': [0x3, ['unsigned char']],
    'bClockStop': [0x4, ['unsigned char']],
}],
  'QCowL2Meta': [ 0x60, {
    'offset': [0x0, ['unsigned long']],
    'alloc_offset': [0x8, ['unsigned long']],
    'nb_clusters': [0x10, ['int']],
    'dependent_requests': [0x18, ['CoQueue']],
    'cow_start': [0x28, ['Qcow2COWRegion']],
    'cow_end': [0x38, ['Qcow2COWRegion']],
    'next': [0x48, ['pointer', ['QCowL2Meta']]],
    'next_in_flight': [0x50, ['__unnamed_0x3dba']],
}],
  '__unnamed_0x1fff': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['BusChild']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['BusChild']]]],
}],
  'q_obj_block_job_resume_arg': [ 0x8, {
    'device': [0x0, ['pointer', ['char']]],
}],
  '__unnamed_0x3952': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['NBDClient']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['NBDClient']]]],
}],
  'MACAddr': [ 0x6, {
    'a': [0x0, ['array', 6, ['unsigned char']]],
}],
  'ReadLineState': [ 0x2b60, {
    'cmd_buf': [0x0, ['array', 4096, ['char']]],
    'cmd_buf_index': [0x1000, ['int']],
    'cmd_buf_size': [0x1004, ['int']],
    'last_cmd_buf': [0x1008, ['array', 4096, ['char']]],
    'last_cmd_buf_index': [0x2008, ['int']],
    'last_cmd_buf_size': [0x200c, ['int']],
    'esc_state': [0x2010, ['int']],
    'esc_param': [0x2014, ['int']],
    'history': [0x2018, ['array', 64, ['pointer', ['char']]]],
    'hist_entry': [0x2218, ['int']],
    'completion_finder': [0x2220, ['pointer', ['void']]],
    'completions': [0x2228, ['array', 256, ['pointer', ['char']]]],
    'nb_completions': [0x2a28, ['int']],
    'completion_index': [0x2a2c, ['int']],
    'readline_func': [0x2a30, ['pointer', ['void']]],
    'readline_opaque': [0x2a38, ['pointer', ['void']]],
    'read_password': [0x2a40, ['int']],
    'prompt': [0x2a44, ['array', 256, ['char']]],
    'printf_func': [0x2b48, ['pointer', ['void']]],
    'flush_func': [0x2b50, ['pointer', ['void']]],
    'opaque': [0x2b58, ['pointer', ['void']]],
}],
  'elf32_shdr': [ 0x28, {
    'sh_name': [0x0, ['unsigned int']],
    'sh_type': [0x4, ['unsigned int']],
    'sh_flags': [0x8, ['unsigned int']],
    'sh_addr': [0xc, ['unsigned int']],
    'sh_offset': [0x10, ['unsigned int']],
    'sh_size': [0x14, ['unsigned int']],
    'sh_link': [0x18, ['unsigned int']],
    'sh_info': [0x1c, ['unsigned int']],
    'sh_addralign': [0x20, ['unsigned int']],
    'sh_entsize': [0x24, ['unsigned int']],
}],
  '__unnamed_0x2a85': [ 0x50, {
    'i': [0x0, ['array', 8, ['int']]],
    's': [0x0, ['array', 80, ['char']]],
}],
  '__ptrtr_not_void<char, char': [ 0x1, {
}],
  'BiosLinkerLoaderEntry': [ 0x80, {
    'command': [0x0, ['unsigned int']],
    '__unnamed_0x87f': [0x4, ['__unnamed_0x822']],
}],
  'less<std::pair<long int, llvm::Type*': [ 0x1, {
}],
  'check_fdc_state': [ 0x10, {
    'floppy': [0x0, ['pointer', ['ISADevice']]],
    'multiple': [0x8, ['unsigned char']],
}],
  '__unnamed_0x7477': [ 0x4, {
    'device_id': [0x0, ['unsigned short']],
    'seq_num': [0x2, ['unsigned short']],
}],
  'rr_map_list': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['RR_MapList']]],
}],
  'SpiceMigrateInterface': [ 0x28, {
    'base': [0x0, ['SpiceBaseInterface']],
    'migrate_connect_complete': [0x18, ['pointer', ['void']]],
    'migrate_end_complete': [0x20, ['pointer', ['void']]],
}],
  '__unnamed_0x22ba': [ 0x40, {
    'altset': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'ALTSET_OFF', 1: 'ALTSET_ON'}}]],
    'as': [0x4, ['audsettings']],
    'voice': [0x18, ['pointer', ['SWVoiceOut']]],
    'mute': [0x20, ['unsigned char']],
    'vol': [0x21, ['array', 2, ['unsigned char']]],
    'buf': [0x28, ['streambuf']],
}],
  'iterator<std::bidirectional_iterator_tag, llvm::GlobalAlias, long int, llvm::GlobalAlias*, llvm::GlobalAlias&': [ 0x1, {
}],
  'QueryParams': [ 0x10, {
    'n': [0x0, ['int']],
    'alloc': [0x4, ['int']],
    'p': [0x8, ['pointer', ['QueryParam']]],
}],
  'RR_prog_point_t': [ 0x8, {
    'guest_instr_count': [0x0, ['unsigned long']],
}],
  '__unnamed_0x382b': [ 0x8, {
    'r_virtbase': [0x0, ['pointer', ['unsigned char']]],
    'r_baseport': [0x0, ['unsigned int']],
}],
  '__unnamed_0x382c': [ 0x8, {
    'status_error': [0x0, ['unsigned int']],
    'length': [0x4, ['unsigned short']],
    'vlan': [0x6, ['unsigned short']],
}],
  '__unnamed_0x167d': [ 0x48, {
    'ipv4': [0x0, ['__unnamed_0x15b0']],
    'ipv6': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'IOMMU_NOTIFIER_NONE', 1: 'IOMMU_NOTIFIER_UNMAP', 2: 'IOMMU_NOTIFIER_MAP'}}]],
}],
  '__unnamed_0x1ccd': [ 0x30, {
    'type': [0x0, ['int']],
    'serial': [0x8, ['unsigned long']],
    'send_event': [0x10, ['int']],
    'display': [0x18, ['pointer', ['_XDisplay']]],
    'window': [0x20, ['unsigned long']],
    'mode': [0x28, ['int']],
    'detail': [0x2c, ['int']],
}],
  'mbr_t': [ 0x200, {
    'ignored': [0x0, ['array', 440, ['unsigned char']]],
    'nt_id': [0x1b8, ['unsigned int']],
    'ignored2': [0x1bc, ['array', 2, ['unsigned char']]],
    'partition': [0x1be, ['array', 4, ['partition_t']]],
    'magic': [0x1fe, ['array', 2, ['unsigned char']]],
}],
  'kvm_assigned_msix_entry': [ 0x10, {
    'assigned_dev_id': [0x0, ['unsigned int']],
    'gsi': [0x4, ['unsigned int']],
    'entry': [0x8, ['unsigned short']],
    'padding': [0xa, ['array', 3, ['unsigned short']]],
}],
  'fm_opl_channel': [ 0x108, {
    'SLOT': [0x0, ['array', 2, ['fm_opl_slot']]],
    'CON': [0xd0, ['unsigned char']],
    'FB': [0xd1, ['unsigned char']],
    'connect1': [0xd8, ['pointer', ['int']]],
    'connect2': [0xe0, ['pointer', ['int']]],
    'op1_out': [0xe8, ['array', 2, ['int']]],
    'block_fnum': [0xf0, ['unsigned int']],
    'kcode': [0xf4, ['unsigned char']],
    'fc': [0xf8, ['unsigned int']],
    'ksl_base': [0xfc, ['unsigned int']],
    'keyon': [0x100, ['unsigned char']],
}],
  'XenPCIPassthroughState': [ 0x12b0, {
    'dev': [0x0, ['PCIDevice']],
    'hostaddr': [0x8f0, ['PCIHostDeviceAddress']],
    'is_virtfn': [0x900, ['unsigned char']],
    'permissive': [0x901, ['unsigned char']],
    'permissive_warned': [0x902, ['unsigned char']],
    'real_device': [0x908, ['XenHostPCIDevice']],
    'bases': [0x9d0, ['array', 7, ['XenPTRegion']]],
    'reg_grps': [0xa40, ['Enumeration', {'target': 'int', 'choices': {0: 'QEMU_PCI_VGA_MEM', 1: 'QEMU_PCI_VGA_IO_LO', 2: 'QEMU_PCI_VGA_IO_HI', 3: 'QEMU_PCI_VGA_NUM_REGIONS'}}]],
    'machine_irq': [0xa48, ['unsigned int']],
    'msi': [0xa50, ['pointer', ['XenPTMSI']]],
    'msix': [0xa58, ['pointer', ['XenPTMSIX']]],
    'bar': [0xa60, ['array', 6, ['MemoryRegion']]],
    'rom': [0x1060, ['MemoryRegion']],
    'memory_listener': [0x1160, ['MemoryListener']],
    'io_listener': [0x1200, ['MemoryListener']],
    'listener_set': [0x12a0, ['unsigned char']],
}],
  'rebind<std::_Rb_tree_node<std::pair<const llvm::Function* const, long int': [ 0x1, {
}],
  'q_obj_QUORUM_REPORT_BAD_arg': [ 0x28, {
    'type': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'QUORUM_OP_TYPE_READ', 1: 'QUORUM_OP_TYPE_WRITE', 2: 'QUORUM_OP_TYPE_FLUSH', 3: 'QUORUM_OP_TYPE__MAX'}}]],
    'has_error': [0x4, ['unsigned char']],
    'error': [0x8, ['pointer', ['char']]],
    'node_name': [0x10, ['pointer', ['char']]],
    'sector_num': [0x18, ['long']],
    'sectors_count': [0x20, ['long']],
}],
  'vfio_irq_info': [ 0x10, {
    'argsz': [0x0, ['unsigned int']],
    'flags': [0x4, ['unsigned int']],
    'index': [0x8, ['unsigned int']],
    'count': [0xc, ['unsigned int']],
}],
  '__unnamed_0x2908': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['PCIBus']]],
}],
  'BlockdevOptionsLUKS': [ 0x18, {
    'file': [0x0, ['pointer', ['BlockdevRef']]],
    'has_key_secret': [0x8, ['unsigned char']],
    'key_secret': [0x10, ['pointer', ['char']]],
}],
  'CpuInfo': [ 0x38, {
    'CPU': [0x0, ['long']],
    'current': [0x8, ['unsigned char']],
    'halted': [0x9, ['unsigned char']],
    'qom_path': [0x10, ['pointer', ['char']]],
    'thread_id': [0x18, ['long']],
    'arch': [0x20, ['Enumeration', {'target': 'int', 'choices': {0: 'CPU_INFO_ARCH_X86', 1: 'CPU_INFO_ARCH_SPARC', 2: 'CPU_INFO_ARCH_PPC', 3: 'CPU_INFO_ARCH_MIPS', 4: 'CPU_INFO_ARCH_TRICORE', 5: 'CPU_INFO_ARCH_OTHER', 6: 'CPU_INFO_ARCH__MAX'}}]],
    'u': [0x28, ['__unnamed_0xad54']],
}],
  'simplify_type<llvm::Value*': [ 0x1, {
}],
  'XenInput': [ 0x538, {
    'c': [0x0, ['common']],
    'abs_pointer_wanted': [0x520, ['int']],
    'button_state': [0x524, ['int']],
    'extended': [0x528, ['int']],
    'qmouse': [0x530, ['pointer', ['QEMUPutMouseEntry']]],
}],
  '_Iter_base<llvm::Type**, false': [ 0x1, {
}],
  'NetSocketState': [ 0x111b8, {
    'nc': [0x0, ['NetClientState']],
    'listen_fd': [0x170, ['int']],
    'fd': [0x174, ['int']],
    'rs': [0x178, ['SocketReadState']],
    'send_index': [0x11190, ['unsigned int']],
    'dgram_dst': [0x11194, ['sockaddr_in']],
    'send_fn': [0x111a8, ['pointer', ['void']]],
    'read_poll': [0x111b0, ['unsigned char']],
    'write_poll': [0x111b1, ['unsigned char']],
}],
  'QXLCursor': [ 0x2a, {
    'header': [0x0, ['QXLCursorHeader']],
    'data_size': [0x12, ['unsigned int']],
    'chunk': [0x16, ['QXLDataChunk']],
}],
  '_GOnce': [ 0x10, {
    'status': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'G_ONCE_STATUS_NOTCALLED', 1: 'G_ONCE_STATUS_PROGRESS', 2: 'G_ONCE_STATUS_READY'}}]],
    'retval': [0x8, ['pointer', ['void']]],
}],
  'ISACirrusVGAState': [ 0x13540, {
    'parent_obj': [0x0, ['ISADevice']],
    'cirrus_vga': [0x80, ['CirrusVGAState']],
}],
  'shared_iopage': [ 0x20, {
    'vcpu_ioreq': [0x0, ['array', 1, ['ioreq']]],
}],
  'mfi_ld_ref': [ 0x4, {
    'ref': [0x0, ['unsigned int']],
    'v': [0x0, ['__unnamed_0x781e']],
}],
  'AllwinnerAHCIState': [ 0x6e0, {
    'parent_obj': [0x0, ['SysbusAHCIState']],
    'mmio': [0x560, ['MemoryRegion']],
    'regs': [0x660, ['array', 32, ['unsigned int']]],
}],
  'bpl': [ 0x10, {
    'addr': [0x0, ['unsigned long']],
    'len': [0x8, ['unsigned int']],
    'flags': [0xc, ['unsigned int']],
}],
  'cast_retty_wrap<llvm::Function, llvm::Value*, llvm::Value*': [ 0x1, {
}],
  'kvm_device_attr': [ 0x18, {
    'flags': [0x0, ['unsigned int']],
    'group': [0x4, ['unsigned int']],
    'attr': [0x8, ['unsigned long long']],
    'addr': [0x10, ['unsigned long long']],
}],
  '__unnamed_0x758b': [ 0x28, {
    'count': [0x0, ['unsigned char']],
    'is_path_broken': [0x1, ['unsigned char']],
    'reserved': [0x2, ['array', 6, ['unsigned char']]],
    'sas_addr': [0x8, ['array', 4, ['unsigned long']]],
}],
  'enable_if_c<true, llvm::Instruction*': [ 0x1, {
}],
  '__unnamed_0x1cc9': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['ThreadPoolElement']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['ThreadPoolElement']]]],
}],
  'pair<llvm::StringRef, llvm::StringRef': [ 0x20, {
    'first': [0x0, ['void']],
    'second': [0x10, ['void']],
}],
  'VirtIOFeature': [ 0x10, {
    'flags': [0x0, ['unsigned int']],
    'end': [0x8, ['unsigned long']],
}],
  'bidirectional_iterator_tag': [ 0x1, {
}],
  'SDL_VideoInfo': [ 0x18, {
    'UnusedBits1': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 2}]],
    'blit_sw_CC': [0x0, ['BitField', {'end_bit': 14, 'start_bit': 13}]],
    'UnusedBits3': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 16}]],
    'UnusedBits2': [0x0, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'blit_fill': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 15}]],
    'hw_available': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'blit_hw': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'blit_sw': [0x0, ['BitField', {'end_bit': 13, 'start_bit': 12}]],
    'wm_available': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'blit_hw_CC': [0x0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'blit_hw_A': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'blit_sw_A': [0x0, ['BitField', {'end_bit': 15, 'start_bit': 14}]],
    'video_mem': [0x4, ['unsigned int']],
    'vfmt': [0x8, ['pointer', ['SDL_PixelFormat']]],
    'current_w': [0x10, ['int']],
    'current_h': [0x14, ['int']],
}],
  'AcpiMadtProcessorApic': [ 0x8, {
    'type': [0x0, ['unsigned char']],
    'length': [0x1, ['unsigned char']],
    'processor_id': [0x2, ['unsigned char']],
    'local_apic_id': [0x3, ['unsigned char']],
    'flags': [0x4, ['unsigned int']],
}],
  'pandalog_header_struct': [ 0x18, {
    'version': [0x0, ['unsigned int']],
    'dir_pos': [0x8, ['unsigned long']],
    'chunk_size': [0x10, ['unsigned int']],
}],
  '_libc_fpxreg': [ 0x10, {
    'significand': [0x0, ['array', 4, ['unsigned short']]],
    'exponent': [0x8, ['unsigned short']],
    'padding': [0xa, ['array', 3, ['unsigned short']]],
}],
  'AcpiMadtLocalNmi': [ 0x6, {
    'type': [0x0, ['unsigned char']],
    'length': [0x1, ['unsigned char']],
    'processor_id': [0x2, ['unsigned char']],
    'flags': [0x3, ['unsigned short']],
    'lint': [0x5, ['unsigned char']],
}],
  'XHCITransfer': [ 0xf0, {
    'epctx': [0x0, ['pointer', ['XHCIEPContext']]],
    'packet': [0x8, ['USBPacket']],
    'sgl': [0x80, ['QEMUSGList']],
    'running_async': [0xa8, ['unsigned char']],
    'running_retry': [0xa9, ['unsigned char']],
    'complete': [0xaa, ['unsigned char']],
    'int_req': [0xab, ['unsigned char']],
    'iso_pkts': [0xac, ['unsigned int']],
    'streamid': [0xb0, ['unsigned int']],
    'in_xfer': [0xb4, ['unsigned char']],
    'iso_xfer': [0xb5, ['unsigned char']],
    'timed_xfer': [0xb6, ['unsigned char']],
    'trb_count': [0xb8, ['unsigned int']],
    'trbs': [0xc0, ['pointer', ['XHCITRB']]],
    'status': [0xc8, ['Enumeration', {'target': 'int', 'choices': {0: 'CC_INVALID', 1: 'CC_SUCCESS', 2: 'CC_DATA_BUFFER_ERROR', 3: 'CC_BABBLE_DETECTED', 4: 'CC_USB_TRANSACTION_ERROR', 5: 'CC_TRB_ERROR', 6: 'CC_STALL_ERROR', 7: 'CC_RESOURCE_ERROR', 8: 'CC_BANDWIDTH_ERROR', 9: 'CC_NO_SLOTS_ERROR', 10: 'CC_INVALID_STREAM_TYPE_ERROR', 11: 'CC_SLOT_NOT_ENABLED_ERROR', 12: 'CC_EP_NOT_ENABLED_ERROR', 13: 'CC_SHORT_PACKET', 14: 'CC_RING_UNDERRUN', 15: 'CC_RING_OVERRUN', 16: 'CC_VF_ER_FULL', 17: 'CC_PARAMETER_ERROR', 18: 'CC_BANDWIDTH_OVERRUN', 19: 'CC_CONTEXT_STATE_ERROR', 20: 'CC_NO_PING_RESPONSE_ERROR', 21: 'CC_EVENT_RING_FULL_ERROR', 22: 'CC_INCOMPATIBLE_DEVICE_ERROR', 23: 'CC_MISSED_SERVICE_ERROR', 24: 'CC_COMMAND_RING_STOPPED', 25: 'CC_COMMAND_ABORTED', 26: 'CC_STOPPED', 27: 'CC_STOPPED_LENGTH_INVALID', 29: 'CC_MAX_EXIT_LATENCY_TOO_LARGE_ERROR', 31: 'CC_ISOCH_BUFFER_OVERRUN', 32: 'CC_EVENT_LOST_ERROR', 33: 'CC_UNDEFINED_ERROR', 34: 'CC_INVALID_STREAM_ID_ERROR', 35: 'CC_SECONDARY_BANDWIDTH_ERROR', 36: 'CC_SPLIT_TRANSACTION_ERROR'}}]],
    'pkts': [0xcc, ['unsigned int']],
    'pktsize': [0xd0, ['unsigned int']],
    'cur_pkt': [0xd4, ['unsigned int']],
    'mfindex_kick': [0xd8, ['unsigned long']],
    'next': [0xe0, ['__unnamed_0x3fe8']],
}],
  'FlushCo': [ 0x10, {
    'bs': [0x0, ['pointer', ['BlockDriverState']]],
    'ret': [0x8, ['int']],
}],
  'q_obj_NetdevNoneOptions_wrapper': [ 0x8, {
    'data': [0x0, ['pointer', ['NetdevNoneOptions']]],
}],
  'smbios_type_4': [ 0x2a, {
    'header': [0x0, ['smbios_structure_header']],
    'socket_designation_str': [0x4, ['unsigned char']],
    'processor_type': [0x5, ['unsigned char']],
    'processor_family': [0x6, ['unsigned char']],
    'processor_manufacturer_str': [0x7, ['unsigned char']],
    'processor_id': [0x8, ['array', 2, ['unsigned int']]],
    'processor_version_str': [0x10, ['unsigned char']],
    'voltage': [0x11, ['unsigned char']],
    'external_clock': [0x12, ['unsigned short']],
    'max_speed': [0x14, ['unsigned short']],
    'current_speed': [0x16, ['unsigned short']],
    'status': [0x18, ['unsigned char']],
    'processor_upgrade': [0x19, ['unsigned char']],
    'l1_cache_handle': [0x1a, ['unsigned short']],
    'l2_cache_handle': [0x1c, ['unsigned short']],
    'l3_cache_handle': [0x1e, ['unsigned short']],
    'serial_number_str': [0x20, ['unsigned char']],
    'asset_tag_number_str': [0x21, ['unsigned char']],
    'part_number_str': [0x22, ['unsigned char']],
    'core_count': [0x23, ['unsigned char']],
    'core_enabled': [0x24, ['unsigned char']],
    'thread_count': [0x25, ['unsigned char']],
    'processor_characteristics': [0x26, ['unsigned short']],
    'processor_family2': [0x28, ['unsigned short']],
}],
  '_Panda__LogEntry': [ 0xe8, {
    'base': [0x0, ['ProtobufCMessage']],
    'pc': [0x18, ['unsigned long']],
    'instr': [0x20, ['unsigned long']],
    'has_asid': [0x28, ['int']],
    'asid': [0x30, ['unsigned long']],
    'process_name': [0x38, ['pointer', ['char']]],
    'has_process_id': [0x40, ['int']],
    'process_id': [0x44, ['unsigned int']],
    'has_total_instr': [0x48, ['int']],
    'total_instr': [0x50, ['unsigned long']],
    'call_stack': [0x58, ['pointer', ['_Panda__CallStack']]],
    'dwarf_call': [0x60, ['pointer', ['_Panda__DwarfCall']]],
    'dwarf_ret': [0x68, ['pointer', ['_Panda__DwarfCall']]],
    'has_taint_label_virtual_addr': [0x70, ['int']],
    'taint_label_virtual_addr': [0x78, ['unsigned long']],
    'has_taint_label_physical_addr': [0x80, ['int']],
    'taint_label_physical_addr': [0x88, ['unsigned long']],
    'has_taint_label_number': [0x90, ['int']],
    'taint_label_number': [0x94, ['unsigned int']],
    'taint_query_pri': [0x98, ['pointer', ['_Panda__TaintQueryPri']]],
    'attack_point_pri': [0xa0, ['pointer', ['_Panda__AttackPointPri']]],
    'pri_trace_src_info': [0xa8, ['pointer', ['_Panda__SrcInfoPri']]],
    'taint_query_hypercall': [0xb0, ['pointer', ['_Panda__TaintQueryHypercall']]],
    'attack_point': [0xb8, ['pointer', ['_Panda__AttackPoint']]],
    'tainted_branch': [0xc0, ['pointer', ['_Panda__TaintedBranch']]],
    'tainted_branch_summary': [0xc8, ['pointer', ['_Panda__TaintedBranchSummary']]],
    'tainted_instr': [0xd0, ['pointer', ['_Panda__TaintedInstr']]],
    'tainted_instr_summary': [0xd8, ['pointer', ['_Panda__TaintedInstrSummary']]],
    'llvmentry': [0xe0, ['pointer', ['_Panda__LLVMEntry']]],
}],
  'Q35PCIHost': [ 0x4c40, {
    'parent_obj': [0x0, ['PCIExpressHost']],
    'mch': [0x730, ['MCHPCIState']],
}],
  'smbios_type_0': [ 0x18, {
    'header': [0x0, ['smbios_structure_header']],
    'vendor_str': [0x4, ['unsigned char']],
    'bios_version_str': [0x5, ['unsigned char']],
    'bios_starting_address_segment': [0x6, ['unsigned short']],
    'bios_release_date_str': [0x8, ['unsigned char']],
    'bios_rom_size': [0x9, ['unsigned char']],
    'bios_characteristics': [0xa, ['unsigned long']],
    'bios_characteristics_extension_bytes': [0x12, ['array', 2, ['unsigned char']]],
    'system_bios_major_release': [0x14, ['unsigned char']],
    'system_bios_minor_release': [0x15, ['unsigned char']],
    'embedded_controller_major_release': [0x16, ['unsigned char']],
    'embedded_controller_minor_release': [0x17, ['unsigned char']],
}],
  'smbios_type_1': [ 0x1b, {
    'header': [0x0, ['smbios_structure_header']],
    'manufacturer_str': [0x4, ['unsigned char']],
    'product_name_str': [0x5, ['unsigned char']],
    'version_str': [0x6, ['unsigned char']],
    'serial_number_str': [0x7, ['unsigned char']],
    'uuid': [0x8, ['smbios_uuid']],
    'wake_up_type': [0x18, ['unsigned char']],
    'sku_number_str': [0x19, ['unsigned char']],
    'family_str': [0x1a, ['unsigned char']],
}],
  'smbios_type_2': [ 0xf, {
    'header': [0x0, ['smbios_structure_header']],
    'manufacturer_str': [0x4, ['unsigned char']],
    'product_str': [0x5, ['unsigned char']],
    'version_str': [0x6, ['unsigned char']],
    'serial_number_str': [0x7, ['unsigned char']],
    'asset_tag_number_str': [0x8, ['unsigned char']],
    'feature_flags': [0x9, ['unsigned char']],
    'location_str': [0xa, ['unsigned char']],
    'chassis_handle': [0xb, ['unsigned short']],
    'board_type': [0xd, ['unsigned char']],
    'contained_element_count': [0xe, ['unsigned char']],
}],
  'smbios_type_3': [ 0x15, {
    'header': [0x0, ['smbios_structure_header']],
    'manufacturer_str': [0x4, ['unsigned char']],
    'type': [0x5, ['unsigned char']],
    'version_str': [0x6, ['unsigned char']],
    'serial_number_str': [0x7, ['unsigned char']],
    'asset_tag_number_str': [0x8, ['unsigned char']],
    'boot_up_state': [0x9, ['unsigned char']],
    'power_supply_state': [0xa, ['unsigned char']],
    'thermal_state': [0xb, ['unsigned char']],
    'security_status': [0xc, ['unsigned char']],
    'oem_defined': [0xd, ['unsigned int']],
    'height': [0x11, ['unsigned char']],
    'number_of_power_cords': [0x12, ['unsigned char']],
    'contained_element_count': [0x13, ['unsigned char']],
    'sku_number_str': [0x14, ['unsigned char']],
}],
  'I8257State': [ 0x3d0, {
    'parent_obj': [0x0, ['ISADevice']],
    'base': [0x80, ['int']],
    'page_base': [0x84, ['int']],
    'pageh_base': [0x88, ['int']],
    'dshift': [0x8c, ['int']],
    'status': [0x90, ['unsigned char']],
    'command': [0x91, ['unsigned char']],
    'mask': [0x92, ['unsigned char']],
    'flip_flop': [0x93, ['unsigned char']],
    'regs': [0x98, ['array', 4, ['I8257Regs']]],
    'channel_io': [0x140, ['MemoryRegion']],
    'cont_io': [0x240, ['MemoryRegion']],
    'dma_bh': [0x340, ['pointer', ['QEMUBH']]],
    'dma_bh_scheduled': [0x348, ['unsigned char']],
    'running': [0x34c, ['int']],
    'portio_page': [0x350, ['PortioList']],
    'portio_pageh': [0x390, ['PortioList']],
}],
  'elf64_phdr': [ 0x38, {
    'p_type': [0x0, ['unsigned int']],
    'p_flags': [0x4, ['unsigned int']],
    'p_offset': [0x8, ['unsigned long']],
    'p_vaddr': [0x10, ['unsigned long']],
    'p_paddr': [0x18, ['unsigned long']],
    'p_filesz': [0x20, ['unsigned long']],
    'p_memsz': [0x28, ['unsigned long']],
    'p_align': [0x30, ['unsigned long']],
}],
  'QEMUIOVector': [ 0x18, {
    'iov': [0x0, ['pointer', ['iovec']]],
    'niov': [0x8, ['int']],
    'nalloc': [0xc, ['int']],
    'size': [0x10, ['unsigned long']],
}],
  'buffer': [ 0x28, {
    'data': [0x0, ['pointer', ['unsigned char']]],
    'consumed': [0x8, ['unsigned long']],
    'size': [0x10, ['unsigned long']],
    'capacity': [0x18, ['unsigned long']],
    'max_capacity': [0x20, ['unsigned long']],
}],
  'APMState': [ 0x120, {
    'apmc': [0x0, ['unsigned char']],
    'apms': [0x1, ['unsigned char']],
    'callback': [0x8, ['pointer', ['void']]],
    'arg': [0x10, ['pointer', ['void']]],
    'io': [0x20, ['MemoryRegion']],
}],
  '__unnamed_0xae6a': [ 0x8, {
    'qcow2': [0x0, ['q_obj_ImageInfoSpecificQCow2_wrapper']],
    'vmdk': [0x0, ['q_obj_ImageInfoSpecificVmdk_wrapper']],
    'luks': [0x0, ['q_obj_QCryptoBlockInfoLUKS_wrapper']],
}],
  'NetClientState': [ 0x170, {
    'info': [0x0, ['pointer', ['NetClientInfo']]],
    'link_down': [0x8, ['int']],
    'next': [0x10, ['__unnamed_0x1031']],
    'peer': [0x20, ['pointer', ['NetClientState']]],
    'incoming_queue': [0x28, ['pointer', ['NetQueue']]],
    'model': [0x30, ['pointer', ['char']]],
    'name': [0x38, ['pointer', ['char']]],
    'info_str': [0x40, ['array', 256, ['char']]],
    'receive_disabled': [0x140, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'destructor': [0x148, ['pointer', ['void']]],
    'queue_index': [0x150, ['unsigned int']],
    'rxfilter_notify_enabled': [0x154, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'vring_enable': [0x158, ['int']],
    'filters': [0x160, ['NetFilterHead']],
}],
  '__unnamed_0x813': [ 0x10, {
    'le_next': [0x0, ['pointer', ['QDictEntry']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['QDictEntry']]]],
}],
  'BalloonInfo': [ 0x8, {
    'actual': [0x0, ['long']],
}],
  'cq_req_list': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['NvmeRequest']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['NvmeRequest']]]],
}],
  '_Panda__DwarfCall': [ 0x40, {
    'base': [0x0, ['ProtobufCMessage']],
    'file_callee': [0x18, ['pointer', ['char']]],
    'function_name_callee': [0x20, ['pointer', ['char']]],
    'line_number_callee': [0x28, ['unsigned long']],
    'file_caller': [0x30, ['pointer', ['char']]],
    'line_number_caller': [0x38, ['unsigned long']],
}],
  'vhost_vring_addr': [ 0x28, {
    'index': [0x0, ['unsigned int']],
    'flags': [0x4, ['unsigned int']],
    'desc_user_addr': [0x8, ['unsigned long long']],
    'used_user_addr': [0x10, ['unsigned long long']],
    'avail_user_addr': [0x18, ['unsigned long long']],
    'log_guest_addr': [0x20, ['unsigned long long']],
}],
  '__unnamed_0x5bf4': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['IEC_Notifier']]],
}],
  'QEDRequest': [ 0x8, {
    'l2_table': [0x0, ['pointer', ['CachedL2Table']]],
}],
  'SCC2698Channel': [ 0x48, {
    'ipoctal': [0x0, ['pointer', ['IPOctalState']]],
    'dev': [0x8, ['CharBackend']],
    'rx_enabled': [0x38, ['unsigned char']],
    'mr': [0x39, ['array', 2, ['unsigned char']]],
    'mr_idx': [0x3b, ['unsigned char']],
    'sr': [0x3c, ['unsigned char']],
    'rhr': [0x3d, ['array', 3, ['unsigned char']]],
    'rhr_idx': [0x40, ['unsigned char']],
    'rx_pending': [0x41, ['unsigned char']],
}],
  'AcpiCpuHotplug': [ 0x130, {
    'device': [0x0, ['pointer', ['Object']]],
    'io': [0x10, ['MemoryRegion']],
    'sts': [0x110, ['array', 32, ['unsigned char']]],
}],
  'MapCacheEntry': [ 0x30, {
    'paddr_index': [0x0, ['unsigned long']],
    'vaddr_base': [0x8, ['pointer', ['unsigned char']]],
    'valid_mapping': [0x10, ['pointer', ['unsigned long']]],
    'lock': [0x18, ['unsigned char']],
    'size': [0x20, ['unsigned long']],
    'next': [0x28, ['pointer', ['MapCacheEntry']]],
}],
  'VAPICHandlers': [ 0x2c, {
    'set_tpr': [0x0, ['unsigned int']],
    'set_tpr_eax': [0x4, ['unsigned int']],
    'get_tpr': [0x8, ['array', 8, ['unsigned int']]],
    'get_tpr_stack': [0x28, ['unsigned int']],
}],
  '__unnamed_0x24f8': [ 0x10, {
    'rip': [0x0, ['unsigned long long']],
    'is_write': [0x8, ['unsigned int']],
    'pad': [0xc, ['unsigned int']],
}],
  'TraceEventInfo': [ 0x10, {
    'name': [0x0, ['pointer', ['char']]],
    'state': [0x8, ['Enumeration', {'target': 'int', 'choices': {0: 'TRACE_EVENT_STATE_UNAVAILABLE', 1: 'TRACE_EVENT_STATE_DISABLED', 2: 'TRACE_EVENT_STATE_ENABLED', 3: 'TRACE_EVENT_STATE__MAX'}}]],
    'vcpu': [0xc, ['unsigned char']],
}],
  'NVDIMMClass': [ 0xe8, {
    'parent_class': [0x0, ['PCDIMMDeviceClass']],
    'read_label_data': [0xd8, ['pointer', ['void']]],
    'write_label_data': [0xe0, ['pointer', ['void']]],
}],
  'VncClientInfo': [ 0x30, {
    'host': [0x0, ['pointer', ['char']]],
    'service': [0x8, ['pointer', ['char']]],
    'family': [0x10, ['Enumeration', {'target': 'int', 'choices': {0: 'NETWORK_ADDRESS_FAMILY_IPV4', 1: 'NETWORK_ADDRESS_FAMILY_IPV6', 2: 'NETWORK_ADDRESS_FAMILY_UNIX', 3: 'NETWORK_ADDRESS_FAMILY_VSOCK', 4: 'NETWORK_ADDRESS_FAMILY_UNKNOWN', 5: 'NETWORK_ADDRESS_FAMILY__MAX'}}]],
    'websocket': [0x14, ['unsigned char']],
    'has_x509_dname': [0x15, ['unsigned char']],
    'x509_dname': [0x18, ['pointer', ['char']]],
    'has_sasl_username': [0x20, ['unsigned char']],
    'sasl_username': [0x28, ['pointer', ['char']]],
}],
  'USBDescMSOS': [ 0x18, {
    'CompatibleID': [0x0, ['pointer', ['char']]],
    'Label': [0x8, ['pointer', ['int']]],
    'SelectiveSuspendEnabled': [0x10, ['unsigned char']],
}],
  'Property': [ 0x40, {
    'name': [0x0, ['pointer', ['char']]],
    'info': [0x8, ['pointer', ['PropertyInfo']]],
    'offset': [0x10, ['long']],
    'bitnr': [0x18, ['unsigned char']],
    'qtype': [0x1c, ['Enumeration', {'target': 'int', 'choices': {0: 'QTYPE_NONE', 1: 'QTYPE_QNULL', 2: 'QTYPE_QINT', 3: 'QTYPE_QSTRING', 4: 'QTYPE_QDICT', 5: 'QTYPE_QLIST', 6: 'QTYPE_QFLOAT', 7: 'QTYPE_QBOOL', 8: 'QTYPE__MAX'}}]],
    'defval': [0x20, ['long']],
    'arrayoffset': [0x28, ['int']],
    'arrayinfo': [0x30, ['pointer', ['PropertyInfo']]],
    'arrayfieldsize': [0x38, ['int']],
}],
  'cast_retty<llvm::FunctionType, llvm::Type*': [ 0x1, {
}],
  'VirtIOCryptoPCI': [ 0x8560, {
    'parent_obj': [0x0, ['VirtIOPCIProxy']],
    'vdev': [0x8410, ['VirtIOCrypto']],
}],
  'QXLInterface': [ 0x90, {
    'base': [0x0, ['SpiceBaseInterface']],
    'attache_worker': [0x18, ['pointer', ['void']]],
    'set_compression_level': [0x20, ['pointer', ['void']]],
    'set_mm_time': [0x28, ['pointer', ['void']]],
    'get_init_info': [0x30, ['pointer', ['void']]],
    'get_command': [0x38, ['pointer', ['void']]],
    'req_cmd_notification': [0x40, ['pointer', ['void']]],
    'release_resource': [0x48, ['pointer', ['void']]],
    'get_cursor_command': [0x50, ['pointer', ['void']]],
    'req_cursor_notification': [0x58, ['pointer', ['void']]],
    'notify_update': [0x60, ['pointer', ['void']]],
    'flush_resources': [0x68, ['pointer', ['void']]],
    'async_complete': [0x70, ['pointer', ['void']]],
    'update_area_complete': [0x78, ['pointer', ['void']]],
    'set_client_capabilities': [0x80, ['pointer', ['void']]],
    'client_monitors_config': [0x88, ['pointer', ['void']]],
}],
  'pair<std::_Rb_tree_iterator<std::pair<const llvm::Function* const, long int': [ 0x10, {
    'first': [0x0, ['_Rb_tree_iterator<std::pair<const llvm::Function* const, long int']],
    'second': [0x8, ['_Rb_tree_iterator<std::pair<const llvm::Function* const, long int']],
}],
  'BlockDeviceTimedStatsList': [ 0x10, {
    'next': [0x0, ['pointer', ['BlockDeviceTimedStatsList']]],
    'value': [0x8, ['pointer', ['BlockDeviceTimedStats']]],
}],
  '__unnamed_0xc71': [ 0x8, {
    's': [0x0, ['long']],
    'u': [0x0, ['unsigned long']],
}],
  'rdnss': [ 0x16, {
    'reserved': [0x0, ['unsigned short']],
    'lifetime': [0x2, ['unsigned int']],
    'addr': [0x6, ['in6_addr']],
}],
  'virtio_crypto_hash_para': [ 0x8, {
    'src_data_len': [0x0, ['unsigned int']],
    'hash_result_len': [0x4, ['unsigned int']],
}],
  'VHDXMetadataEntries': [ 0xc2, {
    'file_parameters_entry': [0x0, ['VHDXMetadataTableEntry']],
    'virtual_disk_size_entry': [0x20, ['VHDXMetadataTableEntry']],
    'page83_data_entry': [0x40, ['VHDXMetadataTableEntry']],
    'logical_sector_size_entry': [0x60, ['VHDXMetadataTableEntry']],
    'phys_sector_size_entry': [0x80, ['VHDXMetadataTableEntry']],
    'parent_locator_entry': [0xa0, ['VHDXMetadataTableEntry']],
    'present': [0xc0, ['unsigned short']],
}],
  '__unnamed_0xc78': [ 0x24, {
    'ti_i6': [0x0, ['__unnamed_0xc3f']],
    'ti_i4': [0x0, ['__unnamed_0xc06']],
}],
  'QemuInputHandlerState': [ 0x30, {
    'dev': [0x0, ['pointer', ['DeviceState']]],
    'handler': [0x8, ['pointer', ['QemuInputHandler']]],
    'id': [0x10, ['int']],
    'events': [0x14, ['int']],
    'con': [0x18, ['pointer', ['QemuConsole']]],
    'node': [0x20, ['__unnamed_0x2b52']],
}],
  'scsi_readcapacity10': [ 0x8, {
    'lba': [0x0, ['unsigned int']],
    'block_size': [0x4, ['unsigned int']],
}],
  'pflash_t': [ 0x4c0, {
    'parent_obj': [0x0, ['SysBusDevice']],
    'blk': [0x300, ['pointer', ['BlockBackend']]],
    'nb_blocs': [0x308, ['unsigned int']],
    'sector_len': [0x310, ['unsigned long']],
    'bank_width': [0x318, ['unsigned char']],
    'device_width': [0x319, ['unsigned char']],
    'max_device_width': [0x31a, ['unsigned char']],
    'features': [0x31c, ['unsigned int']],
    'wcycle': [0x320, ['unsigned char']],
    'ro': [0x324, ['int']],
    'cmd': [0x328, ['unsigned char']],
    'status': [0x329, ['unsigned char']],
    'ident0': [0x32a, ['unsigned short']],
    'ident1': [0x32c, ['unsigned short']],
    'ident2': [0x32e, ['unsigned short']],
    'ident3': [0x330, ['unsigned short']],
    'cfi_len': [0x332, ['unsigned char']],
    'cfi_table': [0x333, ['array', 82, ['unsigned char']]],
    'counter': [0x388, ['unsigned long']],
    'writeblock_size': [0x390, ['unsigned int']],
    'timer': [0x398, ['pointer', ['QEMUTimer']]],
    'mem': [0x3a0, ['MemoryRegion']],
    'name': [0x4a0, ['pointer', ['char']]],
    'storage': [0x4a8, ['pointer', ['void']]],
    'vmstate': [0x4b0, ['pointer', ['vm_change_state_entry']]],
    'old_multiple_chip_handling': [0x4b8, ['unsigned char']],
}],
  'kvm_pit_state2': [ 0x70, {
    'channels': [0x0, ['array', 3, ['kvm_pit_channel_state']]],
    'flags': [0x48, ['unsigned int']],
    'reserved': [0x4c, ['array', 9, ['unsigned int']]],
}],
  'StreamBlockJob': [ 0xf0, {
    'common': [0x0, ['BlockJob']],
    'limit': [0xa8, ['__unnamed_0x3f6f']],
    'base': [0xd0, ['pointer', ['BlockDriverState']]],
    'on_error': [0xd8, ['Enumeration', {'target': 'int', 'choices': {0: 'BLOCKDEV_ON_ERROR_REPORT', 1: 'BLOCKDEV_ON_ERROR_IGNORE', 2: 'BLOCKDEV_ON_ERROR_ENOSPC', 3: 'BLOCKDEV_ON_ERROR_STOP', 4: 'BLOCKDEV_ON_ERROR_AUTO', 5: 'BLOCKDEV_ON_ERROR__MAX'}}]],
    'backing_file_str': [0xe0, ['pointer', ['char']]],
    'bs_flags': [0xe8, ['int']],
}],
  'scsi_readcapacity16': [ 0x18, {
    'returned_lba': [0x0, ['unsigned long']],
    'block_length': [0x8, ['unsigned int']],
    'p_type': [0xc, ['unsigned char']],
    'prot_en': [0xd, ['unsigned char']],
    'p_i_exp': [0xe, ['unsigned char']],
    'lbppbe': [0xf, ['unsigned char']],
    'lbpme': [0x10, ['unsigned char']],
    'lbprz': [0x11, ['unsigned char']],
    'lalba': [0x12, ['unsigned short']],
}],
  'CPUAddressSpace': [ 0xb8, {
    'cpu': [0x0, ['pointer', ['CPUState']]],
    'as': [0x8, ['pointer', ['AddressSpace']]],
    'memory_dispatch': [0x10, ['pointer', ['AddressSpaceDispatch']]],
    'tcg_as_listener': [0x18, ['MemoryListener']],
}],
  'rcu_reader_data': [ 0x20, {
    'ctr': [0x0, ['unsigned long']],
    'waiting': [0x8, ['unsigned char']],
    'depth': [0xc, ['unsigned int']],
    'node': [0x10, ['__unnamed_0x9ea']],
}],
  'RAMBlockNotifier': [ 0x20, {
    'ram_block_added': [0x0, ['pointer', ['void']]],
    'ram_block_removed': [0x8, ['pointer', ['void']]],
    'next': [0x10, ['Enumeration', {'target': 'int', 'choices': {0: 'IOMMU_NOTIFIER_NONE', 1: 'IOMMU_NOTIFIER_UNMAP', 2: 'IOMMU_NOTIFIER_MAP'}}]],
}],
  'usb_redir_configuration_status_header': [ 0x2, {
    'status': [0x0, ['unsigned char']],
    'configuration': [0x1, ['unsigned char']],
}],
  'AcpiMcfgAllocation': [ 0x10, {
    'address': [0x0, ['unsigned long']],
    'pci_segment': [0x8, ['unsigned short']],
    'start_bus_number': [0xa, ['unsigned char']],
    'end_bus_number': [0xb, ['unsigned char']],
    'reserved': [0xc, ['unsigned int']],
}],
  'X86CPUTopoInfo': [ 0xc, {
    'pkg_id': [0x0, ['unsigned int']],
    'core_id': [0x4, ['unsigned int']],
    'smt_id': [0x8, ['unsigned int']],
}],
  '_XkbSymInterpretRec': [ 0x18, {
    'sym': [0x0, ['unsigned long']],
    'flags': [0x8, ['unsigned char']],
    'match': [0x9, ['unsigned char']],
    'mods': [0xa, ['unsigned char']],
    'virtual_mod': [0xb, ['unsigned char']],
    'act': [0xc, ['_XkbAnyAction']],
}],
  'blkif_common_response': [ 0x1, {
    'dummy': [0x0, ['char']],
}],
  'GuestPhysListener': [ 0xa8, {
    'list': [0x0, ['pointer', ['GuestPhysBlockList']]],
    'listener': [0x8, ['MemoryListener']],
}],
  'AssignedDevRegion': [ 0x220, {
    'container': [0x0, ['MemoryRegion']],
    'real_iomem': [0x100, ['MemoryRegion']],
    'u': [0x200, ['__unnamed_0x382b']],
    'e_size': [0x208, ['unsigned long']],
    'r_size': [0x210, ['unsigned long']],
    'region': [0x218, ['pointer', ['PCIRegion']]],
}],
  '__unnamed_0x3654': [ 0x100, {
    's390_stsi': [0x0, ['__unnamed_0x35e7']],
    'osi': [0x0, ['__unnamed_0x34fc']],
    'ex': [0x0, ['__unnamed_0x32ea']],
    'io': [0x0, ['__unnamed_0x330b']],
    's390_tsch': [0x0, ['__unnamed_0x3554']],
    's390_ucontrol': [0x0, ['__unnamed_0x3476']],
    'mmio': [0x0, ['__unnamed_0x336c']],
    'internal': [0x0, ['__unnamed_0x34cb']],
    's390_sieic': [0x0, ['__unnamed_0x3445']],
    's390_reset_flags': [0x0, ['unsigned long long']],
    'hypercall': [0x0, ['__unnamed_0x33ba']],
    'hw': [0x0, ['__unnamed_0x32c0']],
    'padding': [0x0, ['array', 256, ['char']]],
    'dcr': [0x0, ['__unnamed_0x349a']],
    'system_event': [0x0, ['__unnamed_0x35c3']],
    'hyperv': [0x0, ['kvm_hyperv_exit']],
    'eoi': [0x0, ['__unnamed_0x363d']],
    'epr': [0x0, ['Enumeration', {'target': 'int', 'choices': {1000: 'EST_INACTIVE', 1001: 'EST_ACTIVE', 1002: 'EST_EXECUTING', 1003: 'EST_SLEEPING', 1004: 'EST_WAITLISTHEAD', 1005: 'EST_FETCHENTRY', 1006: 'EST_FETCHQH', 1007: 'EST_FETCHITD', 1008: 'EST_FETCHSITD', 1009: 'EST_ADVANCEQUEUE', 1010: 'EST_FETCHQTD', 1011: 'EST_EXECUTE', 1012: 'EST_WRITEBACK', 1013: 'EST_HORIZONTALQH'}}]],
    'tpr_access': [0x0, ['__unnamed_0x3414']],
    'papr_hcall': [0x0, ['__unnamed_0x3524']],
    'debug': [0x0, ['__unnamed_0x3355']],
    'fail_entry': [0x0, ['__unnamed_0x32d5']],
}],
  '__unnamed_0x1099': [ 0x80, {
    'ss': [0x0, ['sockaddr_storage']],
    'sin6': [0x0, ['sockaddr_in6']],
    'sin': [0x0, ['sockaddr_in']],
}],
  'AC97LinkState': [ 0xd10, {
    'dev': [0x0, ['PCIDevice']],
    'card': [0x8f0, ['QEMUSoundCard']],
    'use_broken_id': [0x908, ['unsigned int']],
    'glob_cnt': [0x90c, ['unsigned int']],
    'glob_sta': [0x910, ['unsigned int']],
    'cas': [0x914, ['unsigned int']],
    'last_samp': [0x918, ['unsigned int']],
    'bm_regs': [0x91c, ['array', 3, ['AC97BusMasterRegs']]],
    'mixer_data': [0x964, ['array', 256, ['unsigned char']]],
    'voice_pi': [0xa68, ['pointer', ['SWVoiceIn']]],
    'voice_po': [0xa70, ['pointer', ['SWVoiceOut']]],
    'voice_mc': [0xa78, ['pointer', ['SWVoiceIn']]],
    'invalid_freq': [0xa80, ['array', 3, ['int']]],
    'silence': [0xa8c, ['array', 128, ['unsigned char']]],
    'bup_flag': [0xb0c, ['int']],
    'io_nam': [0xb10, ['MemoryRegion']],
    'io_nabm': [0xc10, ['MemoryRegion']],
}],
  'XenPTRegion': [ 0x10, {
    'bar_flag': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'XEN_PT_BAR_FLAG_MEM', 1: 'XEN_PT_BAR_FLAG_IO', 2: 'XEN_PT_BAR_FLAG_UPPER', 3: 'XEN_PT_BAR_FLAG_UNUSED'}}]],
    'access': [0x8, ['__unnamed_0x2a01']],
}],
  'FeatureWordInfo': [ 0x120, {
    'feat_names': [0x0, ['array', 32, ['pointer', ['char']]]],
    'cpuid_eax': [0x100, ['unsigned int']],
    'cpuid_needs_ecx': [0x104, ['unsigned char']],
    'cpuid_ecx': [0x108, ['unsigned int']],
    'cpuid_reg': [0x10c, ['int']],
    'tcg_features': [0x110, ['unsigned int']],
    'unmigratable_flags': [0x114, ['unsigned int']],
    'migratable_flags': [0x118, ['unsigned int']],
}],
  'AddfdInfo': [ 0x10, {
    'fdset_id': [0x0, ['long']],
    'fd': [0x8, ['long']],
}],
  'rndis_set_msg_type': [ 0x1c, {
    'MessageType': [0x0, ['unsigned int']],
    'MessageLength': [0x4, ['unsigned int']],
    'RequestID': [0x8, ['unsigned int']],
    'OID': [0xc, ['unsigned int']],
    'InformationBufferLength': [0x10, ['unsigned int']],
    'InformationBufferOffset': [0x14, ['unsigned int']],
    'DeviceVcHandle': [0x18, ['unsigned int']],
}],
  'q_obj_NetdevBridgeOptions_wrapper': [ 0x8, {
    'data': [0x0, ['pointer', ['NetdevBridgeOptions']]],
}],
  'NvdimmNfitSpa': [ 0x38, {
    'type': [0x0, ['unsigned short']],
    'length': [0x2, ['unsigned short']],
    'spa_index': [0x4, ['unsigned short']],
    'flags': [0x6, ['unsigned short']],
    'reserved': [0x8, ['unsigned int']],
    'proximity_domain': [0xc, ['unsigned int']],
    'type_guid': [0x10, ['array', 16, ['unsigned char']]],
    'spa_base': [0x20, ['unsigned long']],
    'spa_length': [0x28, ['unsigned long']],
    'mem_attr': [0x30, ['unsigned long']],
}],
  'q_obj_change_backing_file_arg': [ 0x18, {
    'device': [0x0, ['pointer', ['char']]],
    'image_node_name': [0x8, ['pointer', ['char']]],
    'backing_file': [0x10, ['pointer', ['char']]],
}],
  'SaveState': [ 0x30, {
    'handlers': [0x0, ['__unnamed_0x49ae']],
    'global_section_id': [0x10, ['int']],
    'skip_configuration': [0x14, ['unsigned char']],
    'len': [0x18, ['unsigned int']],
    'name': [0x20, ['pointer', ['char']]],
    'target_page_bits': [0x28, ['unsigned int']],
}],
  'kvm_run': [ 0x930, {
    'request_interrupt_window': [0x0, ['unsigned char']],
    'padding1': [0x1, ['array', 7, ['unsigned char']]],
    'exit_reason': [0x8, ['unsigned int']],
    'ready_for_interrupt_injection': [0xc, ['unsigned char']],
    'if_flag': [0xd, ['unsigned char']],
    'flags': [0xe, ['unsigned short']],
    'cr8': [0x10, ['unsigned long long']],
    'apic_base': [0x18, ['unsigned long long']],
    '__unnamed_0x19d5': [0x20, ['__unnamed_0x3654']],
    'kvm_valid_regs': [0x120, ['unsigned long long']],
    'kvm_dirty_regs': [0x128, ['unsigned long long']],
    's': [0x130, ['__unnamed_0x3760']],
}],
  'BlockdevOptionsReplication': [ 0x18, {
    'file': [0x0, ['pointer', ['BlockdevRef']]],
    'mode': [0x8, ['Enumeration', {'target': 'int', 'choices': {0: 'REPLICATION_MODE_PRIMARY', 1: 'REPLICATION_MODE_SECONDARY', 2: 'REPLICATION_MODE__MAX'}}]],
    'has_top_id': [0xc, ['unsigned char']],
    'top_id': [0x10, ['pointer', ['char']]],
}],
  '__unnamed_0x33b2': [ 0x18, {
    'error': [0x0, ['int']],
    'immediately': [0x4, ['int']],
    'once': [0x8, ['int']],
    'offset': [0x10, ['long']],
}],
  '__unnamed_0x2b52': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['QemuInputHandlerState']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['QemuInputHandlerState']]]],
}],
  '__unnamed_0x5359': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['kvm_sw_breakpoint']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['kvm_sw_breakpoint']]]],
}],
  'add_lvalue_reference_if_not_pointer<const llvm::Type*, void': [ 0x1, {
}],
  'RAMList': [ 0x60, {
    'mutex': [0x0, ['QemuMutex']],
    'mru_block': [0x28, ['pointer', ['RAMBlock']]],
    'blocks': [0x30, ['__unnamed_0x2115']],
    'dirty_memory': [0x38, ['array', 3, ['pointer', ['__unnamed_0x20da']]]],
    'version': [0x50, ['unsigned int']],
    'ramblock_notifiers': [0x58, ['__unnamed_0x2130']],
}],
  'ICH9SMBState': [ 0xa30, {
    'dev': [0x0, ['PCIDevice']],
    'smb': [0x8f0, ['PMSMBus']],
}],
  'BlockdevOptionsNull': [ 0x20, {
    'has_size': [0x0, ['unsigned char']],
    'size': [0x8, ['long']],
    'has_latency_ns': [0x10, ['unsigned char']],
    'latency_ns': [0x18, ['unsigned long']],
}],
  'mig_cmd_args': [ 0x10, {
    'len': [0x0, ['long']],
    'name': [0x8, ['pointer', ['char']]],
}],
  'cast_retty_impl<llvm::Constant, llvm::Value*': [ 0x1, {
}],
  '_XkbIndicatorRec': [ 0x188, {
    'phys_indicators': [0x0, ['unsigned long']],
    'maps': [0x8, ['array', 32, ['_XkbIndicatorMapRec']]],
}],
  'of_dpa_flow_fill_context': [ 0x10, {
    'list': [0x0, ['pointer', ['RockerOfDpaFlowList']]],
    'tbl_id': [0x8, ['unsigned int']],
}],
  'QIOChannelSocketDGramWorkerData': [ 0x10, {
    'localAddr': [0x0, ['pointer', ['SocketAddress']]],
    'remoteAddr': [0x8, ['pointer', ['SocketAddress']]],
}],
  '__unnamed_0x106f': [ 0x28, {
    'saddr': [0x0, ['io_iocb_sockaddr']],
    'c': [0x0, ['io_iocb_common']],
    'poll': [0x0, ['io_iocb_poll']],
    'v': [0x0, ['io_iocb_vector']],
}],
  '__unnamed_0x172e': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['CPUState']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['CPUState']]]],
}],
  'bmds_list': [ 0x10, {
    'sqh_first': [0x0, ['pointer', ['BlkMigDevState']]],
    'sqh_last': [0x8, ['pointer', ['pointer', ['BlkMigDevState']]]],
}],
  'usb_redir_alt_setting_status_header': [ 0x3, {
    'status': [0x0, ['unsigned char']],
    'interface': [0x1, ['unsigned char']],
    'alt': [0x2, ['unsigned char']],
}],
  'icmp': [ 0x1c, {
    'icmp_type': [0x0, ['unsigned char']],
    'icmp_code': [0x1, ['unsigned char']],
    'icmp_cksum': [0x2, ['unsigned short']],
    'icmp_hun': [0x4, ['__unnamed_0x1248']],
    'icmp_dun': [0x8, ['__unnamed_0x12d2']],
}],
  '__unnamed_0xb3b2': [ 0x8, {
    'block_dirty_bitmap_clear': [0x0, ['q_obj_BlockDirtyBitmap_wrapper']],
    'block_dirty_bitmap_add': [0x0, ['q_obj_BlockDirtyBitmapAdd_wrapper']],
    'drive_backup': [0x0, ['q_obj_DriveBackup_wrapper']],
    'blockdev_snapshot_sync': [0x0, ['q_obj_BlockdevSnapshotSync_wrapper']],
    'abort': [0x0, ['q_obj_Abort_wrapper']],
    'blockdev_snapshot_internal_sync': [0x0, ['q_obj_BlockdevSnapshotInternal_wrapper']],
    'blockdev_backup': [0x0, ['q_obj_BlockdevBackup_wrapper']],
    'blockdev_snapshot': [0x0, ['q_obj_BlockdevSnapshot_wrapper']],
}],
  'NetLegacyNicOptions': [ 0x48, {
    'has_netdev': [0x0, ['unsigned char']],
    'netdev': [0x8, ['pointer', ['char']]],
    'has_macaddr': [0x10, ['unsigned char']],
    'macaddr': [0x18, ['pointer', ['char']]],
    'has_model': [0x20, ['unsigned char']],
    'model': [0x28, ['pointer', ['char']]],
    'has_addr': [0x30, ['unsigned char']],
    'addr': [0x38, ['pointer', ['char']]],
    'has_vectors': [0x40, ['unsigned char']],
    'vectors': [0x44, ['unsigned int']],
}],
  'X86XSaveHeader': [ 0x40, {
    'xstate_bv': [0x0, ['unsigned long']],
    'xcomp_bv': [0x8, ['unsigned long']],
    'reserve0': [0x10, ['unsigned long']],
    'reserved': [0x18, ['array', 40, ['unsigned char']]],
}],
  'mfi_ld_params': [ 0x20, {
    'primary_raid_level': [0x0, ['unsigned char']],
    'raid_level_qualifier': [0x1, ['unsigned char']],
    'secondary_raid_level': [0x2, ['unsigned char']],
    'stripe_size': [0x3, ['unsigned char']],
    'num_drives': [0x4, ['unsigned char']],
    'span_depth': [0x5, ['unsigned char']],
    'state': [0x6, ['unsigned char']],
    'init_state': [0x7, ['unsigned char']],
    'is_consistent': [0x8, ['unsigned char']],
    'reserved': [0x9, ['array', 23, ['unsigned char']]],
}],
  'AHCICmdHdr': [ 0x20, {
    'opts': [0x0, ['unsigned short']],
    'prdtl': [0x2, ['unsigned short']],
    'status': [0x4, ['unsigned int']],
    'tbl_addr': [0x8, ['unsigned long']],
    'reserved': [0x10, ['array', 4, ['unsigned int']]],
}],
  'iterator_traits<llvm::Type* const*': [ 0x1, {
}],
  'ProtobufCMessage': [ 0x18, {
    'descriptor': [0x0, ['pointer', ['ProtobufCMessageDescriptor']]],
    'n_unknown_fields': [0x8, ['unsigned int']],
    'unknown_fields': [0x10, ['pointer', ['ProtobufCMessageUnknownField']]],
}],
  'BDRVCURLState': [ 0x1098, {
    'multi': [0x0, ['pointer', 'void']],
    'timer': [0x8, ['QEMUTimer']],
    'len': [0x38, ['unsigned long']],
    'states': [0x40, ['array', 8, ['CURLState']]],
    'url': [0x1040, ['pointer', ['char']]],
    'readahead_size': [0x1048, ['unsigned long']],
    'sslverify': [0x1050, ['unsigned char']],
    'timeout': [0x1058, ['unsigned long']],
    'cookie': [0x1060, ['pointer', ['char']]],
    'accept_range': [0x1068, ['unsigned char']],
    'aio_context': [0x1070, ['pointer', ['AioContext']]],
    'username': [0x1078, ['pointer', ['char']]],
    'password': [0x1080, ['pointer', ['char']]],
    'proxyusername': [0x1088, ['pointer', ['char']]],
    'proxypassword': [0x1090, ['pointer', ['char']]],
}],
  'elf32_phdr': [ 0x20, {
    'p_type': [0x0, ['unsigned int']],
    'p_offset': [0x4, ['unsigned int']],
    'p_vaddr': [0x8, ['unsigned int']],
    'p_paddr': [0xc, ['unsigned int']],
    'p_filesz': [0x10, ['unsigned int']],
    'p_memsz': [0x14, ['unsigned int']],
    'p_flags': [0x18, ['unsigned int']],
    'p_align': [0x1c, ['unsigned int']],
}],
  'VirtIONet': [ 0x21d0, {
    'parent_obj': [0x0, ['VirtIODevice']],
    'mac': [0xe8, ['array', 6, ['unsigned char']]],
    'status': [0xee, ['unsigned short']],
    'vqs': [0xf0, ['pointer', ['VirtIONetQueue']]],
    'ctrl_vq': [0xf8, ['pointer', ['VirtQueue']]],
    'nic': [0x100, ['pointer', ['NICState']]],
    'tx_timeout': [0x108, ['unsigned int']],
    'tx_burst': [0x10c, ['int']],
    'has_vnet_hdr': [0x110, ['unsigned int']],
    'host_hdr_len': [0x118, ['unsigned long']],
    'guest_hdr_len': [0x120, ['unsigned long']],
    'host_features': [0x128, ['unsigned int']],
    'has_ufo': [0x12c, ['unsigned char']],
    'mergeable_rx_bufs': [0x130, ['int']],
    'promisc': [0x134, ['unsigned char']],
    'allmulti': [0x135, ['unsigned char']],
    'alluni': [0x136, ['unsigned char']],
    'nomulti': [0x137, ['unsigned char']],
    'nouni': [0x138, ['unsigned char']],
    'nobcast': [0x139, ['unsigned char']],
    'vhost_started': [0x13a, ['unsigned char']],
    'mac_table': [0x140, ['__unnamed_0x6fb6']],
    'vlans': [0x158, ['pointer', ['unsigned int']]],
    'net_conf': [0x160, ['virtio_net_conf']],
    'nic_conf': [0x178, ['NICConf']],
    'qdev': [0x2190, ['pointer', ['DeviceState']]],
    'multiqueue': [0x2198, ['int']],
    'max_queues': [0x219c, ['unsigned short']],
    'curr_queues': [0x219e, ['unsigned short']],
    'config_size': [0x21a0, ['unsigned long']],
    'netclient_name': [0x21a8, ['pointer', ['char']]],
    'netclient_type': [0x21b0, ['pointer', ['char']]],
    'curr_guest_offloads': [0x21b8, ['unsigned long']],
    'announce_timer': [0x21c0, ['pointer', ['QEMUTimer']]],
    'announce_counter': [0x21c8, ['int']],
    'needs_vnet_hdr_swap': [0x21cc, ['unsigned char']],
}],
  'of_dpa_group_fill_context': [ 0x10, {
    'list': [0x0, ['pointer', ['RockerOfDpaGroupList']]],
    'type': [0x8, ['unsigned char']],
}],
  'VirtIOBlkPCI': [ 0x8590, {
    'parent_obj': [0x0, ['VirtIOPCIProxy']],
    'vdev': [0x8410, ['VirtIOBlock']],
}],
  'blkif_x86_32_sring_entry': [ 0x6c, {
    'req': [0x0, ['blkif_x86_32_request']],
    'rsp': [0x0, ['blkif_x86_32_response']],
}],
  '__unnamed_0x1be5': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['Chardev']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['Chardev']]]],
}],
  'q_obj_BLOCK_WRITE_THRESHOLD_arg': [ 0x18, {
    'node_name': [0x0, ['pointer', ['char']]],
    'amount_exceeded': [0x8, ['unsigned long']],
    'write_threshold': [0x10, ['unsigned long']],
}],
  '__unnamed_0x33ba': [ 0x4, {
    'reserved': [0x0, ['unsigned int']],
    'trailing_bytes': [0x0, ['unsigned int']],
}],
  '__unnamed_0x411f': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['DriveInfo']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['DriveInfo']]]],
}],
  'SHPCDevice': [ 0x140, {
    'cap': [0x0, ['int']],
    'nslots': [0x4, ['int']],
    'config': [0x8, ['pointer', ['unsigned char']]],
    'cmask': [0x10, ['pointer', ['unsigned char']]],
    'wmask': [0x18, ['pointer', ['unsigned char']]],
    'w1cmask': [0x20, ['pointer', ['unsigned char']]],
    'mmio': [0x30, ['MemoryRegion']],
    'sec_bus': [0x130, ['pointer', ['PCIBus']]],
    'msi_requested': [0x138, ['int']],
}],
  'VirtIOPCIProxy': [ 0x8410, {
    'pci_dev': [0x0, ['PCIDevice']],
    'bar': [0x8f0, ['MemoryRegion']],
    'common': [0x9f0, ['VirtIOPCIRegion']],
    'isr': [0xb00, ['VirtIOPCIRegion']],
    'device': [0xc10, ['VirtIOPCIRegion']],
    'notify': [0xd20, ['VirtIOPCIRegion']],
    'notify_pio': [0xe30, ['VirtIOPCIRegion']],
    'modern_bar': [0xf40, ['MemoryRegion']],
    'io_bar': [0x1040, ['MemoryRegion']],
    'modern_cfg': [0x1140, ['MemoryRegion']],
    'modern_as': [0x1240, ['AddressSpace']],
    'legacy_io_bar_idx': [0x1350, ['unsigned int']],
    'msix_bar_idx': [0x1354, ['unsigned int']],
    'modern_io_bar_idx': [0x1358, ['unsigned int']],
    'modern_mem_bar_idx': [0x135c, ['unsigned int']],
    'config_cap': [0x1360, ['int']],
    'flags': [0x1364, ['unsigned int']],
    'disable_modern': [0x1368, ['unsigned char']],
    'ignore_backend_features': [0x1369, ['unsigned char']],
    'disable_legacy': [0x136c, ['Enumeration', {'target': 'int', 'choices': {0: 'ON_OFF_AUTO_AUTO', 1: 'ON_OFF_AUTO_ON', 2: 'ON_OFF_AUTO_OFF', 3: 'ON_OFF_AUTO__MAX'}}]],
    'class_code': [0x1370, ['unsigned int']],
    'nvectors': [0x1374, ['unsigned int']],
    'dfselect': [0x1378, ['unsigned int']],
    'gfselect': [0x137c, ['unsigned int']],
    'guest_features': [0x1380, ['array', 2, ['unsigned int']]],
    'vqs': [0x1388, ['array', 1024, ['VirtIOPCIQueue']]],
    'vector_irqfd': [0x8388, ['pointer', ['__unnamed_0xa2ca']]],
    'nvqs_with_notifiers': [0x8390, ['int']],
    'bus': [0x8398, ['VirtioBusState']],
}],
  'iterator<std::forward_iterator_tag, llvm::User*, long int, llvm::User**, llvm::User*&': [ 0x1, {
}],
  'q_obj_BLOCK_JOB_COMPLETED_arg': [ 0x38, {
    'type': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'BLOCK_JOB_TYPE_COMMIT', 1: 'BLOCK_JOB_TYPE_STREAM', 2: 'BLOCK_JOB_TYPE_MIRROR', 3: 'BLOCK_JOB_TYPE_BACKUP', 4: 'BLOCK_JOB_TYPE__MAX'}}]],
    'device': [0x8, ['pointer', ['char']]],
    'len': [0x10, ['long']],
    'offset': [0x18, ['long']],
    'speed': [0x20, ['long']],
    'has_error': [0x28, ['unsigned char']],
    'error': [0x30, ['pointer', ['char']]],
}],
  'enable_if_c<true, llvm::Value*': [ 0x1, {
}],
  '__unnamed_0x201d': [ 0x84, {
    'quantval': [0x0, ['array', 64, ['unsigned short']]],
    'sent_table': [0x80, ['int']],
}],
  'guest_primary': [ 0x48, {
    'surface': [0x0, ['QXLSurfaceCreate']],
    'commands': [0x28, ['unsigned int']],
    'resized': [0x2c, ['unsigned int']],
    'qxl_stride': [0x30, ['int']],
    'abs_stride': [0x34, ['unsigned int']],
    'bits_pp': [0x38, ['unsigned int']],
    'bytes_pp': [0x3c, ['unsigned int']],
    'data': [0x40, ['pointer', ['unsigned char']]],
}],
  '__unnamed_0x1d0b': [ 0x220, {
    'inquire': [0x0, ['int']],
    'periodic': [0x4, ['int']],
    'responses_left': [0x8, ['int']],
    'responses': [0xc, ['int']],
    'inquiry_done': [0x10, ['pointer', ['QEMUTimer']]],
    'inquiry_next': [0x18, ['pointer', ['QEMUTimer']]],
    'inquiry_length': [0x20, ['int']],
    'inquiry_period': [0x24, ['int']],
    'inquiry_mode': [0x28, ['int']],
    'handle': [0x30, ['array', 16, ['bt_hci_master_link_s']]],
    'role_bmp': [0x1b0, ['unsigned int']],
    'last_handle': [0x1b4, ['int']],
    'connecting': [0x1b8, ['int']],
    'awaiting_bdaddr': [0x1bc, ['array', 16, ['__unnamed_0xa1b']]],
}],
  'PCIEAERLog': [ 0x10, {
    'log_num': [0x0, ['unsigned short']],
    'log_max': [0x2, ['unsigned short']],
    'log': [0x8, ['pointer', ['PCIEAERErr']]],
}],
  'SheepdogVdiReq': [ 0x30, {
    'proto_ver': [0x0, ['unsigned char']],
    'opcode': [0x1, ['unsigned char']],
    'flags': [0x2, ['unsigned short']],
    'epoch': [0x4, ['unsigned int']],
    'id': [0x8, ['unsigned int']],
    'data_length': [0xc, ['unsigned int']],
    'vdi_size': [0x10, ['unsigned long']],
    'base_vdi_id': [0x18, ['unsigned int']],
    'copies': [0x1c, ['unsigned char']],
    'copy_policy': [0x1d, ['unsigned char']],
    'store_policy': [0x1e, ['unsigned char']],
    'block_size_shift': [0x1f, ['unsigned char']],
    'snapid': [0x20, ['unsigned int']],
    'type': [0x24, ['unsigned int']],
    'pad': [0x28, ['array', 2, ['unsigned int']]],
}],
  'q_obj_transaction_arg': [ 0x18, {
    'actions': [0x0, ['pointer', ['TransactionActionList']]],
    'has_properties': [0x8, ['unsigned char']],
    'properties': [0x10, ['pointer', ['TransactionProperties']]],
}],
  'ip6_header': [ 0x28, {
    'ip6_ctlun': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'IF_IDE', 1: 'IF_NONE', 2: 'IF_SCSI', 3: 'IF_FLOPPY', 4: 'IF_PFLASH', 5: 'IF_MTD', 6: 'IF_SD', 7: 'IF_VIRTIO', 8: 'IF_XEN', 9: 'IF_COUNT', 18446744073709551615L: 'IF_DEFAULT'}}]],
    'ip6_src': [0x8, ['in6_address']],
    'ip6_dst': [0x18, ['in6_address']],
}],
  '_XkbMessageAction': [ 0x8, {
    'type': [0x0, ['unsigned char']],
    'flags': [0x1, ['unsigned char']],
    'message': [0x2, ['array', 6, ['unsigned char']]],
}],
  'QXLCompatDrawable': [ 0x80, {
    'release_info': [0x0, ['QXLReleaseInfo']],
    'effect': [0x8, ['unsigned char']],
    'type': [0x9, ['unsigned char']],
    'bitmap_offset': [0xa, ['unsigned short']],
    'bitmap_area': [0xc, ['QXLRect']],
    'bbox': [0x1c, ['QXLRect']],
    'clip': [0x2c, ['QXLClip']],
    'mm_time': [0x38, ['unsigned int']],
    'u': [0x3c, ['__unnamed_0x3e2e']],
}],
  'vfio_irq_set': [ 0x14, {
    'argsz': [0x0, ['unsigned int']],
    'flags': [0x4, ['unsigned int']],
    'index': [0x8, ['unsigned int']],
    'start': [0xc, ['unsigned int']],
    'count': [0x10, ['unsigned int']],
    'data': [0x14, ['array', 0, ['unsigned char']]],
}],
  '__unnamed_0x729': [ 0x8, {
    'ru_maxrss': [0x0, ['long']],
    '__ru_maxrss_word': [0x0, ['long']],
}],
  'MegasasInfo': [ 0x48, {
    'name': [0x0, ['pointer', ['char']]],
    'desc': [0x8, ['pointer', ['char']]],
    'product_name': [0x10, ['pointer', ['char']]],
    'product_version': [0x18, ['pointer', ['char']]],
    'device_id': [0x20, ['unsigned short']],
    'subsystem_id': [0x22, ['unsigned short']],
    'ioport_bar': [0x24, ['int']],
    'mmio_bar': [0x28, ['int']],
    'is_express': [0x2c, ['unsigned char']],
    'osts': [0x30, ['int']],
    'vmsd': [0x38, ['pointer', ['VMStateDescription']]],
    'props': [0x40, ['pointer', ['Property']]],
}],
  'VncRectEntry': [ 0x20, {
    'rect': [0x0, ['VncRect']],
    'next': [0x10, ['__unnamed_0x2589']],
}],
  'timezone': [ 0x8, {
    'tz_minuteswest': [0x0, ['int']],
    'tz_dsttime': [0x4, ['int']],
}],
  'MemTxAttrs': [ 0x4, {
    'requester_id': [0x0, ['BitField', {'end_bit': 19, 'start_bit': 3}]],
    'secure': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'unspecified': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'user': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
}],
  'QXLSurface': [ 0x18, {
    'format': [0x0, ['unsigned int']],
    'width': [0x4, ['unsigned int']],
    'height': [0x8, ['unsigned int']],
    'stride': [0xc, ['int']],
    'data': [0x10, ['unsigned long']],
}],
  'VirtConsole': [ 0x108, {
    'parent_obj': [0x0, ['VirtIOSerialPort']],
    'chr': [0xd0, ['CharBackend']],
    'watch': [0x100, ['unsigned int']],
}],
  '__unnamed_0x1891': [ 0x8, {
    'i': [0x0, ['unsigned long']],
    'p': [0x0, ['pointer', ['void']]],
}],
  '__unnamed_0x2369': [ 0x10, {
    'le_next': [0x0, ['pointer', ['NamedGPIOList']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['NamedGPIOList']]]],
}],
  'q_obj_query_rocker_arg': [ 0x8, {
    'name': [0x0, ['pointer', ['char']]],
}],
  'kvm_one_reg': [ 0x10, {
    'id': [0x0, ['unsigned long long']],
    'addr': [0x8, ['unsigned long long']],
}],
  '__unnamed_0x349a': [ 0xc, {
    'dcrn': [0x0, ['unsigned int']],
    'data': [0x4, ['unsigned int']],
    'is_write': [0x8, ['unsigned char']],
}],
  '__iterator_traits<llvm::ilist_iterator<const llvm::Instruction': [ 0x1, {
}],
  'SCSIReqOps': [ 0x40, {
    'size': [0x0, ['unsigned long']],
    'free_req': [0x8, ['pointer', ['void']]],
    'send_command': [0x10, ['pointer', ['void']]],
    'read_data': [0x18, ['pointer', ['void']]],
    'write_data': [0x20, ['pointer', ['void']]],
    'get_buf': [0x28, ['pointer', ['void']]],
    'save_request': [0x30, ['pointer', ['void']]],
    'load_request': [0x38, ['pointer', ['void']]],
}],
  'rebind<unsigned int': [ 0x1, {
}],
  '__unnamed_0x3760': [ 0x800, {
    'padding': [0x0, ['array', 2048, ['char']]],
    'regs': [0x0, ['kvm_sync_regs']],
}],
  'QCryptoCipherNettle': [ 0x40, {
    'ctx': [0x0, ['pointer', ['void']]],
    'ctx_tweak': [0x8, ['pointer', ['void']]],
    'alg_encrypt_native': [0x10, ['pointer', ['void']]],
    'alg_decrypt_native': [0x18, ['pointer', ['void']]],
    'alg_encrypt_wrapper': [0x20, ['pointer', ['void']]],
    'alg_decrypt_wrapper': [0x28, ['pointer', ['void']]],
    'iv': [0x30, ['pointer', ['unsigned char']]],
    'blocksize': [0x38, ['unsigned long']],
}],
  'KVMCapabilityInfo': [ 0x10, {
    'name': [0x0, ['pointer', ['char']]],
    'value': [0x8, ['int']],
}],
  'RngRequest': [ 0x30, {
    'receive_entropy': [0x0, ['pointer', ['void']]],
    'data': [0x8, ['pointer', ['unsigned char']]],
    'opaque': [0x10, ['pointer', ['void']]],
    'offset': [0x18, ['unsigned long']],
    'size': [0x20, ['unsigned long']],
    'next': [0x28, ['__unnamed_0x84df']],
}],
  '__unnamed_0x316a': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['BdrvChild']]],
}],
  'CPUIOTLBEntry': [ 0x10, {
    'addr': [0x0, ['unsigned long']],
    'attrs': [0x8, ['MemTxAttrs']],
}],
  'dirent': [ 0x118, {
    'd_ino': [0x0, ['unsigned long']],
    'd_off': [0x8, ['long']],
    'd_reclen': [0x10, ['unsigned short']],
    'd_type': [0x12, ['unsigned char']],
    'd_name': [0x13, ['array', 256, ['char']]],
}],
  'UHCIInfo': [ 0x20, {
    'name': [0x0, ['pointer', ['char']]],
    'vendor_id': [0x8, ['unsigned short']],
    'device_id': [0xa, ['unsigned short']],
    'revision': [0xc, ['unsigned char']],
    'irq_pin': [0xd, ['unsigned char']],
    'realize': [0x10, ['pointer', ['void']]],
    'unplug': [0x18, ['unsigned char']],
}],
  'MemoryGroup': [ 0x240, {
    'AllocatedMem': [0x0, ['void']],
    'FreeMem': [0x118, ['void']],
    'Near': [0x230, ['void']],
}],
  'BlockJobInfo': [ 0x38, {
    'type': [0x0, ['pointer', ['char']]],
    'device': [0x8, ['pointer', ['char']]],
    'len': [0x10, ['long']],
    'offset': [0x18, ['long']],
    'busy': [0x20, ['unsigned char']],
    'paused': [0x21, ['unsigned char']],
    'speed': [0x28, ['long']],
    'io_status': [0x30, ['Enumeration', {'target': 'int', 'choices': {0: 'BLOCK_DEVICE_IO_STATUS_OK', 1: 'BLOCK_DEVICE_IO_STATUS_FAILED', 2: 'BLOCK_DEVICE_IO_STATUS_NOSPACE', 3: 'BLOCK_DEVICE_IO_STATUS__MAX'}}]],
    'ready': [0x34, ['unsigned char']],
}],
  '__unnamed_0x3d97': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['MTPObject']]],
}],
  'USBDescID': [ 0xa, {
    'idVendor': [0x0, ['unsigned short']],
    'idProduct': [0x2, ['unsigned short']],
    'bcdDevice': [0x4, ['unsigned short']],
    'iManufacturer': [0x6, ['unsigned char']],
    'iProduct': [0x7, ['unsigned char']],
    'iSerialNumber': [0x8, ['unsigned char']],
}],
  '__unnamed_0x2fa4': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['AddressSpace']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['AddressSpace']]]],
}],
  'AMDVIAddressSpace': [ 0x320, {
    'bus_num': [0x0, ['unsigned char']],
    'devfn': [0x1, ['unsigned char']],
    'iommu_state': [0x8, ['pointer', ['AMDVIState']]],
    'iommu': [0x10, ['MemoryRegion']],
    'iommu_ir': [0x110, ['MemoryRegion']],
    'as': [0x210, ['AddressSpace']],
}],
  'q_obj_qom_set_arg': [ 0x18, {
    'path': [0x0, ['pointer', ['char']]],
    'property': [0x8, ['pointer', ['char']]],
    'value': [0x10, ['pointer', ['QObject']]],
}],
  'mbuf_ptr': [ 0x8, {
    'mptr': [0x0, ['pointer', ['mbuf']]],
}],
  'ObjectPropertyIterator': [ 0x30, {
    'nextclass': [0x0, ['pointer', ['ObjectClass']]],
    'iter': [0x8, ['_GHashTableIter']],
}],
  '__unnamed_0x1a58': [ 0x10, {
    'le_next': [0x0, ['pointer', ['IOMMUNotifier']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['IOMMUNotifier']]]],
}],
  'QEMUClock': [ 0x20, {
    'timerlists': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'MODULE_INIT_BLOCK', 1: 'MODULE_INIT_OPTS', 2: 'MODULE_INIT_QAPI', 3: 'MODULE_INIT_QOM', 4: 'MODULE_INIT_TRACE', 5: 'MODULE_INIT_MAX'}}]],
    'reset_notifiers': [0x8, ['NotifierList']],
    'last': [0x10, ['long']],
    'type': [0x18, ['Enumeration', {'target': 'int', 'choices': {0: 'QEMU_CLOCK_REALTIME', 1: 'QEMU_CLOCK_VIRTUAL', 2: 'QEMU_CLOCK_HOST', 3: 'QEMU_CLOCK_VIRTUAL_RT', 4: 'QEMU_CLOCK_MAX'}}]],
    'enabled': [0x1c, ['unsigned char']],
}],
  'tcpiphdr_2': [ 0x48, {
    'dummy': [0x0, ['tcpiphdr']],
    'first_char': [0x44, ['char']],
}],
  'NvdimmDsmIn': [ 0x1000, {
    'handle': [0x0, ['unsigned int']],
    'revision': [0x4, ['unsigned int']],
    'function': [0x8, ['unsigned int']],
    '__unnamed_0x2e31': [0xc, ['__unnamed_0x2dd4']],
}],
  'Slirp': [ 0x1718, {
    'entry': [0x0, ['__unnamed_0x1325']],
    'time_fasttimo': [0x10, ['unsigned int']],
    'last_slowtimo': [0x14, ['unsigned int']],
    'do_slowtimo': [0x18, ['unsigned char']],
    'in_enabled': [0x19, ['unsigned char']],
    'in6_enabled': [0x1a, ['unsigned char']],
    'vnetwork_addr': [0x1c, ['in_addr']],
    'vnetwork_mask': [0x20, ['in_addr']],
    'vhost_addr': [0x24, ['in_addr']],
    'vprefix_addr6': [0x28, ['in6_addr']],
    'vprefix_len': [0x38, ['unsigned char']],
    'vhost_addr6': [0x3c, ['in6_addr']],
    'vdhcp_startaddr': [0x4c, ['in_addr']],
    'vnameserver_addr': [0x50, ['in_addr']],
    'vnameserver_addr6': [0x54, ['in6_addr']],
    'client_ipaddr': [0x64, ['in_addr']],
    'client_hostname': [0x68, ['array', 33, ['char']]],
    'restricted': [0x8c, ['int']],
    'exec_list': [0x90, ['pointer', ['ex_list']]],
    'm_freelist': [0x98, ['slirp_quehead']],
    'm_usedlist': [0xa8, ['slirp_quehead']],
    'mbuf_alloced': [0xb8, ['int']],
    'if_fastq': [0xc0, ['slirp_quehead']],
    'if_batchq': [0xd0, ['slirp_quehead']],
    'next_m': [0xe0, ['pointer', ['mbuf']]],
    'if_start_busy': [0xe8, ['unsigned char']],
    'ipq': [0xe9, ['ipq']],
    'ip_id': [0x116, ['unsigned short']],
    'bootp_clients': [0x118, ['array', 16, ['__unnamed_0x116b']]],
    'bootp_filename': [0x198, ['pointer', ['char']]],
    'vdnssearch_len': [0x1a0, ['unsigned long']],
    'vdnssearch': [0x1a8, ['pointer', ['unsigned char']]],
    'tcb': [0x1b0, ['socket']],
    'tcp_last_so': [0x350, ['pointer', ['socket']]],
    'tcp_iss': [0x358, ['unsigned int']],
    'tcp_now': [0x35c, ['unsigned int']],
    'udb': [0x360, ['socket']],
    'udp_last_so': [0x500, ['pointer', ['socket']]],
    'icmp': [0x508, ['socket']],
    'icmp_last_so': [0x6a8, ['pointer', ['socket']]],
    'tftp_prefix': [0x6b0, ['pointer', ['char']]],
    'tftp_sessions': [0x6b8, ['array', 20, ['tftp_session']]],
    'arp_table': [0x13d8, ['ArpTable']],
    'ndp_table': [0x159c, ['NdpTable']],
    'grand': [0x1700, ['pointer', ['_GRand']]],
    'ra_timer': [0x1708, ['pointer', ['QEMUTimer']]],
    'opaque': [0x1710, ['pointer', ['void']]],
}],
  'cast_retty_wrap<llvm::Function, const llvm::Use, llvm::Value*': [ 0x1, {
}],
  '__unnamed_0x31db': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['BdrvChild']]],
}],
  'rusage': [ 0x90, {
    'ru_utime': [0x0, ['timeval']],
    'ru_stime': [0x10, ['timeval']],
    '__unnamed_0x90b': [0x20, ['__unnamed_0x729']],
    '__unnamed_0x911': [0x28, ['__unnamed_0x748']],
    '__unnamed_0x917': [0x30, ['__unnamed_0x767']],
    '__unnamed_0x91d': [0x38, ['__unnamed_0x786']],
    '__unnamed_0x923': [0x40, ['__unnamed_0x7a5']],
    '__unnamed_0x929': [0x48, ['__unnamed_0x7c4']],
    '__unnamed_0x92f': [0x50, ['__unnamed_0x7e3']],
    '__unnamed_0x935': [0x58, ['__unnamed_0x802']],
    '__unnamed_0x93b': [0x60, ['__unnamed_0x821']],
    '__unnamed_0x941': [0x68, ['__unnamed_0x840']],
    '__unnamed_0x947': [0x70, ['__unnamed_0x85f']],
    '__unnamed_0x94d': [0x78, ['__unnamed_0x881']],
    '__unnamed_0x953': [0x80, ['__unnamed_0x8a3']],
    '__unnamed_0x959': [0x88, ['__unnamed_0x8c5']],
}],
  '__unnamed_0x3014': [ 0x10, {
    'le_next': [0x0, ['pointer', ['BdrvChild']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['BdrvChild']]]],
}],
  'VFIOrtl8168Quirk': [ 0x18, {
    'vdev': [0x0, ['pointer', ['VFIOPCIDevice']]],
    'addr': [0x8, ['unsigned int']],
    'data': [0xc, ['unsigned int']],
    'enabled': [0x10, ['unsigned char']],
}],
  'VirtIOBalloon': [ 0x170, {
    'parent_obj': [0x0, ['VirtIODevice']],
    'ivq': [0xe8, ['pointer', ['VirtQueue']]],
    'dvq': [0xf0, ['pointer', ['VirtQueue']]],
    'svq': [0xf8, ['pointer', ['VirtQueue']]],
    'num_pages': [0x100, ['unsigned int']],
    'actual': [0x104, ['unsigned int']],
    'stats': [0x108, ['array', 7, ['unsigned long']]],
    'stats_vq_elem': [0x140, ['pointer', ['VirtQueueElement']]],
    'stats_vq_offset': [0x148, ['unsigned long']],
    'stats_timer': [0x150, ['pointer', ['QEMUTimer']]],
    'stats_last_update': [0x158, ['long']],
    'stats_poll_interval': [0x160, ['long']],
    'host_features': [0x168, ['unsigned int']],
}],
  'WatchdogTimerModel': [ 0x20, {
    'entry': [0x0, ['__unnamed_0x14b7']],
    'wdt_name': [0x10, ['pointer', ['char']]],
    'wdt_description': [0x18, ['pointer', ['char']]],
}],
  'NvmeRequest': [ 0x78, {
    'sq': [0x0, ['pointer', ['NvmeSQueue']]],
    'aiocb': [0x8, ['pointer', ['BlockAIOCB']]],
    'status': [0x10, ['unsigned short']],
    'has_sg': [0x12, ['unsigned char']],
    'cqe': [0x14, ['NvmeCqe']],
    'acct': [0x28, ['BlockAcctCookie']],
    'qsg': [0x40, ['QEMUSGList']],
    'entry': [0x68, ['__unnamed_0x5f24']],
}],
  'PCDIMMDeviceClass': [ 0xd8, {
    'parent_class': [0x0, ['DeviceClass']],
    'realize': [0xc0, ['pointer', ['void']]],
    'get_memory_region': [0xc8, ['pointer', ['void']]],
    'get_vmstate_memory_region': [0xd0, ['pointer', ['void']]],
}],
  '__alloc_traits<std::allocator<std::pair<const std::__cxx11::basic_string<char, std::char_traits<char': [ 0x1, {
}],
  'packets': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['NetPacket']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['NetPacket']]]],
}],
  'virtio_gpu_resource_unref': [ 0x20, {
    'hdr': [0x0, ['virtio_gpu_ctrl_hdr']],
    'resource_id': [0x18, ['unsigned int']],
    'padding': [0x1c, ['unsigned int']],
}],
  'PCIESPState': [ 0xb50, {
    'parent_obj': [0x0, ['PCIDevice']],
    'io': [0x8f0, ['MemoryRegion']],
    'dma_regs': [0x9f0, ['array', 8, ['unsigned int']]],
    'sbac': [0xa10, ['unsigned int']],
    'esp': [0xa18, ['ESPState']],
}],
  'remove_reference<long int&': [ 0x1, {
}],
  'I2CSlaveClass': [ 0xe0, {
    'parent_class': [0x0, ['DeviceClass']],
    'init': [0xc0, ['pointer', ['void']]],
    'send': [0xc8, ['pointer', ['void']]],
    'recv': [0xd0, ['pointer', ['void']]],
    'event': [0xd8, ['pointer', ['void']]],
}],
  'BlockDirtyBitmapState': [ 0x50, {
    'common': [0x0, ['BlkActionState']],
    'bitmap': [0x28, ['pointer', ['BdrvDirtyBitmap']]],
    'bs': [0x30, ['pointer', ['BlockDriverState']]],
    'aio_context': [0x38, ['pointer', ['AioContext']]],
    'backup': [0x40, ['pointer', ['HBitmap']]],
    'prepared': [0x48, ['unsigned char']],
}],
  '_Iter_base<const llvm::LayoutAlignElem*, false': [ 0x1, {
}],
  'isa_impl_wrap<llvm::Constant, const llvm::Value*, const llvm::Value*': [ 0x1, {
}],
  'rcu_head': [ 0x10, {
    'next': [0x0, ['pointer', ['rcu_head']]],
    'func': [0x8, ['pointer', ['void']]],
}],
  'SheepdogAIOCB': [ 0x58, {
    's': [0x0, ['pointer', ['BDRVSheepdogState']]],
    'qiov': [0x8, ['pointer', ['QEMUIOVector']]],
    'sector_num': [0x10, ['long']],
    'nb_sectors': [0x18, ['int']],
    'ret': [0x1c, ['int']],
    'aiocb_type': [0x20, ['Enumeration', {'target': 'int', 'choices': {0: 'AIOCB_WRITE_UDATA', 1: 'AIOCB_READ_UDATA', 2: 'AIOCB_FLUSH_CACHE', 3: 'AIOCB_DISCARD_OBJ'}}]],
    'coroutine': [0x28, ['pointer', ['Coroutine']]],
    'nr_pending': [0x30, ['int']],
    'min_affect_data_idx': [0x34, ['unsigned int']],
    'max_affect_data_idx': [0x38, ['unsigned int']],
    'min_dirty_data_idx': [0x3c, ['unsigned int']],
    'max_dirty_data_idx': [0x40, ['unsigned int']],
    'aiocb_siblings': [0x48, ['__unnamed_0x3af1']],
}],
  'isa_impl_wrap<llvm::Function, llvm::Value*, llvm::Value*': [ 0x1, {
}],
  'QIODNSResolver': [ 0x28, {
    'parent': [0x0, ['Object']],
}],
  'ChardevSocket': [ 0x48, {
    'has_logfile': [0x0, ['unsigned char']],
    'logfile': [0x8, ['pointer', ['char']]],
    'has_logappend': [0x10, ['unsigned char']],
    'logappend': [0x11, ['unsigned char']],
    'addr': [0x18, ['pointer', ['SocketAddress']]],
    'has_tls_creds': [0x20, ['unsigned char']],
    'tls_creds': [0x28, ['pointer', ['char']]],
    'has_server': [0x30, ['unsigned char']],
    'server': [0x31, ['unsigned char']],
    'has_wait': [0x32, ['unsigned char']],
    'wait': [0x33, ['unsigned char']],
    'has_nodelay': [0x34, ['unsigned char']],
    'nodelay': [0x35, ['unsigned char']],
    'has_telnet': [0x36, ['unsigned char']],
    'telnet': [0x37, ['unsigned char']],
    'has_reconnect': [0x38, ['unsigned char']],
    'reconnect': [0x40, ['long']],
}],
  'TimedAverageWindow': [ 0x28, {
    'min': [0x0, ['unsigned long']],
    'max': [0x8, ['unsigned long']],
    'sum': [0x10, ['unsigned long']],
    'count': [0x18, ['unsigned long']],
    'expiration': [0x20, ['long']],
}],
  'HotplugHandler': [ 0x28, {
    'Parent': [0x0, ['Object']],
}],
  'slirp_tcphdr': [ 0x14, {
    'th_sport': [0x0, ['unsigned short']],
    'th_dport': [0x2, ['unsigned short']],
    'th_seq': [0x4, ['unsigned int']],
    'th_ack': [0x8, ['unsigned int']],
    'th_x2': [0xc, ['BitField', {'end_bit': 4, 'start_bit': 0}]],
    'th_off': [0xc, ['BitField', {'end_bit': 8, 'start_bit': 4}]],
    'th_flags': [0xd, ['unsigned char']],
    'th_win': [0xe, ['unsigned short']],
    'th_sum': [0x10, ['unsigned short']],
    'th_urp': [0x12, ['unsigned short']],
}],
  'uffd_msg': [ 0x20, {
    'event': [0x0, ['unsigned char']],
    'reserved1': [0x1, ['unsigned char']],
    'reserved2': [0x2, ['unsigned short']],
    'reserved3': [0x4, ['unsigned int']],
    'arg': [0x8, ['__unnamed_0x1cae']],
}],
  '__unnamed_0x1453': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['CPUWatchpoint']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['CPUWatchpoint']]]],
}],
  'QuorumChildRequest': [ 0x38, {
    'bs': [0x0, ['pointer', ['BlockDriverState']]],
    'qiov': [0x8, ['QEMUIOVector']],
    'buf': [0x20, ['pointer', ['unsigned char']]],
    'ret': [0x28, ['int']],
    'parent': [0x30, ['pointer', ['QuorumAIOCB']]],
}],
  'X86CPU': [ 0x12390, {
    'parent_obj': [0x0, ['CPUState']],
    'env': [0x82a0, ['CPUX86State']],
    'hyperv_vapic': [0x122c0, ['unsigned char']],
    'hyperv_relaxed_timing': [0x122c1, ['unsigned char']],
    'hyperv_spinlock_attempts': [0x122c4, ['int']],
    'hyperv_vendor_id': [0x122c8, ['pointer', ['char']]],
    'hyperv_time': [0x122d0, ['unsigned char']],
    'hyperv_crash': [0x122d1, ['unsigned char']],
    'hyperv_reset': [0x122d2, ['unsigned char']],
    'hyperv_vpindex': [0x122d3, ['unsigned char']],
    'hyperv_runtime': [0x122d4, ['unsigned char']],
    'hyperv_synic': [0x122d5, ['unsigned char']],
    'hyperv_stimer': [0x122d6, ['unsigned char']],
    'check_cpuid': [0x122d7, ['unsigned char']],
    'enforce_cpuid': [0x122d8, ['unsigned char']],
    'expose_kvm': [0x122d9, ['unsigned char']],
    'migratable': [0x122da, ['unsigned char']],
    'host_features': [0x122db, ['unsigned char']],
    'apic_id': [0x122dc, ['unsigned int']],
    'vmware_cpuid_freq': [0x122e0, ['unsigned char']],
    'cache_info_passthrough': [0x122e1, ['unsigned char']],
    'filtered_features': [0x122e4, ['array', 18, ['unsigned int']]],
    'enable_pmu': [0x1232c, ['unsigned char']],
    'enable_lmce': [0x1232d, ['unsigned char']],
    'enable_l3_cache': [0x1232e, ['unsigned char']],
    'enable_cpuid_0xb': [0x1232f, ['unsigned char']],
    'full_cpuid_auto_level': [0x12330, ['unsigned char']],
    'fill_mtrr_mask': [0x12331, ['unsigned char']],
    'host_phys_bits': [0x12332, ['unsigned char']],
    'phys_bits': [0x12334, ['unsigned int']],
    'apic_state': [0x12338, ['pointer', ['DeviceState']]],
    'cpu_as_root': [0x12340, ['pointer', ['MemoryRegion']]],
    'cpu_as_mem': [0x12348, ['pointer', ['MemoryRegion']]],
    'smram': [0x12350, ['pointer', ['MemoryRegion']]],
    'machine_done': [0x12358, ['Notifier']],
    'kvm_msr_buf': [0x12370, ['pointer', ['kvm_msrs']]],
    'socket_id': [0x12378, ['int']],
    'core_id': [0x1237c, ['int']],
    'thread_id': [0x12380, ['int']],
}],
  'xenkbd_position': [ 0x10, {
    'type': [0x0, ['unsigned char']],
    'abs_x': [0x4, ['int']],
    'abs_y': [0x8, ['int']],
    'rel_z': [0xc, ['int']],
}],
  'CryptoDevBackendPeers': [ 0x208, {
    'ccs': [0x0, ['array', 64, ['pointer', ['CryptoDevBackendClient']]]],
    'queues': [0x200, ['unsigned int']],
}],
  'ProtobufCMessageDescriptor': [ 0x78, {
    'magic': [0x0, ['unsigned int']],
    'name': [0x8, ['pointer', ['char']]],
    'short_name': [0x10, ['pointer', ['char']]],
    'c_name': [0x18, ['pointer', ['char']]],
    'package_name': [0x20, ['pointer', ['char']]],
    'sizeof_message': [0x28, ['unsigned long']],
    'n_fields': [0x30, ['unsigned int']],
    'fields': [0x38, ['pointer', ['ProtobufCFieldDescriptor']]],
    'fields_sorted_by_name': [0x40, ['pointer', ['unsigned int']]],
    'n_field_ranges': [0x48, ['unsigned int']],
    'field_ranges': [0x50, ['pointer', ['ProtobufCIntRange']]],
    'message_init': [0x58, ['pointer', ['void']]],
    'reserved1': [0x60, ['pointer', ['void']]],
    'reserved2': [0x68, ['pointer', ['void']]],
    'reserved3': [0x70, ['pointer', ['void']]],
}],
  'PXBBus': [ 0x900, {
    'parent_obj': [0x0, ['PCIBus']],
    'bus_path': [0x8f8, ['array', 8, ['char']]],
}],
  'VCChardev': [ 0x98, {
    'parent': [0x0, ['Chardev']],
    'console': [0x90, ['pointer', ['QemuConsole']]],
}],
  '__iterator_traits<llvm::ilist_iterator<llvm::Instruction': [ 0x1, {
}],
  '__unnamed_0x3382': [ 0x28, {
    'version': [0x0, ['unsigned int']],
    'flags': [0x4, ['unsigned int']],
    'disk_sectors': [0x8, ['unsigned int']],
    'granularity': [0xc, ['unsigned int']],
    'l1dir_offset': [0x10, ['unsigned int']],
    'l1dir_size': [0x14, ['unsigned int']],
    'file_sectors': [0x18, ['unsigned int']],
    'cylinders': [0x1c, ['unsigned int']],
    'heads': [0x20, ['unsigned int']],
    'sectors_per_track': [0x24, ['unsigned int']],
}],
  '__unnamed_0x2d21': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['BusState']]],
}],
  'QIODNSResolverLookupData': [ 0x18, {
    'addr': [0x0, ['pointer', ['SocketAddress']]],
    'addrs': [0x8, ['pointer', ['pointer', ['SocketAddress']]]],
    'naddrs': [0x10, ['unsigned long']],
}],
  'virtio_pci_cap': [ 0x10, {
    'cap_vndr': [0x0, ['unsigned char']],
    'cap_next': [0x1, ['unsigned char']],
    'cap_len': [0x2, ['unsigned char']],
    'cfg_type': [0x3, ['unsigned char']],
    'bar': [0x4, ['unsigned char']],
    'padding': [0x5, ['array', 3, ['unsigned char']]],
    'offset': [0x8, ['unsigned int']],
    'length': [0xc, ['unsigned int']],
}],
  'SocketReadState': [ 0x11018, {
    'state': [0x0, ['int']],
    'index': [0x4, ['unsigned int']],
    'packet_len': [0x8, ['unsigned int']],
    'buf': [0xc, ['array', 69632, ['unsigned char']]],
    'finalize': [0x11010, ['pointer', ['void']]],
}],
  'qcrypto_nettle_hmac_alg': [ 0x20, {
    'setkey': [0x0, ['pointer', ['void']]],
    'update': [0x8, ['pointer', ['void']]],
    'digest': [0x10, ['pointer', ['void']]],
    'len': [0x18, ['unsigned long']],
}],
  'mfi_evt_log_state': [ 0x14, {
    'newest_seq_num': [0x0, ['unsigned int']],
    'oldest_seq_num': [0x4, ['unsigned int']],
    'clear_seq_num': [0x8, ['unsigned int']],
    'shutdown_seq_num': [0xc, ['unsigned int']],
    'boot_seq_num': [0x10, ['unsigned int']],
}],
  'Acpi20GenericAddress': [ 0xc, {
    'address_space_id': [0x0, ['unsigned char']],
    'register_bit_width': [0x1, ['unsigned char']],
    'register_bit_offset': [0x2, ['unsigned char']],
    'reserved': [0x3, ['unsigned char']],
    'address': [0x4, ['unsigned long']],
}],
  '__unnamed_0x724e': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['VirtIOSerialPort']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['VirtIOSerialPort']]]],
}],
  'Peer': [ 0x10, {
    'nb_eventfds': [0x0, ['int']],
    'eventfds': [0x8, ['pointer', ['EventNotifier']]],
}],
  'usb_redir_set_configuration_header': [ 0x1, {
    'configuration': [0x0, ['unsigned char']],
}],
  'USBDeviceClass': [ 0x148, {
    'parent_class': [0x0, ['DeviceClass']],
    'realize': [0xc0, ['pointer', ['void']]],
    'unrealize': [0xc8, ['pointer', ['void']]],
    'find_device': [0xd0, ['pointer', ['void']]],
    'cancel_packet': [0xd8, ['pointer', ['void']]],
    'handle_destroy': [0xe0, ['pointer', ['void']]],
    'handle_attach': [0xe8, ['pointer', ['void']]],
    'handle_reset': [0xf0, ['pointer', ['void']]],
    'handle_control': [0xf8, ['pointer', ['void']]],
    'handle_data': [0x100, ['pointer', ['void']]],
    'set_interface': [0x108, ['pointer', ['void']]],
    'flush_ep_queue': [0x110, ['pointer', ['void']]],
    'ep_stopped': [0x118, ['pointer', ['void']]],
    'alloc_streams': [0x120, ['pointer', ['void']]],
    'free_streams': [0x128, ['pointer', ['void']]],
    'product_desc': [0x130, ['pointer', ['char']]],
    'usb_desc': [0x138, ['pointer', ['USBDesc']]],
    'attached_settable': [0x140, ['unsigned char']],
}],
  'rndis_init_cmplt_type': [ 0x34, {
    'MessageType': [0x0, ['unsigned int']],
    'MessageLength': [0x4, ['unsigned int']],
    'RequestID': [0x8, ['unsigned int']],
    'Status': [0xc, ['unsigned int']],
    'MajorVersion': [0x10, ['unsigned int']],
    'MinorVersion': [0x14, ['unsigned int']],
    'DeviceFlags': [0x18, ['unsigned int']],
    'Medium': [0x1c, ['unsigned int']],
    'MaxPacketsPerTransfer': [0x20, ['unsigned int']],
    'MaxTransferSize': [0x24, ['unsigned int']],
    'PacketAlignmentFactor': [0x28, ['unsigned int']],
    'AFListOffset': [0x2c, ['unsigned int']],
    'AFListSize': [0x30, ['unsigned int']],
}],
  'remove_reference<std::pair<std::pair<long int, llvm::Type*': [ 0x1, {
}],
  'ChardevSpiceChannel': [ 0x20, {
    'has_logfile': [0x0, ['unsigned char']],
    'logfile': [0x8, ['pointer', ['char']]],
    'has_logappend': [0x10, ['unsigned char']],
    'logappend': [0x11, ['unsigned char']],
    'type': [0x18, ['pointer', ['char']]],
}],
  'l2cap_chan_s': [ 0x10078, {
    'params': [0x0, ['bt_l2cap_conn_params_s']],
    'frame_in': [0x30, ['pointer', ['void']]],
    'mps': [0x38, ['int']],
    'min_mtu': [0x3c, ['int']],
    'l2cap': [0x40, ['pointer', ['l2cap_instance_s']]],
    'remote_cid': [0x48, ['unsigned short']],
    'config_req_id': [0x4c, ['int']],
    'config': [0x50, ['int']],
    'mode': [0x54, ['int']],
    'sdu': [0x58, ['array', 65536, ['unsigned char']]],
    'len_cur': [0x10058, ['int']],
    'len_total': [0x1005c, ['int']],
    'rexmit': [0x10060, ['int']],
    'monitor_timeout': [0x10064, ['int']],
    'monitor_timer': [0x10068, ['pointer', ['QEMUTimer']]],
    'retransmission_timer': [0x10070, ['pointer', ['QEMUTimer']]],
}],
  'CpuDefinitionInfo': [ 0x20, {
    'name': [0x0, ['pointer', ['char']]],
    'has_migration_safe': [0x8, ['unsigned char']],
    'migration_safe': [0x9, ['unsigned char']],
    'q_static': [0xa, ['unsigned char']],
    'has_unavailable_features': [0xb, ['unsigned char']],
    'unavailable_features': [0x10, ['pointer', ['strList']]],
    'q_typename': [0x18, ['pointer', ['char']]],
}],
  'FlatRange': [ 0x40, {
    'mr': [0x0, ['pointer', ['MemoryRegion']]],
    'offset_in_region': [0x8, ['unsigned long']],
    'addr': [0x10, ['AddrRange']],
    'dirty_log_mask': [0x30, ['unsigned char']],
    'romd_mode': [0x31, ['unsigned char']],
    'readonly': [0x32, ['unsigned char']],
}],
  'ObjectTypeInfo': [ 0x8, {
    'name': [0x0, ['pointer', ['char']]],
}],
  'q_obj_migrate_incoming_arg': [ 0x8, {
    'uri': [0x0, ['pointer', ['char']]],
}],
  'BlkRwCo': [ 0x20, {
    'blk': [0x0, ['pointer', ['BlockBackend']]],
    'offset': [0x8, ['long']],
    'qiov': [0x10, ['pointer', ['QEMUIOVector']]],
    'ret': [0x18, ['int']],
    'flags': [0x1c, ['Enumeration', {'target': 'int', 'choices': {32: 'BDRV_REQ_WRITE_COMPRESSED', 1: 'BDRV_REQ_COPY_ON_READ', 2: 'BDRV_REQ_ZERO_WRITE', 4: 'BDRV_REQ_MAY_UNMAP', 8: 'BDRV_REQ_NO_SERIALISING', 16: 'BDRV_REQ_FUA', 63: 'BDRV_REQ_MASK'}}]],
}],
  'BlockdevOptionsBlkdebug': [ 0x48, {
    'image': [0x0, ['pointer', ['BlockdevRef']]],
    'has_config': [0x8, ['unsigned char']],
    'config': [0x10, ['pointer', ['char']]],
    'has_align': [0x18, ['unsigned char']],
    'align': [0x20, ['long']],
    'has_inject_error': [0x28, ['unsigned char']],
    'inject_error': [0x30, ['pointer', ['BlkdebugInjectErrorOptionsList']]],
    'has_set_state': [0x38, ['unsigned char']],
    'set_state': [0x40, ['pointer', ['BlkdebugSetStateOptionsList']]],
}],
  'intList': [ 0x10, {
    'next': [0x0, ['pointer', ['intList']]],
    'value': [0x8, ['long']],
}],
  'aio_ctx': [ 0x68, {
    'blk': [0x0, ['pointer', ['BlockBackend']]],
    'qiov': [0x8, ['QEMUIOVector']],
    'offset': [0x20, ['long']],
    'buf': [0x28, ['pointer', ['char']]],
    'qflag': [0x30, ['unsigned char']],
    'vflag': [0x31, ['unsigned char']],
    'Cflag': [0x32, ['unsigned char']],
    'Pflag': [0x33, ['unsigned char']],
    'zflag': [0x34, ['unsigned char']],
    'acct': [0x38, ['BlockAcctCookie']],
    'pattern': [0x50, ['int']],
    't1': [0x58, ['timeval']],
}],
  'IPMIFwInfo': [ 0x38, {
    'interface_name': [0x0, ['pointer', ['char']]],
    'interface_type': [0x8, ['int']],
    'ipmi_spec_major_revision': [0xc, ['unsigned char']],
    'ipmi_spec_minor_revision': [0xd, ['unsigned char']],
    'i2c_slave_address': [0xe, ['unsigned char']],
    'uuid': [0x10, ['unsigned int']],
    'base_address': [0x18, ['unsigned long']],
    'register_length': [0x20, ['unsigned long']],
    'register_spacing': [0x28, ['unsigned char']],
    'memspace': [0x2c, ['Enumeration', {'target': 'int', 'choices': {0: 'IPMI_MEMSPACE_IO', 1: 'IPMI_MEMSPACE_MEM32', 2: 'IPMI_MEMSPACE_MEM64', 3: 'IPMI_MEMSPACE_SMBUS'}}]],
    'interrupt_number': [0x30, ['int']],
    'irq_type': [0x34, ['Enumeration', {'target': 'int', 'choices': {0: 'IPMI_LEVEL_IRQ', 1: 'IPMI_EDGE_IRQ'}}]],
}],
  'smbios_uuid': [ 0x10, {
    'time_low': [0x0, ['unsigned int']],
    'time_mid': [0x4, ['unsigned short']],
    'time_hi_and_version': [0x6, ['unsigned short']],
    'clock_seq_hi_and_reserved': [0x8, ['unsigned char']],
    'clock_seq_low': [0x9, ['unsigned char']],
    'node': [0xa, ['array', 6, ['unsigned char']]],
}],
  'SpiceChannel': [ 0x38, {
    'host': [0x0, ['pointer', ['char']]],
    'port': [0x8, ['pointer', ['char']]],
    'family': [0x10, ['Enumeration', {'target': 'int', 'choices': {0: 'NETWORK_ADDRESS_FAMILY_IPV4', 1: 'NETWORK_ADDRESS_FAMILY_IPV6', 2: 'NETWORK_ADDRESS_FAMILY_UNIX', 3: 'NETWORK_ADDRESS_FAMILY_VSOCK', 4: 'NETWORK_ADDRESS_FAMILY_UNKNOWN', 5: 'NETWORK_ADDRESS_FAMILY__MAX'}}]],
    'connection_id': [0x18, ['long']],
    'channel_type': [0x20, ['long']],
    'channel_id': [0x28, ['long']],
    'tls': [0x30, ['unsigned char']],
}],
  'PCIXenPlatformState': [ 0x1c00, {
    'parent_obj': [0x0, ['PCIDevice']],
    'fixed_io': [0x8f0, ['MemoryRegion']],
    'bar': [0x9f0, ['MemoryRegion']],
    'mmio_bar': [0xaf0, ['MemoryRegion']],
    'flags': [0xbf0, ['unsigned char']],
    'drivers_blacklisted': [0xbf4, ['int']],
    'driver_product_version': [0xbf8, ['unsigned short']],
    'log_buffer': [0xbfa, ['array', 4096, ['char']]],
    'log_buffer_off': [0x1bfc, ['int']],
}],
  'rebind<char': [ 0x1, {
}],
  'SmallVectorStorage<void const*, 32u': [ 0xf8, {
    'InlineElts': [0x0, ['array', 31, ['AlignedCharArrayUnion<void const*, char, char, char, char, char, char']]],
}],
  'ISADebugExitState': [ 0x190, {
    'parent_obj': [0x0, ['ISADevice']],
    'iobase': [0x80, ['unsigned int']],
    'iosize': [0x84, ['unsigned int']],
    'io': [0x90, ['MemoryRegion']],
}],
  'VirtIOBalloonPCI': [ 0x8580, {
    'parent_obj': [0x0, ['VirtIOPCIProxy']],
    'vdev': [0x8410, ['VirtIOBalloon']],
}],
  'VFIOMSIVector': [ 0x20, {
    'interrupt': [0x0, ['EventNotifier']],
    'kvm_interrupt': [0x8, ['EventNotifier']],
    'vdev': [0x10, ['pointer', ['VFIOPCIDevice']]],
    'virq': [0x18, ['int']],
    'use': [0x1c, ['unsigned char']],
}],
  'bt_host_hci_s': [ 0x620, {
    'hci': [0x0, ['HCIInfo']],
    'fd': [0x38, ['int']],
    'hdr': [0x3c, ['array', 1500, ['unsigned char']]],
    'len': [0x618, ['int']],
}],
  'BDRVRawState': [ 0x20, {
    'fd': [0x0, ['int']],
    'type': [0x4, ['int']],
    'open_flags': [0x8, ['int']],
    'buf_align': [0x10, ['unsigned long']],
    'discard_zeroes': [0x18, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'has_discard': [0x18, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'has_write_zeroes': [0x18, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'is_xfs': [0x18, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'use_linux_aio': [0x18, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'has_fallocate': [0x19, ['unsigned char']],
    'needs_alignment': [0x1a, ['unsigned char']],
}],
  'hci_event_hdr': [ 0x2, {
    'evt': [0x0, ['unsigned char']],
    'plen': [0x1, ['unsigned char']],
}],
  'new_allocator<std::pair<unsigned int, unsigned int': [ 0x1, {
}],
  'ohci_ed': [ 0x10, {
    'flags': [0x0, ['unsigned int']],
    'tail': [0x4, ['unsigned int']],
    'head': [0x8, ['unsigned int']],
    'next': [0xc, ['unsigned int']],
}],
  'InputKeyEvent': [ 0x10, {
    'key': [0x0, ['pointer', ['KeyValue']]],
    'down': [0x8, ['unsigned char']],
}],
  'V9fsXattr': [ 0x30, {
    'copied_len': [0x0, ['unsigned long']],
    'len': [0x8, ['unsigned long']],
    'value': [0x10, ['pointer', ['void']]],
    'name': [0x18, ['V9fsString']],
    'flags': [0x28, ['int']],
    'xattrwalk_fid': [0x2c, ['unsigned char']],
}],
  '__unnamed_0x7ed': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['NotifierWithReturn']]],
}],
  'csrhci_s': [ 0x30e8, {
    'parent': [0x0, ['Chardev']],
    'enable': [0x90, ['int']],
    'pins': [0x98, ['pointer', ['pointer', ['IRQState']]]],
    'pin_state': [0xa0, ['int']],
    'modem_state': [0xa4, ['int']],
    'out_start': [0xa8, ['int']],
    'out_len': [0xac, ['int']],
    'out_size': [0xb0, ['int']],
    'outfifo': [0xb4, ['array', 8192, ['unsigned char']]],
    'inpkt': [0x20b4, ['array', 4096, ['unsigned char']]],
    'in_state': [0x30b4, ['Enumeration', {'target': 'int', 'choices': {0: 'CSR_HDR_LEN', 1: 'CSR_DATA_LEN', 2: 'CSR_DATA'}}]],
    'in_len': [0x30b8, ['int']],
    'in_hdr': [0x30bc, ['int']],
    'in_needed': [0x30c0, ['int']],
    'out_tm': [0x30c8, ['pointer', ['QEMUTimer']]],
    'baud_delay': [0x30d0, ['long']],
    'bd_addr': [0x30d8, ['__unnamed_0x1f4f']],
    'hci': [0x30e0, ['pointer', ['HCIInfo']]],
}],
  '__unnamed_0x22a5': [ 0x58, {
    'type': [0x0, ['int']],
    'serial': [0x8, ['unsigned long']],
    'send_event': [0x10, ['int']],
    'display': [0x18, ['pointer', ['_XDisplay']]],
    'event': [0x20, ['unsigned long']],
    'window': [0x28, ['unsigned long']],
    'x': [0x30, ['int']],
    'y': [0x34, ['int']],
    'width': [0x38, ['int']],
    'height': [0x3c, ['int']],
    'border_width': [0x40, ['int']],
    'above': [0x48, ['unsigned long']],
    'override_redirect': [0x50, ['int']],
}],
  'q_obj_object_del_arg': [ 0x8, {
    'id': [0x0, ['pointer', ['char']]],
}],
  'isa_impl_wrap<llvm::VectorType, const llvm::Type*, const llvm::Type*': [ 0x1, {
}],
  'smbios_structure_header': [ 0x4, {
    'type': [0x0, ['unsigned char']],
    'length': [0x1, ['unsigned char']],
    'handle': [0x2, ['unsigned short']],
}],
  'vhost_virtqueue': [ 0x68, {
    'kick': [0x0, ['int']],
    'call': [0x4, ['int']],
    'desc': [0x8, ['pointer', ['void']]],
    'avail': [0x10, ['pointer', ['void']]],
    'used': [0x18, ['pointer', ['void']]],
    'num': [0x20, ['int']],
    'desc_phys': [0x28, ['unsigned long long']],
    'desc_size': [0x30, ['unsigned int']],
    'avail_phys': [0x38, ['unsigned long long']],
    'avail_size': [0x40, ['unsigned int']],
    'used_phys': [0x48, ['unsigned long long']],
    'used_size': [0x50, ['unsigned int']],
    'masked_notifier': [0x54, ['EventNotifier']],
    'dev': [0x60, ['pointer', ['vhost_dev']]],
}],
  '__unnamed_0x141d': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['Slirp']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['Slirp']]]],
}],
  'pvclock_vcpu_time_info': [ 0x20, {
    'version': [0x0, ['unsigned int']],
    'pad0': [0x4, ['unsigned int']],
    'tsc_timestamp': [0x8, ['unsigned long']],
    'system_time': [0x10, ['unsigned long']],
    'tsc_to_system_mul': [0x18, ['unsigned int']],
    'tsc_shift': [0x1c, ['signed char']],
    'flags': [0x1d, ['unsigned char']],
    'pad': [0x1e, ['array', 2, ['unsigned char']]],
}],
  'MPIMsgSCSIIORequest': [ 0x30, {
    'TargetID': [0x0, ['unsigned char']],
    'Bus': [0x1, ['unsigned char']],
    'ChainOffset': [0x2, ['unsigned char']],
    'Function': [0x3, ['unsigned char']],
    'CDBLength': [0x4, ['unsigned char']],
    'SenseBufferLength': [0x5, ['unsigned char']],
    'Reserved': [0x6, ['unsigned char']],
    'MsgFlags': [0x7, ['unsigned char']],
    'MsgContext': [0x8, ['unsigned int']],
    'LUN': [0xc, ['array', 8, ['unsigned char']]],
    'Control': [0x14, ['unsigned int']],
    'CDB': [0x18, ['array', 16, ['unsigned char']]],
    'DataLength': [0x28, ['unsigned int']],
    'SenseBufferLowAddr': [0x2c, ['unsigned int']],
}],
  '__unnamed_0x3a52': [ 0x4, {
    'tucss': [0x0, ['unsigned char']],
    'tucso': [0x1, ['unsigned char']],
    'tucse': [0x2, ['unsigned short']],
}],
  'q_obj_begin_replay_arg': [ 0x8, {
    'file_name': [0x0, ['pointer', ['char']]],
}],
  'QapiCloneVisitor': [ 0xa8, {
    'visitor': [0x0, ['Visitor']],
    'depth': [0xa0, ['unsigned long']],
}],
  'LeakyBucket': [ 0x28, {
    'avg': [0x0, ['double']],
    'max': [0x8, ['double']],
    'level': [0x10, ['double']],
    'burst_level': [0x18, ['double']],
    'burst_length': [0x20, ['unsigned int']],
}],
  '__unnamed_0x350e': [ 0x4, {
    'u32': [0x0, ['unsigned int']],
    'u16': [0x0, ['icount_decr_u16']],
}],
  'ImageEntry': [ 0x28, {
    'imagename': [0x0, ['pointer', ['char']]],
    'next': [0x8, ['__unnamed_0xd9e5']],
    'snapshots': [0x18, ['__unnamed_0xda09']],
}],
  'AddressSpaceDispatch': [ 0x58, {
    'rcu': [0x0, ['rcu_head']],
    'mru_section': [0x10, ['pointer', ['MemoryRegionSection']]],
    'phys_map': [0x18, ['PhysPageEntry']],
    'map': [0x20, ['PhysPageMap']],
    'as': [0x50, ['pointer', ['AddressSpace']]],
}],
  'dotl_openflag_map': [ 0x8, {
    'dotl_flag': [0x0, ['int']],
    'open_flag': [0x4, ['int']],
}],
  'VMPortState': [ 0x440, {
    'parent_obj': [0x0, ['ISADevice']],
    'io': [0x80, ['MemoryRegion']],
    'func': [0x180, ['array', 44, ['pointer', ['void']]]],
    'opaque': [0x2e0, ['array', 44, ['pointer', ['void']]]],
}],
  'MPTSASState': [ 0x18f0, {
    'dev': [0x0, ['PCIDevice']],
    'mmio_io': [0x8f0, ['MemoryRegion']],
    'port_io': [0x9f0, ['MemoryRegion']],
    'diag_io': [0xaf0, ['MemoryRegion']],
    'request_bh': [0xbf0, ['pointer', ['QEMUBH']]],
    'msi': [0xbf8, ['Enumeration', {'target': 'int', 'choices': {0: 'ON_OFF_AUTO_AUTO', 1: 'ON_OFF_AUTO_ON', 2: 'ON_OFF_AUTO_OFF', 3: 'ON_OFF_AUTO__MAX'}}]],
    'sas_addr': [0xc00, ['unsigned long']],
    'msi_in_use': [0xc08, ['unsigned char']],
    'state': [0xc0c, ['unsigned int']],
    'who_init': [0xc10, ['unsigned char']],
    'doorbell_state': [0xc11, ['unsigned char']],
    'doorbell_msg': [0xc14, ['array', 256, ['unsigned int']]],
    'doorbell_idx': [0x1014, ['int']],
    'doorbell_cnt': [0x1018, ['int']],
    'doorbell_reply': [0x101c, ['array', 256, ['unsigned short']]],
    'doorbell_reply_idx': [0x121c, ['int']],
    'doorbell_reply_size': [0x1220, ['int']],
    'diagnostic_idx': [0x1224, ['unsigned char']],
    'diagnostic': [0x1228, ['unsigned int']],
    'intr_mask': [0x122c, ['unsigned int']],
    'intr_status': [0x1230, ['unsigned int']],
    'request_post': [0x1234, ['array', 129, ['unsigned int']]],
    'request_post_head': [0x1438, ['unsigned short']],
    'request_post_tail': [0x143a, ['unsigned short']],
    'reply_post': [0x143c, ['array', 129, ['unsigned int']]],
    'reply_post_head': [0x1640, ['unsigned short']],
    'reply_post_tail': [0x1642, ['unsigned short']],
    'reply_free': [0x1644, ['array', 129, ['unsigned int']]],
    'reply_free_head': [0x1848, ['unsigned short']],
    'reply_free_tail': [0x184a, ['unsigned short']],
    'host_mfa_high_addr': [0x1850, ['unsigned long']],
    'sense_buffer_high_addr': [0x1858, ['unsigned long']],
    'max_devices': [0x1860, ['unsigned short']],
    'max_buses': [0x1862, ['unsigned short']],
